#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaDirectAcquisitionOfferPurchasedWidget

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AthenaDirectAcquisitionOfferPurchasedWidget.AthenaDirectAcquisitionOfferPurchasedWidget_C.ExecuteUbergraph_AthenaDirectAcquisitionOfferPurchasedWidget
// 0x0030 (0x0030 - 0x0000)
struct AthenaDirectAcquisitionOfferPurchasedWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferPurchasedWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                    K2Node_MakeStruct_DataTableRowHandle;              // 0x0010(0x0010)(NoDestructor)
	TDelegate<void(bool* bPassThrough)>           K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(AthenaDirectAcquisitionOfferPurchasedWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferPurchasedWidget) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferPurchasedWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferPurchasedWidget");
static_assert(sizeof(AthenaDirectAcquisitionOfferPurchasedWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferPurchasedWidget) == 0x000030, "Wrong size on AthenaDirectAcquisitionOfferPurchasedWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferPurchasedWidget");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferPurchasedWidget, EntryPoint) == 0x000000, "Member 'AthenaDirectAcquisitionOfferPurchasedWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferPurchasedWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferPurchasedWidget, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaDirectAcquisitionOfferPurchasedWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferPurchasedWidget::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferPurchasedWidget, K2Node_MakeStruct_DataTableRowHandle) == 0x000010, "Member 'AthenaDirectAcquisitionOfferPurchasedWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferPurchasedWidget::K2Node_MakeStruct_DataTableRowHandle' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferPurchasedWidget, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'AthenaDirectAcquisitionOfferPurchasedWidget_C_ExecuteUbergraph_AthenaDirectAcquisitionOfferPurchasedWidget::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferPurchasedWidget.AthenaDirectAcquisitionOfferPurchasedWidget_C.UpdateFromOffer
// 0x0120 (0x0120 - 0x0000)
struct AthenaDirectAcquisitionOfferPurchasedWidget_C_UpdateFromOffer final
{
public:
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue2;             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicFontMaterial_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortDirectAcquisitionOfferInfo*        CallFunc_GetOfferInfo_ReturnValue;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue2;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetName_ReturnValue;                      // 0x0030(0x0018)()
	class FText                                   CallFunc_TextToUpper_ReturnValue;                  // 0x0048(0x0018)()
	class UFortDirectAcquisitionOfferInfo*        CallFunc_GetOfferInfo_ReturnValue2;                // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAccountItemDefinition*             CallFunc_GetFirstGrantItemDefinition_ReturnValue;  // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItem*                              CallFunc_CreateTemporaryItemInstanceBP_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortRarity                                   CallFunc_GetRarity_ReturnValue;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortRarityItemData                    CallFunc_BPGetRarityData_ReturnValue;              // 0x0080(0x0080)()
	float                                         CallFunc_BreakColor_R;                             // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G;                             // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B;                             // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A;                             // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x0110(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAcquisitionOfferPurchasedWidget_C_UpdateFromOffer) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferPurchasedWidget_C_UpdateFromOffer");
static_assert(sizeof(AthenaDirectAcquisitionOfferPurchasedWidget_C_UpdateFromOffer) == 0x000120, "Wrong size on AthenaDirectAcquisitionOfferPurchasedWidget_C_UpdateFromOffer");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedWidget_C_UpdateFromOffer, CallFunc_MakeLiteralName_ReturnValue) == 0x000000, "Member 'AthenaDirectAcquisitionOfferPurchasedWidget_C_UpdateFromOffer::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedWidget_C_UpdateFromOffer, CallFunc_MakeLiteralName_ReturnValue2) == 0x000008, "Member 'AthenaDirectAcquisitionOfferPurchasedWidget_C_UpdateFromOffer::CallFunc_MakeLiteralName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedWidget_C_UpdateFromOffer, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000010, "Member 'AthenaDirectAcquisitionOfferPurchasedWidget_C_UpdateFromOffer::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedWidget_C_UpdateFromOffer, CallFunc_GetDynamicFontMaterial_ReturnValue) == 0x000018, "Member 'AthenaDirectAcquisitionOfferPurchasedWidget_C_UpdateFromOffer::CallFunc_GetDynamicFontMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedWidget_C_UpdateFromOffer, CallFunc_GetOfferInfo_ReturnValue) == 0x000020, "Member 'AthenaDirectAcquisitionOfferPurchasedWidget_C_UpdateFromOffer::CallFunc_GetOfferInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedWidget_C_UpdateFromOffer, CallFunc_GetDynamicMaterial_ReturnValue2) == 0x000028, "Member 'AthenaDirectAcquisitionOfferPurchasedWidget_C_UpdateFromOffer::CallFunc_GetDynamicMaterial_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedWidget_C_UpdateFromOffer, CallFunc_GetName_ReturnValue) == 0x000030, "Member 'AthenaDirectAcquisitionOfferPurchasedWidget_C_UpdateFromOffer::CallFunc_GetName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedWidget_C_UpdateFromOffer, CallFunc_TextToUpper_ReturnValue) == 0x000048, "Member 'AthenaDirectAcquisitionOfferPurchasedWidget_C_UpdateFromOffer::CallFunc_TextToUpper_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedWidget_C_UpdateFromOffer, CallFunc_GetOfferInfo_ReturnValue2) == 0x000060, "Member 'AthenaDirectAcquisitionOfferPurchasedWidget_C_UpdateFromOffer::CallFunc_GetOfferInfo_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedWidget_C_UpdateFromOffer, CallFunc_GetFirstGrantItemDefinition_ReturnValue) == 0x000068, "Member 'AthenaDirectAcquisitionOfferPurchasedWidget_C_UpdateFromOffer::CallFunc_GetFirstGrantItemDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedWidget_C_UpdateFromOffer, CallFunc_CreateTemporaryItemInstanceBP_ReturnValue) == 0x000070, "Member 'AthenaDirectAcquisitionOfferPurchasedWidget_C_UpdateFromOffer::CallFunc_CreateTemporaryItemInstanceBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedWidget_C_UpdateFromOffer, CallFunc_GetRarity_ReturnValue) == 0x000078, "Member 'AthenaDirectAcquisitionOfferPurchasedWidget_C_UpdateFromOffer::CallFunc_GetRarity_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedWidget_C_UpdateFromOffer, CallFunc_BPGetRarityData_ReturnValue) == 0x000080, "Member 'AthenaDirectAcquisitionOfferPurchasedWidget_C_UpdateFromOffer::CallFunc_BPGetRarityData_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedWidget_C_UpdateFromOffer, CallFunc_BreakColor_R) == 0x000100, "Member 'AthenaDirectAcquisitionOfferPurchasedWidget_C_UpdateFromOffer::CallFunc_BreakColor_R' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedWidget_C_UpdateFromOffer, CallFunc_BreakColor_G) == 0x000104, "Member 'AthenaDirectAcquisitionOfferPurchasedWidget_C_UpdateFromOffer::CallFunc_BreakColor_G' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedWidget_C_UpdateFromOffer, CallFunc_BreakColor_B) == 0x000108, "Member 'AthenaDirectAcquisitionOfferPurchasedWidget_C_UpdateFromOffer::CallFunc_BreakColor_B' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedWidget_C_UpdateFromOffer, CallFunc_BreakColor_A) == 0x00010C, "Member 'AthenaDirectAcquisitionOfferPurchasedWidget_C_UpdateFromOffer::CallFunc_BreakColor_A' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedWidget_C_UpdateFromOffer, CallFunc_MakeColor_ReturnValue) == 0x000110, "Member 'AthenaDirectAcquisitionOfferPurchasedWidget_C_UpdateFromOffer::CallFunc_MakeColor_ReturnValue' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferPurchasedWidget.AthenaDirectAcquisitionOfferPurchasedWidget_C.HandleBack
// 0x0001 (0x0001 - 0x0000)
struct AthenaDirectAcquisitionOfferPurchasedWidget_C_HandleBack final
{
public:
	bool                                          PassThrough;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaDirectAcquisitionOfferPurchasedWidget_C_HandleBack) == 0x000001, "Wrong alignment on AthenaDirectAcquisitionOfferPurchasedWidget_C_HandleBack");
static_assert(sizeof(AthenaDirectAcquisitionOfferPurchasedWidget_C_HandleBack) == 0x000001, "Wrong size on AthenaDirectAcquisitionOfferPurchasedWidget_C_HandleBack");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedWidget_C_HandleBack, PassThrough) == 0x000000, "Member 'AthenaDirectAcquisitionOfferPurchasedWidget_C_HandleBack::PassThrough' has a wrong offset!");

// Function AthenaDirectAcquisitionOfferPurchasedWidget.AthenaDirectAcquisitionOfferPurchasedWidget_C.PopScreen
// 0x0008 (0x0008 - 0x0000)
struct AthenaDirectAcquisitionOfferPurchasedWidget_C_PopScreen final
{
public:
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAcquisitionOfferPurchasedWidget_C_PopScreen) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionOfferPurchasedWidget_C_PopScreen");
static_assert(sizeof(AthenaDirectAcquisitionOfferPurchasedWidget_C_PopScreen) == 0x000008, "Wrong size on AthenaDirectAcquisitionOfferPurchasedWidget_C_PopScreen");
static_assert(offsetof(AthenaDirectAcquisitionOfferPurchasedWidget_C_PopScreen, CallFunc_GetUIManagerWidget_ReturnValue) == 0x000000, "Member 'AthenaDirectAcquisitionOfferPurchasedWidget_C_PopScreen::CallFunc_GetUIManagerWidget_ReturnValue' has a wrong offset!");

}

