#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaDirectAcquisitionScreen

#include "Basic.hpp"

#include "GameSubCatalog_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function AthenaDirectAcquisitionScreen.AthenaDirectAcquisitionScreen_C.ExecuteUbergraph_AthenaDirectAcquisitionScreen
// 0x0030 (0x0030 - 0x0000)
struct AthenaDirectAcquisitionScreen_C_ExecuteUbergraph_AthenaDirectAcquisitionScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActivated_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              CallFunc_GetWeeklyStoreEndDate_ReturnValue;        // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_GetDailyStoreEndDate_ReturnValue;         // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue2;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAcquisitionScreen_C_ExecuteUbergraph_AthenaDirectAcquisitionScreen) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionScreen_C_ExecuteUbergraph_AthenaDirectAcquisitionScreen");
static_assert(sizeof(AthenaDirectAcquisitionScreen_C_ExecuteUbergraph_AthenaDirectAcquisitionScreen) == 0x000030, "Wrong size on AthenaDirectAcquisitionScreen_C_ExecuteUbergraph_AthenaDirectAcquisitionScreen");
static_assert(offsetof(AthenaDirectAcquisitionScreen_C_ExecuteUbergraph_AthenaDirectAcquisitionScreen, EntryPoint) == 0x000000, "Member 'AthenaDirectAcquisitionScreen_C_ExecuteUbergraph_AthenaDirectAcquisitionScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionScreen_C_ExecuteUbergraph_AthenaDirectAcquisitionScreen, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaDirectAcquisitionScreen_C_ExecuteUbergraph_AthenaDirectAcquisitionScreen::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionScreen_C_ExecuteUbergraph_AthenaDirectAcquisitionScreen, CallFunc_IsActivated_ReturnValue) == 0x000010, "Member 'AthenaDirectAcquisitionScreen_C_ExecuteUbergraph_AthenaDirectAcquisitionScreen::CallFunc_IsActivated_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionScreen_C_ExecuteUbergraph_AthenaDirectAcquisitionScreen, CallFunc_GetWeeklyStoreEndDate_ReturnValue) == 0x000018, "Member 'AthenaDirectAcquisitionScreen_C_ExecuteUbergraph_AthenaDirectAcquisitionScreen::CallFunc_GetWeeklyStoreEndDate_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionScreen_C_ExecuteUbergraph_AthenaDirectAcquisitionScreen, CallFunc_GetDailyStoreEndDate_ReturnValue) == 0x000020, "Member 'AthenaDirectAcquisitionScreen_C_ExecuteUbergraph_AthenaDirectAcquisitionScreen::CallFunc_GetDailyStoreEndDate_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionScreen_C_ExecuteUbergraph_AthenaDirectAcquisitionScreen, CallFunc_GetContext_ReturnValue2) == 0x000028, "Member 'AthenaDirectAcquisitionScreen_C_ExecuteUbergraph_AthenaDirectAcquisitionScreen::CallFunc_GetContext_ReturnValue2' has a wrong offset!");

// Function AthenaDirectAcquisitionScreen.AthenaDirectAcquisitionScreen_C.GenerateOfferWidget
// 0x0240 (0x0240 - 0x0000)
struct AthenaDirectAcquisitionScreen_C_GenerateOfferWidget final
{
public:
	class FName                                   StorefrontName;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCatalogOffer                          Offer;                                             // 0x0008(0x01D0)(ConstParm, Parm, OutParm, ReferenceParm)
	const class UFortMtxOfferData*                DisplayAsset;                                      // 0x01D8(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortDirectAcquisitionOfferWidgetBase*  ReturnValue;                                       // 0x01E0(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_20D[0x3];                                      // 0x020D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0218(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_219[0x7];                                      // 0x0219(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaDirectAcquisitionOfferWidget_C*  CallFunc_Create_ReturnValue;                       // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_AddChildToGrid_ReturnValue;               // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAcquisitionScreen_C_GenerateOfferWidget) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionScreen_C_GenerateOfferWidget");
static_assert(sizeof(AthenaDirectAcquisitionScreen_C_GenerateOfferWidget) == 0x000240, "Wrong size on AthenaDirectAcquisitionScreen_C_GenerateOfferWidget");
static_assert(offsetof(AthenaDirectAcquisitionScreen_C_GenerateOfferWidget, StorefrontName) == 0x000000, "Member 'AthenaDirectAcquisitionScreen_C_GenerateOfferWidget::StorefrontName' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionScreen_C_GenerateOfferWidget, Offer) == 0x000008, "Member 'AthenaDirectAcquisitionScreen_C_GenerateOfferWidget::Offer' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionScreen_C_GenerateOfferWidget, DisplayAsset) == 0x0001D8, "Member 'AthenaDirectAcquisitionScreen_C_GenerateOfferWidget::DisplayAsset' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionScreen_C_GenerateOfferWidget, ReturnValue) == 0x0001E0, "Member 'AthenaDirectAcquisitionScreen_C_GenerateOfferWidget::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionScreen_C_GenerateOfferWidget, CallFunc_Array_Get_Item) == 0x0001E8, "Member 'AthenaDirectAcquisitionScreen_C_GenerateOfferWidget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionScreen_C_GenerateOfferWidget, CallFunc_GetChildrenCount_ReturnValue) == 0x0001F8, "Member 'AthenaDirectAcquisitionScreen_C_GenerateOfferWidget::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionScreen_C_GenerateOfferWidget, CallFunc_Conv_StringToName_ReturnValue) == 0x000200, "Member 'AthenaDirectAcquisitionScreen_C_GenerateOfferWidget::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionScreen_C_GenerateOfferWidget, CallFunc_Subtract_IntInt_ReturnValue) == 0x000208, "Member 'AthenaDirectAcquisitionScreen_C_GenerateOfferWidget::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionScreen_C_GenerateOfferWidget, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00020C, "Member 'AthenaDirectAcquisitionScreen_C_GenerateOfferWidget::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionScreen_C_GenerateOfferWidget, CallFunc_Percent_IntInt_ReturnValue) == 0x000210, "Member 'AthenaDirectAcquisitionScreen_C_GenerateOfferWidget::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionScreen_C_GenerateOfferWidget, CallFunc_Divide_IntInt_ReturnValue) == 0x000214, "Member 'AthenaDirectAcquisitionScreen_C_GenerateOfferWidget::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionScreen_C_GenerateOfferWidget, CallFunc_IsValid_ReturnValue) == 0x000218, "Member 'AthenaDirectAcquisitionScreen_C_GenerateOfferWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionScreen_C_GenerateOfferWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000220, "Member 'AthenaDirectAcquisitionScreen_C_GenerateOfferWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionScreen_C_GenerateOfferWidget, CallFunc_Create_ReturnValue) == 0x000228, "Member 'AthenaDirectAcquisitionScreen_C_GenerateOfferWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionScreen_C_GenerateOfferWidget, CallFunc_AddChildToGrid_ReturnValue) == 0x000230, "Member 'AthenaDirectAcquisitionScreen_C_GenerateOfferWidget::CallFunc_AddChildToGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaDirectAcquisitionScreen_C_GenerateOfferWidget, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000238, "Member 'AthenaDirectAcquisitionScreen_C_GenerateOfferWidget::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");

// Function AthenaDirectAcquisitionScreen.AthenaDirectAcquisitionScreen_C.Focus
// 0x0008 (0x0008 - 0x0000)
struct AthenaDirectAcquisitionScreen_C_Focus final
{
public:
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaDirectAcquisitionScreen_C_Focus) == 0x000008, "Wrong alignment on AthenaDirectAcquisitionScreen_C_Focus");
static_assert(sizeof(AthenaDirectAcquisitionScreen_C_Focus) == 0x000008, "Wrong size on AthenaDirectAcquisitionScreen_C_Focus");
static_assert(offsetof(AthenaDirectAcquisitionScreen_C_Focus, CallFunc_GetUINavigationManager_ReturnValue) == 0x000000, "Member 'AthenaDirectAcquisitionScreen_C_Focus::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");

}

