#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaSeasonDirectAcquisitionScreen

#include "Basic.hpp"

#include "GameSubCatalog_structs.hpp"


namespace SDK::Params
{

// Function AthenaSeasonDirectAcquisitionScreen.AthenaSeasonDirectAcquisitionScreen_C.ExecuteUbergraph_AthenaSeasonDirectAcquisitionScreen
// 0x0018 (0x0018 - 0x0000)
struct AthenaSeasonDirectAcquisitionScreen_C_ExecuteUbergraph_AthenaSeasonDirectAcquisitionScreen final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActivated_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AthenaSeasonDirectAcquisitionScreen_C_ExecuteUbergraph_AthenaSeasonDirectAcquisitionScreen) == 0x000008, "Wrong alignment on AthenaSeasonDirectAcquisitionScreen_C_ExecuteUbergraph_AthenaSeasonDirectAcquisitionScreen");
static_assert(sizeof(AthenaSeasonDirectAcquisitionScreen_C_ExecuteUbergraph_AthenaSeasonDirectAcquisitionScreen) == 0x000018, "Wrong size on AthenaSeasonDirectAcquisitionScreen_C_ExecuteUbergraph_AthenaSeasonDirectAcquisitionScreen");
static_assert(offsetof(AthenaSeasonDirectAcquisitionScreen_C_ExecuteUbergraph_AthenaSeasonDirectAcquisitionScreen, EntryPoint) == 0x000000, "Member 'AthenaSeasonDirectAcquisitionScreen_C_ExecuteUbergraph_AthenaSeasonDirectAcquisitionScreen::EntryPoint' has a wrong offset!");
static_assert(offsetof(AthenaSeasonDirectAcquisitionScreen_C_ExecuteUbergraph_AthenaSeasonDirectAcquisitionScreen, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'AthenaSeasonDirectAcquisitionScreen_C_ExecuteUbergraph_AthenaSeasonDirectAcquisitionScreen::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonDirectAcquisitionScreen_C_ExecuteUbergraph_AthenaSeasonDirectAcquisitionScreen, CallFunc_IsActivated_ReturnValue) == 0x000010, "Member 'AthenaSeasonDirectAcquisitionScreen_C_ExecuteUbergraph_AthenaSeasonDirectAcquisitionScreen::CallFunc_IsActivated_ReturnValue' has a wrong offset!");

// Function AthenaSeasonDirectAcquisitionScreen.AthenaSeasonDirectAcquisitionScreen_C.GenerateOfferWidget
// 0x0220 (0x0220 - 0x0000)
struct AthenaSeasonDirectAcquisitionScreen_C_GenerateOfferWidget final
{
public:
	class FName                                   StorefrontName;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCatalogOffer                          Offer;                                             // 0x0008(0x01D0)(ConstParm, Parm, OutParm, ReferenceParm)
	const class UFortMtxOfferData*                DisplayAsset;                                      // 0x01D8(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortDirectAcquisitionOfferWidgetBase*  ReturnValue;                                       // 0x01E0(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x3];                                      // 0x01E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x01F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F5[0x3];                                      // 0x01F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAthenaDirectAcquisitionOfferWidget_C*  CallFunc_Create_ReturnValue;                       // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGridSlot*                              CallFunc_AddChildToGrid_ReturnValue;               // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                     CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonDirectAcquisitionScreen_C_GenerateOfferWidget) == 0x000008, "Wrong alignment on AthenaSeasonDirectAcquisitionScreen_C_GenerateOfferWidget");
static_assert(sizeof(AthenaSeasonDirectAcquisitionScreen_C_GenerateOfferWidget) == 0x000220, "Wrong size on AthenaSeasonDirectAcquisitionScreen_C_GenerateOfferWidget");
static_assert(offsetof(AthenaSeasonDirectAcquisitionScreen_C_GenerateOfferWidget, StorefrontName) == 0x000000, "Member 'AthenaSeasonDirectAcquisitionScreen_C_GenerateOfferWidget::StorefrontName' has a wrong offset!");
static_assert(offsetof(AthenaSeasonDirectAcquisitionScreen_C_GenerateOfferWidget, Offer) == 0x000008, "Member 'AthenaSeasonDirectAcquisitionScreen_C_GenerateOfferWidget::Offer' has a wrong offset!");
static_assert(offsetof(AthenaSeasonDirectAcquisitionScreen_C_GenerateOfferWidget, DisplayAsset) == 0x0001D8, "Member 'AthenaSeasonDirectAcquisitionScreen_C_GenerateOfferWidget::DisplayAsset' has a wrong offset!");
static_assert(offsetof(AthenaSeasonDirectAcquisitionScreen_C_GenerateOfferWidget, ReturnValue) == 0x0001E0, "Member 'AthenaSeasonDirectAcquisitionScreen_C_GenerateOfferWidget::ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonDirectAcquisitionScreen_C_GenerateOfferWidget, CallFunc_IsValid_ReturnValue) == 0x0001E8, "Member 'AthenaSeasonDirectAcquisitionScreen_C_GenerateOfferWidget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonDirectAcquisitionScreen_C_GenerateOfferWidget, CallFunc_GetChildrenCount_ReturnValue) == 0x0001EC, "Member 'AthenaSeasonDirectAcquisitionScreen_C_GenerateOfferWidget::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonDirectAcquisitionScreen_C_GenerateOfferWidget, CallFunc_Subtract_IntInt_ReturnValue) == 0x0001F0, "Member 'AthenaSeasonDirectAcquisitionScreen_C_GenerateOfferWidget::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonDirectAcquisitionScreen_C_GenerateOfferWidget, CallFunc_IsValid_ReturnValue2) == 0x0001F4, "Member 'AthenaSeasonDirectAcquisitionScreen_C_GenerateOfferWidget::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(AthenaSeasonDirectAcquisitionScreen_C_GenerateOfferWidget, CallFunc_Percent_IntInt_ReturnValue) == 0x0001F8, "Member 'AthenaSeasonDirectAcquisitionScreen_C_GenerateOfferWidget::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonDirectAcquisitionScreen_C_GenerateOfferWidget, CallFunc_Divide_IntInt_ReturnValue) == 0x0001FC, "Member 'AthenaSeasonDirectAcquisitionScreen_C_GenerateOfferWidget::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonDirectAcquisitionScreen_C_GenerateOfferWidget, CallFunc_GetOwningPlayer_ReturnValue) == 0x000200, "Member 'AthenaSeasonDirectAcquisitionScreen_C_GenerateOfferWidget::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonDirectAcquisitionScreen_C_GenerateOfferWidget, CallFunc_Create_ReturnValue) == 0x000208, "Member 'AthenaSeasonDirectAcquisitionScreen_C_GenerateOfferWidget::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonDirectAcquisitionScreen_C_GenerateOfferWidget, CallFunc_AddChildToGrid_ReturnValue) == 0x000210, "Member 'AthenaSeasonDirectAcquisitionScreen_C_GenerateOfferWidget::CallFunc_AddChildToGrid_ReturnValue' has a wrong offset!");
static_assert(offsetof(AthenaSeasonDirectAcquisitionScreen_C_GenerateOfferWidget, CallFunc_AddChildToHorizontalBox_ReturnValue) == 0x000218, "Member 'AthenaSeasonDirectAcquisitionScreen_C_GenerateOfferWidget::CallFunc_AddChildToHorizontalBox_ReturnValue' has a wrong offset!");

// Function AthenaSeasonDirectAcquisitionScreen.AthenaSeasonDirectAcquisitionScreen_C.Focus
// 0x0008 (0x0008 - 0x0000)
struct AthenaSeasonDirectAcquisitionScreen_C_Focus final
{
public:
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AthenaSeasonDirectAcquisitionScreen_C_Focus) == 0x000008, "Wrong alignment on AthenaSeasonDirectAcquisitionScreen_C_Focus");
static_assert(sizeof(AthenaSeasonDirectAcquisitionScreen_C_Focus) == 0x000008, "Wrong size on AthenaSeasonDirectAcquisitionScreen_C_Focus");
static_assert(offsetof(AthenaSeasonDirectAcquisitionScreen_C_Focus, CallFunc_GetUINavigationManager_ReturnValue) == 0x000000, "Member 'AthenaSeasonDirectAcquisitionScreen_C_Focus::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");

}

