#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AthenaDirectAcquisitionOfferDetailsWidget

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass AthenaDirectAcquisitionOfferDetailsWidget.AthenaDirectAcquisitionOfferDetailsWidget_C
// 0x00A8 (0x04B8 - 0x0410)
class UAthenaDirectAcquisitionOfferDetailsWidget_C final : public UFortDirectAcquisitionOfferDetailsWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0410(0x0008)(Transient, DuplicateTransient)
	class UCommonBorder*                          BorderDarkRarity;                                  // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          BorderRarityColored;                               // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Check;                                             // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Currency1ItemImage2;                               // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Currency1VB;                                       // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMultiSizeItemCard*                 ItemCard;                                          // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NotUmbrellaIcon;                                   // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               OverlaySalePrice1;                                 // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        OwnedSwitcher;                                     // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UIconTextButton_C*                      PurchaseButton1;                                   // 0x0460(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBoxDetails;                                  // 0x0468(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ShortDescription;                                  // 0x0470(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStoreMain_OfferDetailsAttribute_C*     StoreMain_OfferDetailsAttribute;                   // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UStoreMain_OfferDetailsAttribute_C*     StoreMain_OfferDetailsAttribute_C_0;               // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextDescription;                                   // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextName;                                          // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextOfferDisplayPrice1;                            // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       TextOriginalPrice1;                                // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           VBoxOfferInfo;                                     // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          CanPurchase;                                       // 0x04B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsPurchasing;                                      // 0x04B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_AthenaDirectAcquisitionOfferDetailsWidget(int32 EntryPoint);
	void Construct();
	void BndEvt__PurchaseButton_K2Node_ComponentBoundEvent_2_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void OnActivated();
	void OnOfferSet();
	void UpdateFromOffer();
	void HandleBack(bool* PassThrough);
	void PopDetails();
	void SetupPrice(const int32 PriceIndex, class UIconTextButton_C* PurchaseButton, class UWidget* PriceContainer, class UTextBlock* NormalPriceText, class UWidget* SalePriceContainer, class UTextBlock* SalePriceText, class UImage* CurrencyImage);
	void HandlePurchaseOfferComplete(bool Success);
	void AttemptPurchase(const int32 PriceIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AthenaDirectAcquisitionOfferDetailsWidget_C">();
	}
	static class UAthenaDirectAcquisitionOfferDetailsWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAthenaDirectAcquisitionOfferDetailsWidget_C>();
	}
};
static_assert(alignof(UAthenaDirectAcquisitionOfferDetailsWidget_C) == 0x000008, "Wrong alignment on UAthenaDirectAcquisitionOfferDetailsWidget_C");
static_assert(sizeof(UAthenaDirectAcquisitionOfferDetailsWidget_C) == 0x0004B8, "Wrong size on UAthenaDirectAcquisitionOfferDetailsWidget_C");
static_assert(offsetof(UAthenaDirectAcquisitionOfferDetailsWidget_C, UberGraphFrame) == 0x000410, "Member 'UAthenaDirectAcquisitionOfferDetailsWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferDetailsWidget_C, BorderDarkRarity) == 0x000418, "Member 'UAthenaDirectAcquisitionOfferDetailsWidget_C::BorderDarkRarity' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferDetailsWidget_C, BorderRarityColored) == 0x000420, "Member 'UAthenaDirectAcquisitionOfferDetailsWidget_C::BorderRarityColored' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferDetailsWidget_C, Check) == 0x000428, "Member 'UAthenaDirectAcquisitionOfferDetailsWidget_C::Check' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferDetailsWidget_C, Currency1ItemImage2) == 0x000430, "Member 'UAthenaDirectAcquisitionOfferDetailsWidget_C::Currency1ItemImage2' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferDetailsWidget_C, Currency1VB) == 0x000438, "Member 'UAthenaDirectAcquisitionOfferDetailsWidget_C::Currency1VB' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferDetailsWidget_C, ItemCard) == 0x000440, "Member 'UAthenaDirectAcquisitionOfferDetailsWidget_C::ItemCard' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferDetailsWidget_C, NotUmbrellaIcon) == 0x000448, "Member 'UAthenaDirectAcquisitionOfferDetailsWidget_C::NotUmbrellaIcon' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferDetailsWidget_C, OverlaySalePrice1) == 0x000450, "Member 'UAthenaDirectAcquisitionOfferDetailsWidget_C::OverlaySalePrice1' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferDetailsWidget_C, OwnedSwitcher) == 0x000458, "Member 'UAthenaDirectAcquisitionOfferDetailsWidget_C::OwnedSwitcher' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferDetailsWidget_C, PurchaseButton1) == 0x000460, "Member 'UAthenaDirectAcquisitionOfferDetailsWidget_C::PurchaseButton1' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferDetailsWidget_C, ScrollBoxDetails) == 0x000468, "Member 'UAthenaDirectAcquisitionOfferDetailsWidget_C::ScrollBoxDetails' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferDetailsWidget_C, ShortDescription) == 0x000470, "Member 'UAthenaDirectAcquisitionOfferDetailsWidget_C::ShortDescription' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferDetailsWidget_C, StoreMain_OfferDetailsAttribute) == 0x000478, "Member 'UAthenaDirectAcquisitionOfferDetailsWidget_C::StoreMain_OfferDetailsAttribute' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferDetailsWidget_C, StoreMain_OfferDetailsAttribute_C_0) == 0x000480, "Member 'UAthenaDirectAcquisitionOfferDetailsWidget_C::StoreMain_OfferDetailsAttribute_C_0' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferDetailsWidget_C, TextDescription) == 0x000488, "Member 'UAthenaDirectAcquisitionOfferDetailsWidget_C::TextDescription' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferDetailsWidget_C, TextName) == 0x000490, "Member 'UAthenaDirectAcquisitionOfferDetailsWidget_C::TextName' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferDetailsWidget_C, TextOfferDisplayPrice1) == 0x000498, "Member 'UAthenaDirectAcquisitionOfferDetailsWidget_C::TextOfferDisplayPrice1' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferDetailsWidget_C, TextOriginalPrice1) == 0x0004A0, "Member 'UAthenaDirectAcquisitionOfferDetailsWidget_C::TextOriginalPrice1' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferDetailsWidget_C, VBoxOfferInfo) == 0x0004A8, "Member 'UAthenaDirectAcquisitionOfferDetailsWidget_C::VBoxOfferInfo' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferDetailsWidget_C, CanPurchase) == 0x0004B0, "Member 'UAthenaDirectAcquisitionOfferDetailsWidget_C::CanPurchase' has a wrong offset!");
static_assert(offsetof(UAthenaDirectAcquisitionOfferDetailsWidget_C, IsPurchasing) == 0x0004B1, "Member 'UAthenaDirectAcquisitionOfferDetailsWidget_C::IsPurchasing' has a wrong offset!");

}

