#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: B_Melee_Generic

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function B_Melee_Generic.B_Melee_Generic_C.ExecuteUbergraph_B_Melee_Generic
// 0x0EC0 (0x0EC0 - 0x0000)
struct B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetPI_ReturnValue;                        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bPersistentFire;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bSecondaryFire;                       // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_Event_HitResult;                            // 0x0030(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	EPhysicalSurface                              K2Node_Event_ImpactPhysicalSurface;                // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               K2Node_Event_SpawnedPSC;                           // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue3;         // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x00CB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue4;         // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue5;         // 0x00CE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue3;                   // 0x00CF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D2[0x2];                                       // 0x00D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x00D8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x00E4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x00F0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x00FC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0130(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x013C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0148(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue;            // 0x0154(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue;                // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetSmallPreviewImage_ReturnValue;         // 0x0170(0x0020)(HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn;                    // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_AssetToObject_ReturnValue;           // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess2;                      // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue2;        // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue2;               // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn;             // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess3;                      // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E1[0x7];                                      // 0x01E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_GetInstigator_ReturnValue3;               // 0x01E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        K2Node_DynamicCast_AsFort_Player_Pawn2;            // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess4;                      // 0x01F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue3;        // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue2;           // 0x0208(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetSocketRotation_ReturnValue;            // 0x0214(0x000C)(IsPlainOldData, NoDestructor)
	class UObject*                                Temp_object_Variable;                              // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue;         // 0x0228(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        K2Node_DynamicCast_AsParticle_System;              // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess5;                      // 0x0240(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0248(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetInstigator_ReturnValue4;               // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPawn*                              K2Node_DynamicCast_AsFort_Pawn2;                   // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess6;                      // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFortCosmeticModification              K2Node_Event_CosmeticMod;                          // 0x0268(0x08F8)()
	class UMaterialInstanceDynamic*               K2Node_Event_DynamicMaterialInstance;              // 0x0B60(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0B68(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_GetCurrentActiveMontage_ReturnValue;      // 0x0B70(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0B78(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAssetNull_ReturnValue;                  // 0x0B79(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B7A[0x2];                                      // 0x0B7A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetSocketRotation_ReturnValue2;           // 0x0B7C(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue3;           // 0x0B88(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_RotatorToVector_ReturnValue2;        // 0x0B94(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0BA0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0BAC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0BB8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0BBC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0BC0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue2;       // 0x0BC4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0BD0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0BDC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue2;                      // 0x0BE0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue3;       // 0x0BEC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0BF8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue3;                      // 0x0C04(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0C10(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue;           // 0x0C1C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue4;       // 0x0C28(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Cross_VectorVector_ReturnValue2;          // 0x0C34(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromXY_ReturnValue;                // 0x0C40(0x000C)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_C4C[0x4];                                      // 0x0C4C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult; // 0x0C50(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_CD8[0x8];                                      // 0x0CD8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue;           // 0x0CE0(0x0030)(IsPlainOldData, NoDestructor)
	struct FTransform                             CallFunc_GetSocketTransform_ReturnValue2;          // 0x0D10(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0D40(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0D4C(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0D58(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location2;                 // 0x0D64(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation2;                 // 0x0D70(0x000C)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale2;                    // 0x0D7C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X2;                           // 0x0D88(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y2;                           // 0x0D8C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z2;                           // 0x0D90(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X3;                           // 0x0D94(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y3;                           // 0x0D98(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z3;                           // 0x0D9C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0DA0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue4;           // 0x0DA4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0DB0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetSocketLocation_ReturnValue5;           // 0x0DB4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue2;         // 0x0DC0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue5;       // 0x0DC4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue4;        // 0x0DD0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Conv_VectorToRotator_ReturnValue;         // 0x0DD8(0x000C)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_DE4[0x4];                                      // 0x0DE4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0DE8(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_VSize_ReturnValue2;                       // 0x0E70(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSocketExist_ReturnValue;              // 0x0E74(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E75[0x3];                                      // 0x0E75(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue3;         // 0x0E78(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue2;           // 0x0E7C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue3;           // 0x0E80(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue2;                  // 0x0E84(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue4;           // 0x0E90(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue5;           // 0x0E94(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue3;                  // 0x0E98(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue4;                  // 0x0EA4(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_DoesSocketExist_ReturnValue2;             // 0x0EB0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0EB1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic) == 0x000010, "Wrong alignment on B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic");
static_assert(sizeof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic) == 0x000EC0, "Wrong size on B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, EntryPoint) == 0x000000, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::EntryPoint' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_MultiplyMultiply_FloatFloat_ReturnValue) == 0x000018, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_MultiplyMultiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_GetPI_ReturnValue) == 0x00001C, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_GetPI_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_IsDedicatedServer_ReturnValue) == 0x000020, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000024, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, K2Node_Event_bPersistentFire) == 0x000028, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::K2Node_Event_bPersistentFire' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, K2Node_Event_bSecondaryFire) == 0x000029, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::K2Node_Event_bSecondaryFire' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, K2Node_Event_HitResult) == 0x000030, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::K2Node_Event_HitResult' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, K2Node_Event_ImpactPhysicalSurface) == 0x0000B8, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::K2Node_Event_ImpactPhysicalSurface' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, K2Node_Event_SpawnedPSC) == 0x0000C0, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::K2Node_Event_SpawnedPSC' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000C8, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x0000C9, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_EqualEqual_ByteByte_ReturnValue3) == 0x0000CA, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_EqualEqual_ByteByte_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BooleanOR_ReturnValue) == 0x0000CB, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_EqualEqual_ByteByte_ReturnValue4) == 0x0000CC, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_EqualEqual_ByteByte_ReturnValue4' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BooleanOR_ReturnValue2) == 0x0000CD, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BooleanOR_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_EqualEqual_ByteByte_ReturnValue5) == 0x0000CE, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_EqualEqual_ByteByte_ReturnValue5' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BooleanOR_ReturnValue3) == 0x0000CF, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BooleanOR_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BreakHitResult_bBlockingHit) == 0x0000D0, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BreakHitResult_bInitialOverlap) == 0x0000D1, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BreakHitResult_Time) == 0x0000D4, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BreakHitResult_Location) == 0x0000D8, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BreakHitResult_ImpactPoint) == 0x0000E4, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BreakHitResult_Normal) == 0x0000F0, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BreakHitResult_ImpactNormal) == 0x0000FC, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BreakHitResult_PhysMat) == 0x000108, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BreakHitResult_HitActor) == 0x000110, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BreakHitResult_HitComponent) == 0x000118, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BreakHitResult_HitBoneName) == 0x000120, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BreakHitResult_HitItem) == 0x000128, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BreakHitResult_FaceIndex) == 0x00012C, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BreakHitResult_TraceStart) == 0x000130, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BreakHitResult_TraceEnd) == 0x00013C, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000148, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_GetSocketLocation_ReturnValue) == 0x000154, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_GetSocketLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000160, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_GetInstigator_ReturnValue) == 0x000168, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_GetInstigator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_GetSmallPreviewImage_ReturnValue) == 0x000170, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_GetSmallPreviewImage_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, K2Node_DynamicCast_AsFort_Pawn) == 0x000190, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::K2Node_DynamicCast_AsFort_Pawn' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, K2Node_DynamicCast_bSuccess) == 0x000198, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_Conv_AssetToObject_ReturnValue) == 0x0001A0, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_Conv_AssetToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, K2Node_DynamicCast_AsTexture_2D) == 0x0001A8, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, K2Node_DynamicCast_bSuccess2) == 0x0001B0, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::K2Node_DynamicCast_bSuccess2' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x0001B8, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_SpawnEmitterAttached_ReturnValue2) == 0x0001C0, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_SpawnEmitterAttached_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0001C8, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_GetInstigator_ReturnValue2) == 0x0001D0, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_GetInstigator_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, K2Node_DynamicCast_AsFort_Player_Pawn) == 0x0001D8, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::K2Node_DynamicCast_AsFort_Player_Pawn' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, K2Node_DynamicCast_bSuccess3) == 0x0001E0, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::K2Node_DynamicCast_bSuccess3' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_GetInstigator_ReturnValue3) == 0x0001E8, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_GetInstigator_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, K2Node_DynamicCast_AsFort_Player_Pawn2) == 0x0001F0, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::K2Node_DynamicCast_AsFort_Player_Pawn2' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, K2Node_DynamicCast_bSuccess4) == 0x0001F8, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::K2Node_DynamicCast_bSuccess4' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_SpawnEmitterAttached_ReturnValue3) == 0x000200, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_SpawnEmitterAttached_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_GetSocketLocation_ReturnValue2) == 0x000208, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_GetSocketLocation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_GetSocketRotation_ReturnValue) == 0x000214, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_GetSocketRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, Temp_object_Variable) == 0x000220, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_Conv_RotatorToVector_ReturnValue) == 0x000228, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_Conv_RotatorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, K2Node_DynamicCast_AsParticle_System) == 0x000238, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::K2Node_DynamicCast_AsParticle_System' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, K2Node_DynamicCast_bSuccess5) == 0x000240, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::K2Node_DynamicCast_bSuccess5' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, K2Node_CustomEvent_Loaded) == 0x000248, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_GetInstigator_ReturnValue4) == 0x000250, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_GetInstigator_ReturnValue4' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, K2Node_DynamicCast_AsFort_Pawn2) == 0x000258, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::K2Node_DynamicCast_AsFort_Pawn2' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, K2Node_DynamicCast_bSuccess6) == 0x000260, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::K2Node_DynamicCast_bSuccess6' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, K2Node_Event_CosmeticMod) == 0x000268, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::K2Node_Event_CosmeticMod' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, K2Node_Event_DynamicMaterialInstance) == 0x000B60, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::K2Node_Event_DynamicMaterialInstance' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_GetAnimInstance_ReturnValue) == 0x000B68, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_GetCurrentActiveMontage_ReturnValue) == 0x000B70, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_GetCurrentActiveMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_Array_Contains_ReturnValue) == 0x000B78, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_IsAssetNull_ReturnValue) == 0x000B79, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_IsAssetNull_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_GetSocketRotation_ReturnValue2) == 0x000B7C, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_GetSocketRotation_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_GetSocketLocation_ReturnValue3) == 0x000B88, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_GetSocketLocation_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_Conv_RotatorToVector_ReturnValue2) == 0x000B94, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_Conv_RotatorToVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000BA0, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_Normal_ReturnValue) == 0x000BAC, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BreakVector_X) == 0x000BB8, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BreakVector_Y) == 0x000BBC, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BreakVector_Z) == 0x000BC0, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_Subtract_VectorVector_ReturnValue2) == 0x000BC4, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_Subtract_VectorVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_MakeVector_ReturnValue) == 0x000BD0, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_VSize_ReturnValue) == 0x000BDC, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_Normal_ReturnValue2) == 0x000BE0, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_Normal_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_Subtract_VectorVector_ReturnValue3) == 0x000BEC, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_Subtract_VectorVector_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000BF8, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_Normal_ReturnValue3) == 0x000C04, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_Normal_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_Add_VectorVector_ReturnValue) == 0x000C10, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_Cross_VectorVector_ReturnValue) == 0x000C1C, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_Cross_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_Subtract_VectorVector_ReturnValue4) == 0x000C28, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_Subtract_VectorVector_ReturnValue4' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_Cross_VectorVector_ReturnValue2) == 0x000C34, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_Cross_VectorVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_MakeRotFromXY_ReturnValue) == 0x000C40, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_MakeRotFromXY_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult) == 0x000C50, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_GetSocketTransform_ReturnValue) == 0x000CE0, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_GetSocketTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_GetSocketTransform_ReturnValue2) == 0x000D10, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_GetSocketTransform_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BreakTransform_Location) == 0x000D40, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BreakTransform_Rotation) == 0x000D4C, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BreakTransform_Scale) == 0x000D58, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BreakTransform_Location2) == 0x000D64, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BreakTransform_Location2' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BreakTransform_Rotation2) == 0x000D70, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BreakTransform_Rotation2' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BreakTransform_Scale2) == 0x000D7C, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BreakTransform_Scale2' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BreakVector_X2) == 0x000D88, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BreakVector_X2' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BreakVector_Y2) == 0x000D8C, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BreakVector_Y2' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BreakVector_Z2) == 0x000D90, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BreakVector_Z2' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BreakVector_X3) == 0x000D94, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BreakVector_X3' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BreakVector_Y3) == 0x000D98, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BreakVector_Y3' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BreakVector_Z3) == 0x000D9C, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BreakVector_Z3' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_Add_FloatFloat_ReturnValue) == 0x000DA0, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_GetSocketLocation_ReturnValue4) == 0x000DA4, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_GetSocketLocation_ReturnValue4' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000DB0, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_GetSocketLocation_ReturnValue5) == 0x000DB4, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_GetSocketLocation_ReturnValue5' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_Multiply_FloatFloat_ReturnValue2) == 0x000DC0, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_Multiply_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_Subtract_VectorVector_ReturnValue5) == 0x000DC4, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_Subtract_VectorVector_ReturnValue5' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_SpawnEmitterAttached_ReturnValue4) == 0x000DD0, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_SpawnEmitterAttached_ReturnValue4' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_Conv_VectorToRotator_ReturnValue) == 0x000DD8, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_Conv_VectorToRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_K2_SetWorldRotation_SweepHitResult) == 0x000DE8, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_K2_SetWorldRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_VSize_ReturnValue2) == 0x000E70, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_VSize_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_DoesSocketExist_ReturnValue) == 0x000E74, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_DoesSocketExist_ReturnValue' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_Multiply_FloatFloat_ReturnValue3) == 0x000E78, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_Multiply_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_Divide_FloatFloat_ReturnValue2) == 0x000E7C, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_Divide_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_Divide_FloatFloat_ReturnValue3) == 0x000E80, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_Divide_FloatFloat_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_MakeVector_ReturnValue2) == 0x000E84, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_MakeVector_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_Divide_FloatFloat_ReturnValue4) == 0x000E90, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_Divide_FloatFloat_ReturnValue4' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_Divide_FloatFloat_ReturnValue5) == 0x000E94, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_Divide_FloatFloat_ReturnValue5' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_MakeVector_ReturnValue3) == 0x000E98, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_MakeVector_ReturnValue3' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_MakeVector_ReturnValue4) == 0x000EA4, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_MakeVector_ReturnValue4' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_DoesSocketExist_ReturnValue2) == 0x000EB0, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_DoesSocketExist_ReturnValue2' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic, CallFunc_BooleanAND_ReturnValue) == 0x000EB1, "Member 'B_Melee_Generic_C_ExecuteUbergraph_B_Melee_Generic::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function B_Melee_Generic.B_Melee_Generic_C.OnInitCosmeticAlterations
// 0x0900 (0x0900 - 0x0000)
struct B_Melee_Generic_C_OnInitCosmeticAlterations final
{
public:
	struct FFortCosmeticModification              CosmeticMod;                                       // 0x0000(0x08F8)(Parm)
	class UMaterialInstanceDynamic*               DynamicMaterialInstance;                           // 0x08F8(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Melee_Generic_C_OnInitCosmeticAlterations) == 0x000008, "Wrong alignment on B_Melee_Generic_C_OnInitCosmeticAlterations");
static_assert(sizeof(B_Melee_Generic_C_OnInitCosmeticAlterations) == 0x000900, "Wrong size on B_Melee_Generic_C_OnInitCosmeticAlterations");
static_assert(offsetof(B_Melee_Generic_C_OnInitCosmeticAlterations, CosmeticMod) == 0x000000, "Member 'B_Melee_Generic_C_OnInitCosmeticAlterations::CosmeticMod' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_OnInitCosmeticAlterations, DynamicMaterialInstance) == 0x0008F8, "Member 'B_Melee_Generic_C_OnInitCosmeticAlterations::DynamicMaterialInstance' has a wrong offset!");

// Function B_Melee_Generic.B_Melee_Generic_C.OnPlayImpactFX
// 0x0098 (0x0098 - 0x0000)
struct B_Melee_Generic_C_OnPlayImpactFX final
{
public:
	struct FHitResult                             HitResult;                                         // 0x0000(0x0088)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	EPhysicalSurface                              ImpactPhysicalSurface;                             // 0x0088(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               SpawnedPSC;                                        // 0x0090(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(B_Melee_Generic_C_OnPlayImpactFX) == 0x000008, "Wrong alignment on B_Melee_Generic_C_OnPlayImpactFX");
static_assert(sizeof(B_Melee_Generic_C_OnPlayImpactFX) == 0x000098, "Wrong size on B_Melee_Generic_C_OnPlayImpactFX");
static_assert(offsetof(B_Melee_Generic_C_OnPlayImpactFX, HitResult) == 0x000000, "Member 'B_Melee_Generic_C_OnPlayImpactFX::HitResult' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_OnPlayImpactFX, ImpactPhysicalSurface) == 0x000088, "Member 'B_Melee_Generic_C_OnPlayImpactFX::ImpactPhysicalSurface' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_OnPlayImpactFX, SpawnedPSC) == 0x000090, "Member 'B_Melee_Generic_C_OnPlayImpactFX::SpawnedPSC' has a wrong offset!");

// Function B_Melee_Generic.B_Melee_Generic_C.OnPlayWeaponFireFX
// 0x0002 (0x0002 - 0x0000)
struct B_Melee_Generic_C_OnPlayWeaponFireFX final
{
public:
	bool                                          bPersistentFire;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bSecondaryFire;                                    // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(B_Melee_Generic_C_OnPlayWeaponFireFX) == 0x000001, "Wrong alignment on B_Melee_Generic_C_OnPlayWeaponFireFX");
static_assert(sizeof(B_Melee_Generic_C_OnPlayWeaponFireFX) == 0x000002, "Wrong size on B_Melee_Generic_C_OnPlayWeaponFireFX");
static_assert(offsetof(B_Melee_Generic_C_OnPlayWeaponFireFX, bPersistentFire) == 0x000000, "Member 'B_Melee_Generic_C_OnPlayWeaponFireFX::bPersistentFire' has a wrong offset!");
static_assert(offsetof(B_Melee_Generic_C_OnPlayWeaponFireFX, bSecondaryFire) == 0x000001, "Member 'B_Melee_Generic_C_OnPlayWeaponFireFX::bSecondaryFire' has a wrong offset!");

// Function B_Melee_Generic.B_Melee_Generic_C.OnLoaded_CB594210420542B302428F8181D85E48
