#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TRV_CAS_Alight_Lighting_Official

#include "Basic.hpp"

#include "Transylvania_LightMaster_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TRV_CAS_Alight_Lighting_Official.BP_TRV_CAS_Alight_Lighting_Official_C
// 0x00A0 (0x1180 - 0x10E0)
class ABP_TRV_CAS_Alight_Lighting_Official_C final : public ATransylvania_LightMaster_C
{
public:
	class UStaticMeshComponent*                   Bloom10;                                           // 0x10E0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Bloom9;                                            // 0x10E8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Bloom8;                                            // 0x10F0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Bloom7;                                            // 0x10F8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Bloom6;                                            // 0x1100(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Bloom5;                                            // 0x1108(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Bloom4;                                            // 0x1110(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Bloom3;                                            // 0x1118(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Bloom2;                                            // 0x1120(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Bloom1;                                            // 0x1128(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Flame10;                                           // 0x1130(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Flame9;                                            // 0x1138(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Flame8;                                            // 0x1140(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Flame7;                                            // 0x1148(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Flame6;                                            // 0x1150(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Flame5;                                            // 0x1158(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Flame4;                                            // 0x1160(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Flame3;                                            // 0x1168(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Flame2;                                            // 0x1170(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Flame1;                                            // 0x1178(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TRV_CAS_Alight_Lighting_Official_C">();
	}
	static class ABP_TRV_CAS_Alight_Lighting_Official_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_TRV_CAS_Alight_Lighting_Official_C>();
	}
};
static_assert(alignof(ABP_TRV_CAS_Alight_Lighting_Official_C) == 0x000010, "Wrong alignment on ABP_TRV_CAS_Alight_Lighting_Official_C");
static_assert(sizeof(ABP_TRV_CAS_Alight_Lighting_Official_C) == 0x001180, "Wrong size on ABP_TRV_CAS_Alight_Lighting_Official_C");
static_assert(offsetof(ABP_TRV_CAS_Alight_Lighting_Official_C, Bloom10) == 0x0010E0, "Member 'ABP_TRV_CAS_Alight_Lighting_Official_C::Bloom10' has a wrong offset!");
static_assert(offsetof(ABP_TRV_CAS_Alight_Lighting_Official_C, Bloom9) == 0x0010E8, "Member 'ABP_TRV_CAS_Alight_Lighting_Official_C::Bloom9' has a wrong offset!");
static_assert(offsetof(ABP_TRV_CAS_Alight_Lighting_Official_C, Bloom8) == 0x0010F0, "Member 'ABP_TRV_CAS_Alight_Lighting_Official_C::Bloom8' has a wrong offset!");
static_assert(offsetof(ABP_TRV_CAS_Alight_Lighting_Official_C, Bloom7) == 0x0010F8, "Member 'ABP_TRV_CAS_Alight_Lighting_Official_C::Bloom7' has a wrong offset!");
static_assert(offsetof(ABP_TRV_CAS_Alight_Lighting_Official_C, Bloom6) == 0x001100, "Member 'ABP_TRV_CAS_Alight_Lighting_Official_C::Bloom6' has a wrong offset!");
static_assert(offsetof(ABP_TRV_CAS_Alight_Lighting_Official_C, Bloom5) == 0x001108, "Member 'ABP_TRV_CAS_Alight_Lighting_Official_C::Bloom5' has a wrong offset!");
static_assert(offsetof(ABP_TRV_CAS_Alight_Lighting_Official_C, Bloom4) == 0x001110, "Member 'ABP_TRV_CAS_Alight_Lighting_Official_C::Bloom4' has a wrong offset!");
static_assert(offsetof(ABP_TRV_CAS_Alight_Lighting_Official_C, Bloom3) == 0x001118, "Member 'ABP_TRV_CAS_Alight_Lighting_Official_C::Bloom3' has a wrong offset!");
static_assert(offsetof(ABP_TRV_CAS_Alight_Lighting_Official_C, Bloom2) == 0x001120, "Member 'ABP_TRV_CAS_Alight_Lighting_Official_C::Bloom2' has a wrong offset!");
static_assert(offsetof(ABP_TRV_CAS_Alight_Lighting_Official_C, Bloom1) == 0x001128, "Member 'ABP_TRV_CAS_Alight_Lighting_Official_C::Bloom1' has a wrong offset!");
static_assert(offsetof(ABP_TRV_CAS_Alight_Lighting_Official_C, Flame10) == 0x001130, "Member 'ABP_TRV_CAS_Alight_Lighting_Official_C::Flame10' has a wrong offset!");
static_assert(offsetof(ABP_TRV_CAS_Alight_Lighting_Official_C, Flame9) == 0x001138, "Member 'ABP_TRV_CAS_Alight_Lighting_Official_C::Flame9' has a wrong offset!");
static_assert(offsetof(ABP_TRV_CAS_Alight_Lighting_Official_C, Flame8) == 0x001140, "Member 'ABP_TRV_CAS_Alight_Lighting_Official_C::Flame8' has a wrong offset!");
static_assert(offsetof(ABP_TRV_CAS_Alight_Lighting_Official_C, Flame7) == 0x001148, "Member 'ABP_TRV_CAS_Alight_Lighting_Official_C::Flame7' has a wrong offset!");
static_assert(offsetof(ABP_TRV_CAS_Alight_Lighting_Official_C, Flame6) == 0x001150, "Member 'ABP_TRV_CAS_Alight_Lighting_Official_C::Flame6' has a wrong offset!");
static_assert(offsetof(ABP_TRV_CAS_Alight_Lighting_Official_C, Flame5) == 0x001158, "Member 'ABP_TRV_CAS_Alight_Lighting_Official_C::Flame5' has a wrong offset!");
static_assert(offsetof(ABP_TRV_CAS_Alight_Lighting_Official_C, Flame4) == 0x001160, "Member 'ABP_TRV_CAS_Alight_Lighting_Official_C::Flame4' has a wrong offset!");
static_assert(offsetof(ABP_TRV_CAS_Alight_Lighting_Official_C, Flame3) == 0x001168, "Member 'ABP_TRV_CAS_Alight_Lighting_Official_C::Flame3' has a wrong offset!");
static_assert(offsetof(ABP_TRV_CAS_Alight_Lighting_Official_C, Flame2) == 0x001170, "Member 'ABP_TRV_CAS_Alight_Lighting_Official_C::Flame2' has a wrong offset!");
static_assert(offsetof(ABP_TRV_CAS_Alight_Lighting_Official_C, Flame1) == 0x001178, "Member 'ABP_TRV_CAS_Alight_Lighting_Official_C::Flame1' has a wrong offset!");

}

