#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DailyQuestObjectiveEntry

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function DailyQuestObjectiveEntry.DailyQuestObjectiveEntry_C.ExecuteUbergraph_DailyQuestObjectiveEntry
// 0x0020 (0x0020 - 0x0000)
struct DailyQuestObjectiveEntry_C_ExecuteUbergraph_DailyQuestObjectiveEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_InData;                         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestObjectiveInfo*                K2Node_DynamicCast_AsFort_Quest_Objective_Info;    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DailyQuestObjectiveEntry_C_ExecuteUbergraph_DailyQuestObjectiveEntry) == 0x000008, "Wrong alignment on DailyQuestObjectiveEntry_C_ExecuteUbergraph_DailyQuestObjectiveEntry");
static_assert(sizeof(DailyQuestObjectiveEntry_C_ExecuteUbergraph_DailyQuestObjectiveEntry) == 0x000020, "Wrong size on DailyQuestObjectiveEntry_C_ExecuteUbergraph_DailyQuestObjectiveEntry");
static_assert(offsetof(DailyQuestObjectiveEntry_C_ExecuteUbergraph_DailyQuestObjectiveEntry, EntryPoint) == 0x000000, "Member 'DailyQuestObjectiveEntry_C_ExecuteUbergraph_DailyQuestObjectiveEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(DailyQuestObjectiveEntry_C_ExecuteUbergraph_DailyQuestObjectiveEntry, K2Node_CustomEvent_InData) == 0x000008, "Member 'DailyQuestObjectiveEntry_C_ExecuteUbergraph_DailyQuestObjectiveEntry::K2Node_CustomEvent_InData' has a wrong offset!");
static_assert(offsetof(DailyQuestObjectiveEntry_C_ExecuteUbergraph_DailyQuestObjectiveEntry, K2Node_DynamicCast_AsFort_Quest_Objective_Info) == 0x000010, "Member 'DailyQuestObjectiveEntry_C_ExecuteUbergraph_DailyQuestObjectiveEntry::K2Node_DynamicCast_AsFort_Quest_Objective_Info' has a wrong offset!");
static_assert(offsetof(DailyQuestObjectiveEntry_C_ExecuteUbergraph_DailyQuestObjectiveEntry, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'DailyQuestObjectiveEntry_C_ExecuteUbergraph_DailyQuestObjectiveEntry::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function DailyQuestObjectiveEntry.DailyQuestObjectiveEntry_C.SetData
// 0x0008 (0x0008 - 0x0000)
struct DailyQuestObjectiveEntry_C_SetData final
{
public:
	class UObject*                                InData;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DailyQuestObjectiveEntry_C_SetData) == 0x000008, "Wrong alignment on DailyQuestObjectiveEntry_C_SetData");
static_assert(sizeof(DailyQuestObjectiveEntry_C_SetData) == 0x000008, "Wrong size on DailyQuestObjectiveEntry_C_SetData");
static_assert(offsetof(DailyQuestObjectiveEntry_C_SetData, InData) == 0x000000, "Member 'DailyQuestObjectiveEntry_C_SetData::InData' has a wrong offset!");

// Function DailyQuestObjectiveEntry.DailyQuestObjectiveEntry_C.UpdateProgress
// 0x0010 (0x0010 - 0x0000)
struct DailyQuestObjectiveEntry_C_UpdateProgress final
{
public:
	class UFortQuestObjectiveInfo*                Objective;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AchievedCount;                                     // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(DailyQuestObjectiveEntry_C_UpdateProgress) == 0x000008, "Wrong alignment on DailyQuestObjectiveEntry_C_UpdateProgress");
static_assert(sizeof(DailyQuestObjectiveEntry_C_UpdateProgress) == 0x000010, "Wrong size on DailyQuestObjectiveEntry_C_UpdateProgress");
static_assert(offsetof(DailyQuestObjectiveEntry_C_UpdateProgress, Objective) == 0x000000, "Member 'DailyQuestObjectiveEntry_C_UpdateProgress::Objective' has a wrong offset!");
static_assert(offsetof(DailyQuestObjectiveEntry_C_UpdateProgress, AchievedCount) == 0x000008, "Member 'DailyQuestObjectiveEntry_C_UpdateProgress::AchievedCount' has a wrong offset!");

// Function DailyQuestObjectiveEntry.DailyQuestObjectiveEntry_C.Update
// 0x0068 (0x0068 - 0x0000)
struct DailyQuestObjectiveEntry_C_Update final
{
public:
	class UFortQuestObjectiveInfo*                Objective;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AchievedCount;                                     // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetText_ReturnValue;                      // 0x0010(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortTooltipContext*                    CallFunc_SpawnTooltipContext_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortTooltipUIContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetCombinedDescription_OutDescription;    // 0x0048(0x0018)()
	bool                                          CallFunc_GetCombinedDescription_ReturnValue;       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DailyQuestObjectiveEntry_C_Update) == 0x000008, "Wrong alignment on DailyQuestObjectiveEntry_C_Update");
static_assert(sizeof(DailyQuestObjectiveEntry_C_Update) == 0x000068, "Wrong size on DailyQuestObjectiveEntry_C_Update");
static_assert(offsetof(DailyQuestObjectiveEntry_C_Update, Objective) == 0x000000, "Member 'DailyQuestObjectiveEntry_C_Update::Objective' has a wrong offset!");
static_assert(offsetof(DailyQuestObjectiveEntry_C_Update, AchievedCount) == 0x000008, "Member 'DailyQuestObjectiveEntry_C_Update::AchievedCount' has a wrong offset!");
static_assert(offsetof(DailyQuestObjectiveEntry_C_Update, CallFunc_GetText_ReturnValue) == 0x000010, "Member 'DailyQuestObjectiveEntry_C_Update::CallFunc_GetText_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyQuestObjectiveEntry_C_Update, CallFunc_TextIsEmpty_ReturnValue) == 0x000028, "Member 'DailyQuestObjectiveEntry_C_Update::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyQuestObjectiveEntry_C_Update, Temp_byte_Variable) == 0x000029, "Member 'DailyQuestObjectiveEntry_C_Update::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(DailyQuestObjectiveEntry_C_Update, CallFunc_SpawnTooltipContext_ReturnValue) == 0x000030, "Member 'DailyQuestObjectiveEntry_C_Update::CallFunc_SpawnTooltipContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyQuestObjectiveEntry_C_Update, Temp_byte_Variable2) == 0x000038, "Member 'DailyQuestObjectiveEntry_C_Update::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(DailyQuestObjectiveEntry_C_Update, Temp_bool_Variable) == 0x000039, "Member 'DailyQuestObjectiveEntry_C_Update::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(DailyQuestObjectiveEntry_C_Update, CallFunc_GetContext_ReturnValue) == 0x000040, "Member 'DailyQuestObjectiveEntry_C_Update::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyQuestObjectiveEntry_C_Update, CallFunc_GetCombinedDescription_OutDescription) == 0x000048, "Member 'DailyQuestObjectiveEntry_C_Update::CallFunc_GetCombinedDescription_OutDescription' has a wrong offset!");
static_assert(offsetof(DailyQuestObjectiveEntry_C_Update, CallFunc_GetCombinedDescription_ReturnValue) == 0x000060, "Member 'DailyQuestObjectiveEntry_C_Update::CallFunc_GetCombinedDescription_ReturnValue' has a wrong offset!");
static_assert(offsetof(DailyQuestObjectiveEntry_C_Update, K2Node_Select_Default) == 0x000061, "Member 'DailyQuestObjectiveEntry_C_Update::K2Node_Select_Default' has a wrong offset!");

}

