#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Ninja_MantisLeap

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function GA_Ninja_MantisLeap.GA_Ninja_MantisLeap_C.ExecuteUbergraph_GA_Ninja_MantisLeap
// 0x03B0 (0x03B0 - 0x0000)
struct GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData2;                    // 0x0008(0x0020)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag2;                // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       K2Node_CustomEvent_TargetData;                     // 0x0030(0x0020)(ConstParm)
	struct FGameplayTag                           K2Node_CustomEvent_ApplicationTag;                 // 0x0050(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate;              // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           Temp_struct_Variable;                              // 0x0068(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilityTargetDataHandle       Temp_struct_Variable2;                             // 0x0070(0x0020)()
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0090(0x00A8)(ConstParm)
	struct FGameplayEffectContextHandle           CallFunc_GetContextFromOwner_ReturnValue;          // 0x0138(0x0018)()
	struct FHitResult                             K2Node_CustomEvent_Hit;                            // 0x0150(0x0088)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x01D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DA[0x2];                                      // 0x01DA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x01E0(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x01EC(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x01F8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0204(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0238(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x0244(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(struct FHitResult& Hit)>       K2Node_CreateDelegate_OutputDelegate2;             // 0x0250(0x0010)(ZeroConstructor, NoDestructor)
	float                                         CallFunc_BreakVector_X;                            // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0264(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X2;                           // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y2;                           // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z2;                           // 0x0274(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector_NetQuantizeNormal              K2Node_MakeStruct_Vector_NetQuantizeNormal;        // 0x0278(0x000C)(NoDestructor)
	struct FVector_NetQuantize10                  K2Node_MakeStruct_Vector_NetQuantize10;            // 0x0284(0x000C)(NoDestructor)
	struct FGameplayCueParameters                 K2Node_MakeStruct_GameplayCueParameters;           // 0x0290(0x00B8)(ContainsInstancedReference)
	class UFortAbilityTask_WaitTargetSelection*   CallFunc_WaitTargetSelection_ReturnValue;          // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_ApplyGameplayEffectContainer_ReturnValue; // 0x0350(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_SetJumpHeight_Ninja_Pawn_Out;             // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_SetJumpHeight_Jump_Height;                // 0x0378(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RemoveActiveEffectsWithTags_ReturnValue;  // 0x0384(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_B_Execution_Happened_Variable;           // 0x0388(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_389[0x7];                                      // 0x0389(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FGameplayAbilityTargetDataHandle& TargetData, const struct FGameplayTag& ApplicationTag)> K2Node_CreateDelegate_OutputDelegate3;             // 0x0390(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          Temp_bool_A_Execution_Happened_Variable;           // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x03A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A2[0x6];                                      // 0x03A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue2;   // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap) == 0x000008, "Wrong alignment on GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap");
static_assert(sizeof(GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap) == 0x0003B0, "Wrong size on GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap");
static_assert(offsetof(GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap, EntryPoint) == 0x000000, "Member 'GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap, K2Node_CustomEvent_TargetData2) == 0x000008, "Member 'GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap::K2Node_CustomEvent_TargetData2' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap, K2Node_CustomEvent_ApplicationTag2) == 0x000028, "Member 'GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap::K2Node_CustomEvent_ApplicationTag2' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap, K2Node_CustomEvent_TargetData) == 0x000030, "Member 'GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap::K2Node_CustomEvent_TargetData' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap, K2Node_CustomEvent_ApplicationTag) == 0x000050, "Member 'GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap::K2Node_CustomEvent_ApplicationTag' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap, K2Node_CreateDelegate_OutputDelegate) == 0x000058, "Member 'GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap, Temp_struct_Variable) == 0x000068, "Member 'GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap, Temp_struct_Variable2) == 0x000070, "Member 'GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap::Temp_struct_Variable2' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap, K2Node_Event_EventData) == 0x000090, "Member 'GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap::K2Node_Event_EventData' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap, CallFunc_GetContextFromOwner_ReturnValue) == 0x000138, "Member 'GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap::CallFunc_GetContextFromOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap, K2Node_CustomEvent_Hit) == 0x000150, "Member 'GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap::K2Node_CustomEvent_Hit' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap, CallFunc_BreakHitResult_bBlockingHit) == 0x0001D8, "Member 'GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap, CallFunc_BreakHitResult_bInitialOverlap) == 0x0001D9, "Member 'GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap, CallFunc_BreakHitResult_Time) == 0x0001DC, "Member 'GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap, CallFunc_BreakHitResult_Location) == 0x0001E0, "Member 'GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap, CallFunc_BreakHitResult_ImpactPoint) == 0x0001EC, "Member 'GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap, CallFunc_BreakHitResult_Normal) == 0x0001F8, "Member 'GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap, CallFunc_BreakHitResult_ImpactNormal) == 0x000204, "Member 'GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap, CallFunc_BreakHitResult_PhysMat) == 0x000210, "Member 'GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap, CallFunc_BreakHitResult_HitActor) == 0x000218, "Member 'GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap, CallFunc_BreakHitResult_HitComponent) == 0x000220, "Member 'GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap, CallFunc_BreakHitResult_HitBoneName) == 0x000228, "Member 'GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap, CallFunc_BreakHitResult_HitItem) == 0x000230, "Member 'GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap, CallFunc_BreakHitResult_FaceIndex) == 0x000234, "Member 'GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap, CallFunc_BreakHitResult_TraceStart) == 0x000238, "Member 'GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap, CallFunc_BreakHitResult_TraceEnd) == 0x000244, "Member 'GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap, K2Node_CreateDelegate_OutputDelegate2) == 0x000250, "Member 'GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap, CallFunc_BreakVector_X) == 0x000260, "Member 'GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap, CallFunc_BreakVector_Y) == 0x000264, "Member 'GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap, CallFunc_BreakVector_Z) == 0x000268, "Member 'GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap, CallFunc_BreakVector_X2) == 0x00026C, "Member 'GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap::CallFunc_BreakVector_X2' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap, CallFunc_BreakVector_Y2) == 0x000270, "Member 'GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap::CallFunc_BreakVector_Y2' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap, CallFunc_BreakVector_Z2) == 0x000274, "Member 'GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap::CallFunc_BreakVector_Z2' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap, K2Node_MakeStruct_Vector_NetQuantizeNormal) == 0x000278, "Member 'GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap::K2Node_MakeStruct_Vector_NetQuantizeNormal' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap, K2Node_MakeStruct_Vector_NetQuantize10) == 0x000284, "Member 'GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap::K2Node_MakeStruct_Vector_NetQuantize10' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap, K2Node_MakeStruct_GameplayCueParameters) == 0x000290, "Member 'GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap::K2Node_MakeStruct_GameplayCueParameters' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap, CallFunc_WaitTargetSelection_ReturnValue) == 0x000348, "Member 'GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap::CallFunc_WaitTargetSelection_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap, CallFunc_ApplyGameplayEffectContainer_ReturnValue) == 0x000350, "Member 'GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap::CallFunc_ApplyGameplayEffectContainer_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap, CallFunc_IsValid_ReturnValue) == 0x000360, "Member 'GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap, CallFunc_GetAbilitySystemComponent_ReturnValue) == 0x000368, "Member 'GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap::CallFunc_GetAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap, CallFunc_SetJumpHeight_Ninja_Pawn_Out) == 0x000370, "Member 'GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap::CallFunc_SetJumpHeight_Ninja_Pawn_Out' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap, CallFunc_SetJumpHeight_Jump_Height) == 0x000378, "Member 'GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap::CallFunc_SetJumpHeight_Jump_Height' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap, CallFunc_RemoveActiveEffectsWithTags_ReturnValue) == 0x000384, "Member 'GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap::CallFunc_RemoveActiveEffectsWithTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap, Temp_bool_B_Execution_Happened_Variable) == 0x000388, "Member 'GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap::Temp_bool_B_Execution_Happened_Variable' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap, K2Node_CreateDelegate_OutputDelegate3) == 0x000390, "Member 'GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap, Temp_bool_A_Execution_Happened_Variable) == 0x0003A0, "Member 'GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap::Temp_bool_A_Execution_Happened_Variable' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap, CallFunc_BooleanAND_ReturnValue) == 0x0003A1, "Member 'GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap, CallFunc_GetAbilitySystemComponent_ReturnValue2) == 0x0003A8, "Member 'GA_Ninja_MantisLeap_C_ExecuteUbergraph_GA_Ninja_MantisLeap::CallFunc_GetAbilitySystemComponent_ReturnValue2' has a wrong offset!");

// Function GA_Ninja_MantisLeap.GA_Ninja_MantisLeap_C.OnPawnLanded
// 0x0088 (0x0088 - 0x0000)
struct GA_Ninja_MantisLeap_C_OnPawnLanded final
{
public:
	struct FHitResult                             Hit;                                               // 0x0000(0x0088)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(GA_Ninja_MantisLeap_C_OnPawnLanded) == 0x000008, "Wrong alignment on GA_Ninja_MantisLeap_C_OnPawnLanded");
static_assert(sizeof(GA_Ninja_MantisLeap_C_OnPawnLanded) == 0x000088, "Wrong size on GA_Ninja_MantisLeap_C_OnPawnLanded");
static_assert(offsetof(GA_Ninja_MantisLeap_C_OnPawnLanded, Hit) == 0x000000, "Member 'GA_Ninja_MantisLeap_C_OnPawnLanded::Hit' has a wrong offset!");

// Function GA_Ninja_MantisLeap.GA_Ninja_MantisLeap_C.K2_ActivateAbilityFromEvent
// 0x00A8 (0x00A8 - 0x0000)
struct GA_Ninja_MantisLeap_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00A8)(ConstParm, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(GA_Ninja_MantisLeap_C_K2_ActivateAbilityFromEvent) == 0x000008, "Wrong alignment on GA_Ninja_MantisLeap_C_K2_ActivateAbilityFromEvent");
static_assert(sizeof(GA_Ninja_MantisLeap_C_K2_ActivateAbilityFromEvent) == 0x0000A8, "Wrong size on GA_Ninja_MantisLeap_C_K2_ActivateAbilityFromEvent");
static_assert(offsetof(GA_Ninja_MantisLeap_C_K2_ActivateAbilityFromEvent, EventData) == 0x000000, "Member 'GA_Ninja_MantisLeap_C_K2_ActivateAbilityFromEvent::EventData' has a wrong offset!");

// Function GA_Ninja_MantisLeap.GA_Ninja_MantisLeap_C.Targeted_023C704A4687994EABB842B14222FB9B
// 0x0028 (0x0028 - 0x0000)
struct GA_Ninja_MantisLeap_C_Targeted_023C704A4687994EABB842B14222FB9B final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0020(0x0008)(Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Ninja_MantisLeap_C_Targeted_023C704A4687994EABB842B14222FB9B) == 0x000008, "Wrong alignment on GA_Ninja_MantisLeap_C_Targeted_023C704A4687994EABB842B14222FB9B");
static_assert(sizeof(GA_Ninja_MantisLeap_C_Targeted_023C704A4687994EABB842B14222FB9B) == 0x000028, "Wrong size on GA_Ninja_MantisLeap_C_Targeted_023C704A4687994EABB842B14222FB9B");
static_assert(offsetof(GA_Ninja_MantisLeap_C_Targeted_023C704A4687994EABB842B14222FB9B, TargetData) == 0x000000, "Member 'GA_Ninja_MantisLeap_C_Targeted_023C704A4687994EABB842B14222FB9B::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_Targeted_023C704A4687994EABB842B14222FB9B, ApplicationTag) == 0x000020, "Member 'GA_Ninja_MantisLeap_C_Targeted_023C704A4687994EABB842B14222FB9B::ApplicationTag' has a wrong offset!");

// Function GA_Ninja_MantisLeap.GA_Ninja_MantisLeap_C.Cancelled_023C704A4687994EABB842B14222FB9B
// 0x0028 (0x0028 - 0x0000)
struct GA_Ninja_MantisLeap_C_Cancelled_023C704A4687994EABB842B14222FB9B final
{
public:
	struct FGameplayAbilityTargetDataHandle       TargetData;                                        // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm)
	struct FGameplayTag                           ApplicationTag;                                    // 0x0020(0x0008)(Parm, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Ninja_MantisLeap_C_Cancelled_023C704A4687994EABB842B14222FB9B) == 0x000008, "Wrong alignment on GA_Ninja_MantisLeap_C_Cancelled_023C704A4687994EABB842B14222FB9B");
static_assert(sizeof(GA_Ninja_MantisLeap_C_Cancelled_023C704A4687994EABB842B14222FB9B) == 0x000028, "Wrong size on GA_Ninja_MantisLeap_C_Cancelled_023C704A4687994EABB842B14222FB9B");
static_assert(offsetof(GA_Ninja_MantisLeap_C_Cancelled_023C704A4687994EABB842B14222FB9B, TargetData) == 0x000000, "Member 'GA_Ninja_MantisLeap_C_Cancelled_023C704A4687994EABB842B14222FB9B::TargetData' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_Cancelled_023C704A4687994EABB842B14222FB9B, ApplicationTag) == 0x000020, "Member 'GA_Ninja_MantisLeap_C_Cancelled_023C704A4687994EABB842B14222FB9B::ApplicationTag' has a wrong offset!");

// Function GA_Ninja_MantisLeap.GA_Ninja_MantisLeap_C.K2_ShouldAbilityRespondToEvent
// 0x0108 (0x0108 - 0x0000)
struct GA_Ninja_MantisLeap_C_K2_ShouldAbilityRespondToEvent final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0040)(Parm, ContainsInstancedReference)
	struct FGameplayEventData                     Payload;                                           // 0x0040(0x00A8)(Parm)
	bool                                          ReturnValue;                                       // 0x00E8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAnyMatchingGameplayTags_self_CastInput; // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAnyMatchingGameplayTags_ReturnValue;   // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Ninja_MantisLeap_C_K2_ShouldAbilityRespondToEvent) == 0x000008, "Wrong alignment on GA_Ninja_MantisLeap_C_K2_ShouldAbilityRespondToEvent");
static_assert(sizeof(GA_Ninja_MantisLeap_C_K2_ShouldAbilityRespondToEvent) == 0x000108, "Wrong size on GA_Ninja_MantisLeap_C_K2_ShouldAbilityRespondToEvent");
static_assert(offsetof(GA_Ninja_MantisLeap_C_K2_ShouldAbilityRespondToEvent, ActorInfo) == 0x000000, "Member 'GA_Ninja_MantisLeap_C_K2_ShouldAbilityRespondToEvent::ActorInfo' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_K2_ShouldAbilityRespondToEvent, Payload) == 0x000040, "Member 'GA_Ninja_MantisLeap_C_K2_ShouldAbilityRespondToEvent::Payload' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_K2_ShouldAbilityRespondToEvent, ReturnValue) == 0x0000E8, "Member 'GA_Ninja_MantisLeap_C_K2_ShouldAbilityRespondToEvent::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_K2_ShouldAbilityRespondToEvent, CallFunc_HasAnyMatchingGameplayTags_self_CastInput) == 0x0000F0, "Member 'GA_Ninja_MantisLeap_C_K2_ShouldAbilityRespondToEvent::CallFunc_HasAnyMatchingGameplayTags_self_CastInput' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_K2_ShouldAbilityRespondToEvent, CallFunc_HasAnyMatchingGameplayTags_ReturnValue) == 0x000100, "Member 'GA_Ninja_MantisLeap_C_K2_ShouldAbilityRespondToEvent::CallFunc_HasAnyMatchingGameplayTags_ReturnValue' has a wrong offset!");

// Function GA_Ninja_MantisLeap.GA_Ninja_MantisLeap_C.SetJumpHeight
// 0x0058 (0x0058 - 0x0000)
struct GA_Ninja_MantisLeap_C_SetJumpHeight final
{
public:
	class APlayerPawn_Ninja_C*                    Ninja_Pawn;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        Ninja_Pawn_Out;                                    // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Jump_Height;                                       // 0x0010(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x001C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0028(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0034(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0040(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue2;            // 0x004C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_Ninja_MantisLeap_C_SetJumpHeight) == 0x000008, "Wrong alignment on GA_Ninja_MantisLeap_C_SetJumpHeight");
static_assert(sizeof(GA_Ninja_MantisLeap_C_SetJumpHeight) == 0x000058, "Wrong size on GA_Ninja_MantisLeap_C_SetJumpHeight");
static_assert(offsetof(GA_Ninja_MantisLeap_C_SetJumpHeight, Ninja_Pawn) == 0x000000, "Member 'GA_Ninja_MantisLeap_C_SetJumpHeight::Ninja_Pawn' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_SetJumpHeight, Ninja_Pawn_Out) == 0x000008, "Member 'GA_Ninja_MantisLeap_C_SetJumpHeight::Ninja_Pawn_Out' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_SetJumpHeight, Jump_Height) == 0x000010, "Member 'GA_Ninja_MantisLeap_C_SetJumpHeight::Jump_Height' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_SetJumpHeight, CallFunc_GetVelocity_ReturnValue) == 0x00001C, "Member 'GA_Ninja_MantisLeap_C_SetJumpHeight::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_SetJumpHeight, CallFunc_MakeVector_ReturnValue) == 0x000028, "Member 'GA_Ninja_MantisLeap_C_SetJumpHeight::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_SetJumpHeight, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000034, "Member 'GA_Ninja_MantisLeap_C_SetJumpHeight::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_SetJumpHeight, CallFunc_Add_VectorVector_ReturnValue) == 0x000040, "Member 'GA_Ninja_MantisLeap_C_SetJumpHeight::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_SetJumpHeight, CallFunc_Add_VectorVector_ReturnValue2) == 0x00004C, "Member 'GA_Ninja_MantisLeap_C_SetJumpHeight::CallFunc_Add_VectorVector_ReturnValue2' has a wrong offset!");

// Function GA_Ninja_MantisLeap.GA_Ninja_MantisLeap_C.SetupAbility
// 0x0080 (0x0080 - 0x0000)
struct GA_Ninja_MantisLeap_C_SetupAbility final
{
public:
	class UAbilitySystemComponent*                AbilitySystem;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput; // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue;   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface2_CastInput; // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue2;  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface3_CastInput; // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue3;  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface4_CastInput; // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue4;  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> CallFunc_HasAllMatchingGameplayTags_TagContainerInterface5_CastInput; // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasAllMatchingGameplayTags_ReturnValue5;  // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Ninja_MantisLeap_C_SetupAbility) == 0x000008, "Wrong alignment on GA_Ninja_MantisLeap_C_SetupAbility");
static_assert(sizeof(GA_Ninja_MantisLeap_C_SetupAbility) == 0x000080, "Wrong size on GA_Ninja_MantisLeap_C_SetupAbility");
static_assert(offsetof(GA_Ninja_MantisLeap_C_SetupAbility, AbilitySystem) == 0x000000, "Member 'GA_Ninja_MantisLeap_C_SetupAbility::AbilitySystem' has a wrong offset!");
static_assert(offsetof(GA_Ninja_MantisLeap_C_SetupAbility, CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput) == 0x000008, "Member 'GA_Ninja_MantisLeap_C_SetupAbility::CallFunc_HasAllMatchingGameplayTags_TagContainerInterface_CastInput' has a wrong offset!");
