#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Ninja_WeaponSwitch

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GAT_NinjaTriggeredAbility_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Ninja_WeaponSwitch.GA_Ninja_WeaponSwitch_C
// 0x0048 (0x0B58 - 0x0B10)
class UGA_Ninja_WeaponSwitch_C final : public UGAT_NinjaTriggeredAbility_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Ninja_WeaponSwitch_C;            // 0x0B10(0x0008)(Transient, DuplicateTransient)
	struct FGameplayTagContainer                  TC_IsEdged;                                        // 0x0B18(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  TC_IsAssassinate;                                  // 0x0B38(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_GA_Ninja_WeaponSwitch(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Ninja_WeaponSwitch_C">();
	}
	static class UGA_Ninja_WeaponSwitch_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Ninja_WeaponSwitch_C>();
	}
};
static_assert(alignof(UGA_Ninja_WeaponSwitch_C) == 0x000008, "Wrong alignment on UGA_Ninja_WeaponSwitch_C");
static_assert(sizeof(UGA_Ninja_WeaponSwitch_C) == 0x000B58, "Wrong size on UGA_Ninja_WeaponSwitch_C");
static_assert(offsetof(UGA_Ninja_WeaponSwitch_C, UberGraphFrame_GA_Ninja_WeaponSwitch_C) == 0x000B10, "Member 'UGA_Ninja_WeaponSwitch_C::UberGraphFrame_GA_Ninja_WeaponSwitch_C' has a wrong offset!");
static_assert(offsetof(UGA_Ninja_WeaponSwitch_C, TC_IsEdged) == 0x000B18, "Member 'UGA_Ninja_WeaponSwitch_C::TC_IsEdged' has a wrong offset!");
static_assert(offsetof(UGA_Ninja_WeaponSwitch_C, TC_IsAssassinate) == 0x000B38, "Member 'UGA_Ninja_WeaponSwitch_C::TC_IsAssassinate' has a wrong offset!");

}

