#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GAT_NinjaTriggeredAbility

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GAT_TriggeredAbility_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GAT_NinjaTriggeredAbility.GAT_NinjaTriggeredAbility_C
// 0x00C0 (0x0B10 - 0x0A50)
class UGAT_NinjaTriggeredAbility_C : public UGAT_TriggeredAbility_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GAT_NinjaTriggeredAbility_C;        // 0x0A50(0x0008)(Transient, DuplicateTransient)
	class APlayerPawn_Ninja_C*                    NinjaPlayerPawn;                                   // 0x0A58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     Event_Data;                                        // 0x0A60(0x00A8)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsAutoCommitted;                                   // 0x0B08(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsStaminaLockedOut;                                // 0x0B09(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_GAT_NinjaTriggeredAbility(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GAT_NinjaTriggeredAbility_C">();
	}
	static class UGAT_NinjaTriggeredAbility_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGAT_NinjaTriggeredAbility_C>();
	}
};
static_assert(alignof(UGAT_NinjaTriggeredAbility_C) == 0x000008, "Wrong alignment on UGAT_NinjaTriggeredAbility_C");
static_assert(sizeof(UGAT_NinjaTriggeredAbility_C) == 0x000B10, "Wrong size on UGAT_NinjaTriggeredAbility_C");
static_assert(offsetof(UGAT_NinjaTriggeredAbility_C, UberGraphFrame_GAT_NinjaTriggeredAbility_C) == 0x000A50, "Member 'UGAT_NinjaTriggeredAbility_C::UberGraphFrame_GAT_NinjaTriggeredAbility_C' has a wrong offset!");
static_assert(offsetof(UGAT_NinjaTriggeredAbility_C, NinjaPlayerPawn) == 0x000A58, "Member 'UGAT_NinjaTriggeredAbility_C::NinjaPlayerPawn' has a wrong offset!");
static_assert(offsetof(UGAT_NinjaTriggeredAbility_C, Event_Data) == 0x000A60, "Member 'UGAT_NinjaTriggeredAbility_C::Event_Data' has a wrong offset!");
static_assert(offsetof(UGAT_NinjaTriggeredAbility_C, IsAutoCommitted) == 0x000B08, "Member 'UGAT_NinjaTriggeredAbility_C::IsAutoCommitted' has a wrong offset!");
static_assert(offsetof(UGAT_NinjaTriggeredAbility_C, IsStaminaLockedOut) == 0x000B09, "Member 'UGAT_NinjaTriggeredAbility_C::IsStaminaLockedOut' has a wrong offset!");

}

