#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCN_Athena_Bush

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GCN_Athena_Bush.GCN_Athena_Bush_C.ExecuteUbergraph_GCN_Athena_Bush
// 0x0060 (0x0060 - 0x0000)
struct GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable2;                             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x001C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_VSize_ReturnValue;                        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue2;          // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0038(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default;                             // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush) == 0x000008, "Wrong alignment on GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush");
static_assert(sizeof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush) == 0x000060, "Wrong size on GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, EntryPoint) == 0x000000, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::EntryPoint' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, Temp_bool_Variable) == 0x000004, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, Temp_object_Variable) == 0x000008, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, Temp_object_Variable2) == 0x000010, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, K2Node_Event_DeltaSeconds) == 0x000018, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, CallFunc_GetVelocity_ReturnValue) == 0x00001C, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, CallFunc_VSize_ReturnValue) == 0x000028, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00002C, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, CallFunc_FClamp_ReturnValue) == 0x000030, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000034, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, CallFunc_Greater_FloatFloat_ReturnValue2) == 0x000035, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::CallFunc_Greater_FloatFloat_ReturnValue2' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000038, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, K2Node_DynamicCast_AsFort_Player_Pawn_Athena) == 0x000048, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::K2Node_DynamicCast_AsFort_Player_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, CallFunc_IsLocallyControlled_ReturnValue) == 0x000051, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush, K2Node_Select_Default) == 0x000058, "Member 'GCN_Athena_Bush_C_ExecuteUbergraph_GCN_Athena_Bush::K2Node_Select_Default' has a wrong offset!");

// Function GCN_Athena_Bush.GCN_Athena_Bush_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct GCN_Athena_Bush_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Athena_Bush_C_ReceiveTick) == 0x000004, "Wrong alignment on GCN_Athena_Bush_C_ReceiveTick");
static_assert(sizeof(GCN_Athena_Bush_C_ReceiveTick) == 0x000004, "Wrong size on GCN_Athena_Bush_C_ReceiveTick");
static_assert(offsetof(GCN_Athena_Bush_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'GCN_Athena_Bush_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function GCN_Athena_Bush.GCN_Athena_Bush_C.OnRemove
// 0x0110 (0x0110 - 0x0000)
struct GCN_Athena_Bush_C_OnRemove final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable;                              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable2;                             // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00D8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F2[0x6];                                       // 0x00F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00F8(0x0010)(ZeroConstructor, NoDestructor)
	class USoundBase*                             K2Node_Select_Default;                             // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Athena_Bush_C_OnRemove) == 0x000008, "Wrong alignment on GCN_Athena_Bush_C_OnRemove");
static_assert(sizeof(GCN_Athena_Bush_C_OnRemove) == 0x000110, "Wrong size on GCN_Athena_Bush_C_OnRemove");
static_assert(offsetof(GCN_Athena_Bush_C_OnRemove, MyTarget) == 0x000000, "Member 'GCN_Athena_Bush_C_OnRemove::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_OnRemove, Parameters) == 0x000008, "Member 'GCN_Athena_Bush_C_OnRemove::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_OnRemove, ReturnValue) == 0x0000C0, "Member 'GCN_Athena_Bush_C_OnRemove::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_OnRemove, Temp_bool_Variable) == 0x0000C1, "Member 'GCN_Athena_Bush_C_OnRemove::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_OnRemove, Temp_object_Variable) == 0x0000C8, "Member 'GCN_Athena_Bush_C_OnRemove::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_OnRemove, Temp_object_Variable2) == 0x0000D0, "Member 'GCN_Athena_Bush_C_OnRemove::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_OnRemove, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000D8, "Member 'GCN_Athena_Bush_C_OnRemove::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_OnRemove, CallFunc_IsValid_ReturnValue) == 0x0000E4, "Member 'GCN_Athena_Bush_C_OnRemove::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_OnRemove, K2Node_DynamicCast_AsFort_Player_Pawn_Athena) == 0x0000E8, "Member 'GCN_Athena_Bush_C_OnRemove::K2Node_DynamicCast_AsFort_Player_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_OnRemove, K2Node_DynamicCast_bSuccess) == 0x0000F0, "Member 'GCN_Athena_Bush_C_OnRemove::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_OnRemove, CallFunc_IsLocallyControlled_ReturnValue) == 0x0000F1, "Member 'GCN_Athena_Bush_C_OnRemove::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_OnRemove, K2Node_CreateDelegate_OutputDelegate) == 0x0000F8, "Member 'GCN_Athena_Bush_C_OnRemove::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_OnRemove, K2Node_Select_Default) == 0x000108, "Member 'GCN_Athena_Bush_C_OnRemove::K2Node_Select_Default' has a wrong offset!");

// Function GCN_Athena_Bush.GCN_Athena_Bush_C.OnActive
// 0x0118 (0x0118 - 0x0000)
struct GCN_Athena_Bush_C_OnActive final
{
public:
	class AActor*                                 MyTarget;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayCueParameters                 Parameters;                                        // 0x0008(0x00B8)(ConstParm, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          ReturnValue;                                       // 0x00C0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             Temp_object_Variable;                              // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Temp_object_Variable2;                             // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00D8(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00E8(0x0010)(ZeroConstructor, NoDestructor)
	class AFortPlayerPawnAthena*                  K2Node_DynamicCast_AsFort_Player_Pawn_Athena;      // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_102[0x6];                                      // 0x0102(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_Select_Default;                             // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GCN_Athena_Bush_C_OnActive) == 0x000008, "Wrong alignment on GCN_Athena_Bush_C_OnActive");
static_assert(sizeof(GCN_Athena_Bush_C_OnActive) == 0x000118, "Wrong size on GCN_Athena_Bush_C_OnActive");
static_assert(offsetof(GCN_Athena_Bush_C_OnActive, MyTarget) == 0x000000, "Member 'GCN_Athena_Bush_C_OnActive::MyTarget' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_OnActive, Parameters) == 0x000008, "Member 'GCN_Athena_Bush_C_OnActive::Parameters' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_OnActive, ReturnValue) == 0x0000C0, "Member 'GCN_Athena_Bush_C_OnActive::ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_OnActive, Temp_bool_Variable) == 0x0000C1, "Member 'GCN_Athena_Bush_C_OnActive::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_OnActive, Temp_object_Variable) == 0x0000C8, "Member 'GCN_Athena_Bush_C_OnActive::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_OnActive, Temp_object_Variable2) == 0x0000D0, "Member 'GCN_Athena_Bush_C_OnActive::Temp_object_Variable2' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_OnActive, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000D8, "Member 'GCN_Athena_Bush_C_OnActive::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_OnActive, K2Node_CreateDelegate_OutputDelegate) == 0x0000E8, "Member 'GCN_Athena_Bush_C_OnActive::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_OnActive, K2Node_DynamicCast_AsFort_Player_Pawn_Athena) == 0x0000F8, "Member 'GCN_Athena_Bush_C_OnActive::K2Node_DynamicCast_AsFort_Player_Pawn_Athena' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_OnActive, K2Node_DynamicCast_bSuccess) == 0x000100, "Member 'GCN_Athena_Bush_C_OnActive::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_OnActive, CallFunc_IsLocallyControlled_ReturnValue) == 0x000101, "Member 'GCN_Athena_Bush_C_OnActive::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_OnActive, K2Node_Select_Default) == 0x000108, "Member 'GCN_Athena_Bush_C_OnActive::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(GCN_Athena_Bush_C_OnActive, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000110, "Member 'GCN_Athena_Bush_C_OnActive::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

}

