#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCNL_Enemy_Frozen

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCNL_Enemy_Frozen.GCNL_Enemy_Frozen_C
// 0x0018 (0x0480 - 0x0468)
class AGCNL_Enemy_Frozen_C final : public AFortGameplayCueNotify_Looping
{
public:
	class UParticleSystemComponent*               Ice_Particles;                                     // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   IceMesh;                                           // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               IceMeshMID;                                        // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	bool OnActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCNL_Enemy_Frozen_C">();
	}
	static class AGCNL_Enemy_Frozen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCNL_Enemy_Frozen_C>();
	}
};
static_assert(alignof(AGCNL_Enemy_Frozen_C) == 0x000008, "Wrong alignment on AGCNL_Enemy_Frozen_C");
static_assert(sizeof(AGCNL_Enemy_Frozen_C) == 0x000480, "Wrong size on AGCNL_Enemy_Frozen_C");
static_assert(offsetof(AGCNL_Enemy_Frozen_C, Ice_Particles) == 0x000468, "Member 'AGCNL_Enemy_Frozen_C::Ice_Particles' has a wrong offset!");
static_assert(offsetof(AGCNL_Enemy_Frozen_C, IceMesh) == 0x000470, "Member 'AGCNL_Enemy_Frozen_C::IceMesh' has a wrong offset!");
static_assert(offsetof(AGCNL_Enemy_Frozen_C, IceMeshMID) == 0x000478, "Member 'AGCNL_Enemy_Frozen_C::IceMeshMID' has a wrong offset!");

}

