#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HalloweenQuestsTile

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function HalloweenQuestsTile.HalloweenQuestsTile_C.ExecuteUbergraph_HalloweenQuestsTile
// 0x0040 (0x0040 - 0x0000)
struct HalloweenQuestsTile_C_ExecuteUbergraph_HalloweenQuestsTile final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         Temp_int_Variable;                                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable2;                                // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEventUnlocked_IsUnlocked;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Select_Default;                             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HalloweenQuestsTile_C_ExecuteUbergraph_HalloweenQuestsTile) == 0x000008, "Wrong alignment on HalloweenQuestsTile_C_ExecuteUbergraph_HalloweenQuestsTile");
static_assert(sizeof(HalloweenQuestsTile_C_ExecuteUbergraph_HalloweenQuestsTile) == 0x000040, "Wrong size on HalloweenQuestsTile_C_ExecuteUbergraph_HalloweenQuestsTile");
static_assert(offsetof(HalloweenQuestsTile_C_ExecuteUbergraph_HalloweenQuestsTile, EntryPoint) == 0x000000, "Member 'HalloweenQuestsTile_C_ExecuteUbergraph_HalloweenQuestsTile::EntryPoint' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_ExecuteUbergraph_HalloweenQuestsTile, Temp_bool_Variable) == 0x000004, "Member 'HalloweenQuestsTile_C_ExecuteUbergraph_HalloweenQuestsTile::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_ExecuteUbergraph_HalloweenQuestsTile, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'HalloweenQuestsTile_C_ExecuteUbergraph_HalloweenQuestsTile::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_ExecuteUbergraph_HalloweenQuestsTile, Temp_int_Variable) == 0x000018, "Member 'HalloweenQuestsTile_C_ExecuteUbergraph_HalloweenQuestsTile::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_ExecuteUbergraph_HalloweenQuestsTile, Temp_int_Variable2) == 0x00001C, "Member 'HalloweenQuestsTile_C_ExecuteUbergraph_HalloweenQuestsTile::Temp_int_Variable2' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_ExecuteUbergraph_HalloweenQuestsTile, CallFunc_IsEventUnlocked_IsUnlocked) == 0x000020, "Member 'HalloweenQuestsTile_C_ExecuteUbergraph_HalloweenQuestsTile::CallFunc_IsEventUnlocked_IsUnlocked' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_ExecuteUbergraph_HalloweenQuestsTile, CallFunc_GetContext_ReturnValue) == 0x000028, "Member 'HalloweenQuestsTile_C_ExecuteUbergraph_HalloweenQuestsTile::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_ExecuteUbergraph_HalloweenQuestsTile, CallFunc_GetQuestManager_ReturnValue) == 0x000030, "Member 'HalloweenQuestsTile_C_ExecuteUbergraph_HalloweenQuestsTile::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_ExecuteUbergraph_HalloweenQuestsTile, K2Node_Select_Default) == 0x000038, "Member 'HalloweenQuestsTile_C_ExecuteUbergraph_HalloweenQuestsTile::K2Node_Select_Default' has a wrong offset!");

// Function HalloweenQuestsTile.HalloweenQuestsTile_C.UpdateSideQuestInfo
// 0x0120 (0x0120 - 0x0000)
struct HalloweenQuestsTile_C_UpdateSideQuestInfo final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetDisplayName_ReturnValue;               // 0x0010(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItem*                         CallFunc_GetQuestWithDefinition_ReturnValue;       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortQuestState                               CallFunc_GetQuestState_ReturnValue;                // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestObjectiveInfo*                CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisibleToUser_ReturnValue;              // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue2;                  // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable3;                    // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue2;             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItem*                         CallFunc_GetQuestWithDefinition_ReturnValue2;      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortQuestState                               CallFunc_GetQuestState_ReturnValue2;               // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum2_CmpSuccess;                     // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestObjectiveInfo*                CallFunc_Array_Get_Item2;                          // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetDisplayName_ReturnValue2;              // 0x00A8(0x0018)()
	int32                                         CallFunc_Array_Add_ReturnValue2;                   // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisibleToUser_ReturnValue2;             // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C5[0x3];                                       // 0x00C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable3;                   // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x00D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00D2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x00D3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_Add_IntInt_ReturnValue3;                  // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestObjectiveInfo*                CallFunc_Array_Get_Item3;                          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue4;                // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisibleToUser_ReturnValue3;             // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue3;                 // 0x00E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E6[0x2];                                       // 0x00E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable4;                   // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue4;                 // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue4;                  // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable4;                    // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItem*                         CallFunc_Array_Get_Item4;                          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortQuestState                               CallFunc_GetQuestState_ReturnValue3;               // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_102[0x2];                                      // 0x0102(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue3;                   // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetDisplayName_ReturnValue3;              // 0x0108(0x0018)()
};
static_assert(alignof(HalloweenQuestsTile_C_UpdateSideQuestInfo) == 0x000008, "Wrong alignment on HalloweenQuestsTile_C_UpdateSideQuestInfo");
static_assert(sizeof(HalloweenQuestsTile_C_UpdateSideQuestInfo) == 0x000120, "Wrong size on HalloweenQuestsTile_C_UpdateSideQuestInfo");
static_assert(offsetof(HalloweenQuestsTile_C_UpdateSideQuestInfo, Temp_int_Array_Index_Variable) == 0x000000, "Member 'HalloweenQuestsTile_C_UpdateSideQuestInfo::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_UpdateSideQuestInfo, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'HalloweenQuestsTile_C_UpdateSideQuestInfo::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_UpdateSideQuestInfo, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'HalloweenQuestsTile_C_UpdateSideQuestInfo::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_UpdateSideQuestInfo, CallFunc_GetDisplayName_ReturnValue) == 0x000010, "Member 'HalloweenQuestsTile_C_UpdateSideQuestInfo::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_UpdateSideQuestInfo, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'HalloweenQuestsTile_C_UpdateSideQuestInfo::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_UpdateSideQuestInfo, CallFunc_GetContext_ReturnValue) == 0x000030, "Member 'HalloweenQuestsTile_C_UpdateSideQuestInfo::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_UpdateSideQuestInfo, CallFunc_GetQuestManager_ReturnValue) == 0x000038, "Member 'HalloweenQuestsTile_C_UpdateSideQuestInfo::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_UpdateSideQuestInfo, CallFunc_GetQuestWithDefinition_ReturnValue) == 0x000040, "Member 'HalloweenQuestsTile_C_UpdateSideQuestInfo::CallFunc_GetQuestWithDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_UpdateSideQuestInfo, CallFunc_GetQuestState_ReturnValue) == 0x000048, "Member 'HalloweenQuestsTile_C_UpdateSideQuestInfo::CallFunc_GetQuestState_ReturnValue' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_UpdateSideQuestInfo, K2Node_SwitchEnum_CmpSuccess) == 0x000049, "Member 'HalloweenQuestsTile_C_UpdateSideQuestInfo::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_UpdateSideQuestInfo, Temp_int_Array_Index_Variable2) == 0x00004C, "Member 'HalloweenQuestsTile_C_UpdateSideQuestInfo::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_UpdateSideQuestInfo, Temp_int_Loop_Counter_Variable2) == 0x000050, "Member 'HalloweenQuestsTile_C_UpdateSideQuestInfo::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_UpdateSideQuestInfo, CallFunc_Array_Get_Item) == 0x000058, "Member 'HalloweenQuestsTile_C_UpdateSideQuestInfo::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_UpdateSideQuestInfo, CallFunc_Array_Add_ReturnValue) == 0x000060, "Member 'HalloweenQuestsTile_C_UpdateSideQuestInfo::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_UpdateSideQuestInfo, CallFunc_IsVisibleToUser_ReturnValue) == 0x000064, "Member 'HalloweenQuestsTile_C_UpdateSideQuestInfo::CallFunc_IsVisibleToUser_ReturnValue' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_UpdateSideQuestInfo, CallFunc_Add_IntInt_ReturnValue2) == 0x000068, "Member 'HalloweenQuestsTile_C_UpdateSideQuestInfo::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_UpdateSideQuestInfo, CallFunc_Array_Length_ReturnValue2) == 0x00006C, "Member 'HalloweenQuestsTile_C_UpdateSideQuestInfo::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_UpdateSideQuestInfo, CallFunc_Less_IntInt_ReturnValue) == 0x000070, "Member 'HalloweenQuestsTile_C_UpdateSideQuestInfo::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_UpdateSideQuestInfo, CallFunc_GetContext_ReturnValue2) == 0x000078, "Member 'HalloweenQuestsTile_C_UpdateSideQuestInfo::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_UpdateSideQuestInfo, Temp_int_Array_Index_Variable3) == 0x000080, "Member 'HalloweenQuestsTile_C_UpdateSideQuestInfo::Temp_int_Array_Index_Variable3' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_UpdateSideQuestInfo, CallFunc_GetQuestManager_ReturnValue2) == 0x000088, "Member 'HalloweenQuestsTile_C_UpdateSideQuestInfo::CallFunc_GetQuestManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_UpdateSideQuestInfo, CallFunc_GetQuestWithDefinition_ReturnValue2) == 0x000090, "Member 'HalloweenQuestsTile_C_UpdateSideQuestInfo::CallFunc_GetQuestWithDefinition_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_UpdateSideQuestInfo, CallFunc_GetQuestState_ReturnValue2) == 0x000098, "Member 'HalloweenQuestsTile_C_UpdateSideQuestInfo::CallFunc_GetQuestState_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_UpdateSideQuestInfo, K2Node_SwitchEnum2_CmpSuccess) == 0x000099, "Member 'HalloweenQuestsTile_C_UpdateSideQuestInfo::K2Node_SwitchEnum2_CmpSuccess' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_UpdateSideQuestInfo, CallFunc_Array_Get_Item2) == 0x0000A0, "Member 'HalloweenQuestsTile_C_UpdateSideQuestInfo::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_UpdateSideQuestInfo, CallFunc_GetDisplayName_ReturnValue2) == 0x0000A8, "Member 'HalloweenQuestsTile_C_UpdateSideQuestInfo::CallFunc_GetDisplayName_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_UpdateSideQuestInfo, CallFunc_Array_Add_ReturnValue2) == 0x0000C0, "Member 'HalloweenQuestsTile_C_UpdateSideQuestInfo::CallFunc_Array_Add_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_UpdateSideQuestInfo, CallFunc_IsVisibleToUser_ReturnValue2) == 0x0000C4, "Member 'HalloweenQuestsTile_C_UpdateSideQuestInfo::CallFunc_IsVisibleToUser_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_UpdateSideQuestInfo, CallFunc_Array_Length_ReturnValue3) == 0x0000C8, "Member 'HalloweenQuestsTile_C_UpdateSideQuestInfo::CallFunc_Array_Length_ReturnValue3' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_UpdateSideQuestInfo, Temp_int_Loop_Counter_Variable3) == 0x0000CC, "Member 'HalloweenQuestsTile_C_UpdateSideQuestInfo::Temp_int_Loop_Counter_Variable3' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_UpdateSideQuestInfo, Temp_bool_True_if_break_was_hit_Variable) == 0x0000D0, "Member 'HalloweenQuestsTile_C_UpdateSideQuestInfo::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_UpdateSideQuestInfo, CallFunc_Not_PreBool_ReturnValue) == 0x0000D1, "Member 'HalloweenQuestsTile_C_UpdateSideQuestInfo::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_UpdateSideQuestInfo, CallFunc_BooleanAND_ReturnValue) == 0x0000D2, "Member 'HalloweenQuestsTile_C_UpdateSideQuestInfo::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_UpdateSideQuestInfo, CallFunc_Less_IntInt_ReturnValue2) == 0x0000D3, "Member 'HalloweenQuestsTile_C_UpdateSideQuestInfo::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_UpdateSideQuestInfo, CallFunc_Add_IntInt_ReturnValue3) == 0x0000D4, "Member 'HalloweenQuestsTile_C_UpdateSideQuestInfo::CallFunc_Add_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_UpdateSideQuestInfo, CallFunc_Array_Get_Item3) == 0x0000D8, "Member 'HalloweenQuestsTile_C_UpdateSideQuestInfo::CallFunc_Array_Get_Item3' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_UpdateSideQuestInfo, CallFunc_Array_Length_ReturnValue4) == 0x0000E0, "Member 'HalloweenQuestsTile_C_UpdateSideQuestInfo::CallFunc_Array_Length_ReturnValue4' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_UpdateSideQuestInfo, CallFunc_IsVisibleToUser_ReturnValue3) == 0x0000E4, "Member 'HalloweenQuestsTile_C_UpdateSideQuestInfo::CallFunc_IsVisibleToUser_ReturnValue3' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_UpdateSideQuestInfo, CallFunc_Less_IntInt_ReturnValue3) == 0x0000E5, "Member 'HalloweenQuestsTile_C_UpdateSideQuestInfo::CallFunc_Less_IntInt_ReturnValue3' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_UpdateSideQuestInfo, Temp_int_Loop_Counter_Variable4) == 0x0000E8, "Member 'HalloweenQuestsTile_C_UpdateSideQuestInfo::Temp_int_Loop_Counter_Variable4' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_UpdateSideQuestInfo, CallFunc_Less_IntInt_ReturnValue4) == 0x0000EC, "Member 'HalloweenQuestsTile_C_UpdateSideQuestInfo::CallFunc_Less_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_UpdateSideQuestInfo, CallFunc_Add_IntInt_ReturnValue4) == 0x0000F0, "Member 'HalloweenQuestsTile_C_UpdateSideQuestInfo::CallFunc_Add_IntInt_ReturnValue4' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_UpdateSideQuestInfo, Temp_int_Array_Index_Variable4) == 0x0000F4, "Member 'HalloweenQuestsTile_C_UpdateSideQuestInfo::Temp_int_Array_Index_Variable4' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_UpdateSideQuestInfo, CallFunc_Array_Get_Item4) == 0x0000F8, "Member 'HalloweenQuestsTile_C_UpdateSideQuestInfo::CallFunc_Array_Get_Item4' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_UpdateSideQuestInfo, CallFunc_GetQuestState_ReturnValue3) == 0x000100, "Member 'HalloweenQuestsTile_C_UpdateSideQuestInfo::CallFunc_GetQuestState_ReturnValue3' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_UpdateSideQuestInfo, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000101, "Member 'HalloweenQuestsTile_C_UpdateSideQuestInfo::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_UpdateSideQuestInfo, CallFunc_Array_Add_ReturnValue3) == 0x000104, "Member 'HalloweenQuestsTile_C_UpdateSideQuestInfo::CallFunc_Array_Add_ReturnValue3' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_UpdateSideQuestInfo, CallFunc_GetDisplayName_ReturnValue3) == 0x000108, "Member 'HalloweenQuestsTile_C_UpdateSideQuestInfo::CallFunc_GetDisplayName_ReturnValue3' has a wrong offset!");

// Function HalloweenQuestsTile.HalloweenQuestsTile_C.IsEventUnlocked
// 0x0028 (0x0028 - 0x0000)
struct HalloweenQuestsTile_C_IsEventUnlocked final
{
public:
	bool                                          IsUnlocked;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItem*                         CallFunc_GetQuestWithDefinition_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortQuestState                               CallFunc_GetQuestState_ReturnValue;                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HalloweenQuestsTile_C_IsEventUnlocked) == 0x000008, "Wrong alignment on HalloweenQuestsTile_C_IsEventUnlocked");
static_assert(sizeof(HalloweenQuestsTile_C_IsEventUnlocked) == 0x000028, "Wrong size on HalloweenQuestsTile_C_IsEventUnlocked");
static_assert(offsetof(HalloweenQuestsTile_C_IsEventUnlocked, IsUnlocked) == 0x000000, "Member 'HalloweenQuestsTile_C_IsEventUnlocked::IsUnlocked' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_IsEventUnlocked, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'HalloweenQuestsTile_C_IsEventUnlocked::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_IsEventUnlocked, CallFunc_GetQuestManager_ReturnValue) == 0x000010, "Member 'HalloweenQuestsTile_C_IsEventUnlocked::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_IsEventUnlocked, CallFunc_GetQuestWithDefinition_ReturnValue) == 0x000018, "Member 'HalloweenQuestsTile_C_IsEventUnlocked::CallFunc_GetQuestWithDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_IsEventUnlocked, CallFunc_GetQuestState_ReturnValue) == 0x000020, "Member 'HalloweenQuestsTile_C_IsEventUnlocked::CallFunc_GetQuestState_ReturnValue' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_IsEventUnlocked, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000021, "Member 'HalloweenQuestsTile_C_IsEventUnlocked::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_IsEventUnlocked, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x000022, "Member 'HalloweenQuestsTile_C_IsEventUnlocked::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_IsEventUnlocked, CallFunc_BooleanOR_ReturnValue) == 0x000023, "Member 'HalloweenQuestsTile_C_IsEventUnlocked::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function HalloweenQuestsTile.HalloweenQuestsTile_C.PopulateVladQuestArray
// 0x00C8 (0x00C8 - 0x0000)
struct HalloweenQuestsTile_C_PopulateVladQuestArray final
{
public:
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItem*                         CallFunc_GetQuestWithDefinition_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItem*                         CallFunc_GetQuestWithDefinition_ReturnValue2;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue2;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItem*                         CallFunc_GetQuestWithDefinition_ReturnValue3;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItem*                         CallFunc_GetQuestWithDefinition_ReturnValue4;      // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue3;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue4;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItem*                         CallFunc_GetQuestWithDefinition_ReturnValue5;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItem*                         CallFunc_GetQuestWithDefinition_ReturnValue6;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue5;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue6;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItem*                         CallFunc_GetQuestWithDefinition_ReturnValue7;      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItem*                         CallFunc_GetQuestWithDefinition_ReturnValue8;      // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue7;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue8;                   // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItem*                         CallFunc_GetQuestWithDefinition_ReturnValue9;      // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItem*                         CallFunc_GetQuestWithDefinition_ReturnValue10;     // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue9;                   // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue10;                  // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItem*                         CallFunc_GetQuestWithDefinition_ReturnValue11;     // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItem*                         CallFunc_GetQuestWithDefinition_ReturnValue12;     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue11;                  // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue12;                  // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItem*                         CallFunc_GetQuestWithDefinition_ReturnValue13;     // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItem*                         CallFunc_GetQuestWithDefinition_ReturnValue14;     // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue13;                  // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue14;                  // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItem*                         CallFunc_GetQuestWithDefinition_ReturnValue15;     // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue15;                  // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HalloweenQuestsTile_C_PopulateVladQuestArray) == 0x000008, "Wrong alignment on HalloweenQuestsTile_C_PopulateVladQuestArray");
static_assert(sizeof(HalloweenQuestsTile_C_PopulateVladQuestArray) == 0x0000C8, "Wrong size on HalloweenQuestsTile_C_PopulateVladQuestArray");
static_assert(offsetof(HalloweenQuestsTile_C_PopulateVladQuestArray, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'HalloweenQuestsTile_C_PopulateVladQuestArray::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_PopulateVladQuestArray, CallFunc_GetQuestManager_ReturnValue) == 0x000008, "Member 'HalloweenQuestsTile_C_PopulateVladQuestArray::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_PopulateVladQuestArray, CallFunc_GetQuestWithDefinition_ReturnValue) == 0x000010, "Member 'HalloweenQuestsTile_C_PopulateVladQuestArray::CallFunc_GetQuestWithDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_PopulateVladQuestArray, CallFunc_GetQuestWithDefinition_ReturnValue2) == 0x000018, "Member 'HalloweenQuestsTile_C_PopulateVladQuestArray::CallFunc_GetQuestWithDefinition_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_PopulateVladQuestArray, CallFunc_Array_Add_ReturnValue) == 0x000020, "Member 'HalloweenQuestsTile_C_PopulateVladQuestArray::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_PopulateVladQuestArray, CallFunc_Array_Add_ReturnValue2) == 0x000024, "Member 'HalloweenQuestsTile_C_PopulateVladQuestArray::CallFunc_Array_Add_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_PopulateVladQuestArray, CallFunc_GetQuestWithDefinition_ReturnValue3) == 0x000028, "Member 'HalloweenQuestsTile_C_PopulateVladQuestArray::CallFunc_GetQuestWithDefinition_ReturnValue3' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_PopulateVladQuestArray, CallFunc_GetQuestWithDefinition_ReturnValue4) == 0x000030, "Member 'HalloweenQuestsTile_C_PopulateVladQuestArray::CallFunc_GetQuestWithDefinition_ReturnValue4' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_PopulateVladQuestArray, CallFunc_Array_Add_ReturnValue3) == 0x000038, "Member 'HalloweenQuestsTile_C_PopulateVladQuestArray::CallFunc_Array_Add_ReturnValue3' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_PopulateVladQuestArray, CallFunc_Array_Add_ReturnValue4) == 0x00003C, "Member 'HalloweenQuestsTile_C_PopulateVladQuestArray::CallFunc_Array_Add_ReturnValue4' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_PopulateVladQuestArray, CallFunc_GetQuestWithDefinition_ReturnValue5) == 0x000040, "Member 'HalloweenQuestsTile_C_PopulateVladQuestArray::CallFunc_GetQuestWithDefinition_ReturnValue5' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_PopulateVladQuestArray, CallFunc_GetQuestWithDefinition_ReturnValue6) == 0x000048, "Member 'HalloweenQuestsTile_C_PopulateVladQuestArray::CallFunc_GetQuestWithDefinition_ReturnValue6' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_PopulateVladQuestArray, CallFunc_Array_Add_ReturnValue5) == 0x000050, "Member 'HalloweenQuestsTile_C_PopulateVladQuestArray::CallFunc_Array_Add_ReturnValue5' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_PopulateVladQuestArray, CallFunc_Array_Add_ReturnValue6) == 0x000054, "Member 'HalloweenQuestsTile_C_PopulateVladQuestArray::CallFunc_Array_Add_ReturnValue6' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_PopulateVladQuestArray, CallFunc_GetQuestWithDefinition_ReturnValue7) == 0x000058, "Member 'HalloweenQuestsTile_C_PopulateVladQuestArray::CallFunc_GetQuestWithDefinition_ReturnValue7' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_PopulateVladQuestArray, CallFunc_GetQuestWithDefinition_ReturnValue8) == 0x000060, "Member 'HalloweenQuestsTile_C_PopulateVladQuestArray::CallFunc_GetQuestWithDefinition_ReturnValue8' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_PopulateVladQuestArray, CallFunc_Array_Add_ReturnValue7) == 0x000068, "Member 'HalloweenQuestsTile_C_PopulateVladQuestArray::CallFunc_Array_Add_ReturnValue7' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_PopulateVladQuestArray, CallFunc_Array_Add_ReturnValue8) == 0x00006C, "Member 'HalloweenQuestsTile_C_PopulateVladQuestArray::CallFunc_Array_Add_ReturnValue8' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_PopulateVladQuestArray, CallFunc_GetQuestWithDefinition_ReturnValue9) == 0x000070, "Member 'HalloweenQuestsTile_C_PopulateVladQuestArray::CallFunc_GetQuestWithDefinition_ReturnValue9' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_PopulateVladQuestArray, CallFunc_GetQuestWithDefinition_ReturnValue10) == 0x000078, "Member 'HalloweenQuestsTile_C_PopulateVladQuestArray::CallFunc_GetQuestWithDefinition_ReturnValue10' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_PopulateVladQuestArray, CallFunc_Array_Add_ReturnValue9) == 0x000080, "Member 'HalloweenQuestsTile_C_PopulateVladQuestArray::CallFunc_Array_Add_ReturnValue9' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_PopulateVladQuestArray, CallFunc_Array_Add_ReturnValue10) == 0x000084, "Member 'HalloweenQuestsTile_C_PopulateVladQuestArray::CallFunc_Array_Add_ReturnValue10' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_PopulateVladQuestArray, CallFunc_GetQuestWithDefinition_ReturnValue11) == 0x000088, "Member 'HalloweenQuestsTile_C_PopulateVladQuestArray::CallFunc_GetQuestWithDefinition_ReturnValue11' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_PopulateVladQuestArray, CallFunc_GetQuestWithDefinition_ReturnValue12) == 0x000090, "Member 'HalloweenQuestsTile_C_PopulateVladQuestArray::CallFunc_GetQuestWithDefinition_ReturnValue12' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_PopulateVladQuestArray, CallFunc_Array_Add_ReturnValue11) == 0x000098, "Member 'HalloweenQuestsTile_C_PopulateVladQuestArray::CallFunc_Array_Add_ReturnValue11' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_PopulateVladQuestArray, CallFunc_Array_Add_ReturnValue12) == 0x00009C, "Member 'HalloweenQuestsTile_C_PopulateVladQuestArray::CallFunc_Array_Add_ReturnValue12' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_PopulateVladQuestArray, CallFunc_GetQuestWithDefinition_ReturnValue13) == 0x0000A0, "Member 'HalloweenQuestsTile_C_PopulateVladQuestArray::CallFunc_GetQuestWithDefinition_ReturnValue13' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_PopulateVladQuestArray, CallFunc_GetQuestWithDefinition_ReturnValue14) == 0x0000A8, "Member 'HalloweenQuestsTile_C_PopulateVladQuestArray::CallFunc_GetQuestWithDefinition_ReturnValue14' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_PopulateVladQuestArray, CallFunc_Array_Add_ReturnValue13) == 0x0000B0, "Member 'HalloweenQuestsTile_C_PopulateVladQuestArray::CallFunc_Array_Add_ReturnValue13' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_PopulateVladQuestArray, CallFunc_Array_Add_ReturnValue14) == 0x0000B4, "Member 'HalloweenQuestsTile_C_PopulateVladQuestArray::CallFunc_Array_Add_ReturnValue14' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_PopulateVladQuestArray, CallFunc_GetQuestWithDefinition_ReturnValue15) == 0x0000B8, "Member 'HalloweenQuestsTile_C_PopulateVladQuestArray::CallFunc_GetQuestWithDefinition_ReturnValue15' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_PopulateVladQuestArray, CallFunc_Array_Add_ReturnValue15) == 0x0000C0, "Member 'HalloweenQuestsTile_C_PopulateVladQuestArray::CallFunc_Array_Add_ReturnValue15' has a wrong offset!");

// Function HalloweenQuestsTile.HalloweenQuestsTile_C.Configure Rewards and Timers
// 0x0068 (0x0068 - 0x0000)
struct HalloweenQuestsTile_C_Configure_Rewards_and_Timers final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortQuestState                               CallFunc_GetQuestState_ReturnValue;                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable4;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue2;         // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue;                  // 0x0010(0x0008)(NoDestructor)
	ESlateVisibility                              K2Node_Select2_Default;                            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue2;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItem*                         CallFunc_GetQuestWithDefinition_ReturnValue;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue2;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortQuestState                               CallFunc_GetQuestState_ReturnValue2;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestItem*                         CallFunc_GetQuestWithDefinition_ReturnValue2;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue3;         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EFortQuestState                               CallFunc_GetQuestState_ReturnValue3;               // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue4;         // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue5;         // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue6;         // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue3;                   // 0x005E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5F[0x1];                                       // 0x005F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimer_ReturnValue2;                 // 0x0060(0x0008)(NoDestructor)
};
static_assert(alignof(HalloweenQuestsTile_C_Configure_Rewards_and_Timers) == 0x000008, "Wrong alignment on HalloweenQuestsTile_C_Configure_Rewards_and_Timers");
static_assert(sizeof(HalloweenQuestsTile_C_Configure_Rewards_and_Timers) == 0x000068, "Wrong size on HalloweenQuestsTile_C_Configure_Rewards_and_Timers");
static_assert(offsetof(HalloweenQuestsTile_C_Configure_Rewards_and_Timers, Temp_bool_Variable) == 0x000000, "Member 'HalloweenQuestsTile_C_Configure_Rewards_and_Timers::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_Configure_Rewards_and_Timers, Temp_byte_Variable) == 0x000001, "Member 'HalloweenQuestsTile_C_Configure_Rewards_and_Timers::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_Configure_Rewards_and_Timers, Temp_byte_Variable2) == 0x000002, "Member 'HalloweenQuestsTile_C_Configure_Rewards_and_Timers::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_Configure_Rewards_and_Timers, Temp_byte_Variable3) == 0x000003, "Member 'HalloweenQuestsTile_C_Configure_Rewards_and_Timers::Temp_byte_Variable3' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_Configure_Rewards_and_Timers, CallFunc_GetQuestState_ReturnValue) == 0x000004, "Member 'HalloweenQuestsTile_C_Configure_Rewards_and_Timers::CallFunc_GetQuestState_ReturnValue' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_Configure_Rewards_and_Timers, Temp_byte_Variable4) == 0x000005, "Member 'HalloweenQuestsTile_C_Configure_Rewards_and_Timers::Temp_byte_Variable4' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_Configure_Rewards_and_Timers, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000006, "Member 'HalloweenQuestsTile_C_Configure_Rewards_and_Timers::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_Configure_Rewards_and_Timers, CallFunc_EqualEqual_ByteByte_ReturnValue2) == 0x000007, "Member 'HalloweenQuestsTile_C_Configure_Rewards_and_Timers::CallFunc_EqualEqual_ByteByte_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_Configure_Rewards_and_Timers, CallFunc_BooleanOR_ReturnValue) == 0x000008, "Member 'HalloweenQuestsTile_C_Configure_Rewards_and_Timers::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_Configure_Rewards_and_Timers, K2Node_Select_Default) == 0x000009, "Member 'HalloweenQuestsTile_C_Configure_Rewards_and_Timers::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_Configure_Rewards_and_Timers, Temp_bool_Variable2) == 0x00000A, "Member 'HalloweenQuestsTile_C_Configure_Rewards_and_Timers::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_Configure_Rewards_and_Timers, CallFunc_K2_SetTimer_ReturnValue) == 0x000010, "Member 'HalloweenQuestsTile_C_Configure_Rewards_and_Timers::CallFunc_K2_SetTimer_ReturnValue' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_Configure_Rewards_and_Timers, K2Node_Select2_Default) == 0x000018, "Member 'HalloweenQuestsTile_C_Configure_Rewards_and_Timers::K2Node_Select2_Default' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_Configure_Rewards_and_Timers, CallFunc_GetContext_ReturnValue) == 0x000020, "Member 'HalloweenQuestsTile_C_Configure_Rewards_and_Timers::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_Configure_Rewards_and_Timers, CallFunc_GetQuestManager_ReturnValue) == 0x000028, "Member 'HalloweenQuestsTile_C_Configure_Rewards_and_Timers::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_Configure_Rewards_and_Timers, CallFunc_GetContext_ReturnValue2) == 0x000030, "Member 'HalloweenQuestsTile_C_Configure_Rewards_and_Timers::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_Configure_Rewards_and_Timers, CallFunc_GetQuestWithDefinition_ReturnValue) == 0x000038, "Member 'HalloweenQuestsTile_C_Configure_Rewards_and_Timers::CallFunc_GetQuestWithDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_Configure_Rewards_and_Timers, CallFunc_GetQuestManager_ReturnValue2) == 0x000040, "Member 'HalloweenQuestsTile_C_Configure_Rewards_and_Timers::CallFunc_GetQuestManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_Configure_Rewards_and_Timers, CallFunc_GetQuestState_ReturnValue2) == 0x000048, "Member 'HalloweenQuestsTile_C_Configure_Rewards_and_Timers::CallFunc_GetQuestState_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_Configure_Rewards_and_Timers, CallFunc_GetQuestWithDefinition_ReturnValue2) == 0x000050, "Member 'HalloweenQuestsTile_C_Configure_Rewards_and_Timers::CallFunc_GetQuestWithDefinition_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_Configure_Rewards_and_Timers, CallFunc_EqualEqual_ByteByte_ReturnValue3) == 0x000058, "Member 'HalloweenQuestsTile_C_Configure_Rewards_and_Timers::CallFunc_EqualEqual_ByteByte_ReturnValue3' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_Configure_Rewards_and_Timers, CallFunc_GetQuestState_ReturnValue3) == 0x000059, "Member 'HalloweenQuestsTile_C_Configure_Rewards_and_Timers::CallFunc_GetQuestState_ReturnValue3' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_Configure_Rewards_and_Timers, CallFunc_EqualEqual_ByteByte_ReturnValue4) == 0x00005A, "Member 'HalloweenQuestsTile_C_Configure_Rewards_and_Timers::CallFunc_EqualEqual_ByteByte_ReturnValue4' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_Configure_Rewards_and_Timers, CallFunc_EqualEqual_ByteByte_ReturnValue5) == 0x00005B, "Member 'HalloweenQuestsTile_C_Configure_Rewards_and_Timers::CallFunc_EqualEqual_ByteByte_ReturnValue5' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_Configure_Rewards_and_Timers, CallFunc_BooleanOR_ReturnValue2) == 0x00005C, "Member 'HalloweenQuestsTile_C_Configure_Rewards_and_Timers::CallFunc_BooleanOR_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_Configure_Rewards_and_Timers, CallFunc_EqualEqual_ByteByte_ReturnValue6) == 0x00005D, "Member 'HalloweenQuestsTile_C_Configure_Rewards_and_Timers::CallFunc_EqualEqual_ByteByte_ReturnValue6' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_Configure_Rewards_and_Timers, CallFunc_BooleanOR_ReturnValue3) == 0x00005E, "Member 'HalloweenQuestsTile_C_Configure_Rewards_and_Timers::CallFunc_BooleanOR_ReturnValue3' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_Configure_Rewards_and_Timers, CallFunc_K2_SetTimer_ReturnValue2) == 0x000060, "Member 'HalloweenQuestsTile_C_Configure_Rewards_and_Timers::CallFunc_K2_SetTimer_ReturnValue2' has a wrong offset!");

// Function HalloweenQuestsTile.HalloweenQuestsTile_C.SetupSideQuestRewards
// 0x0040 (0x0040 - 0x0000)
struct HalloweenQuestsTile_C_SetupSideQuestRewards final
{
public:
	class UFortItem*                              CallFunc_CreateTemporaryItemInstanceBP_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItem*                              CallFunc_CreateTemporaryItemInstanceBP_ReturnValue2; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItem*                              CallFunc_CreateTemporaryItemInstanceBP_ReturnValue3; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItem*                              CallFunc_CreateTemporaryItemInstanceBP_ReturnValue4; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItem*                              CallFunc_CreateTemporaryItemInstanceBP_ReturnValue5; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItem*                              CallFunc_CreateTemporaryItemInstanceBP_ReturnValue6; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItem*                              CallFunc_CreateTemporaryItemInstanceBP_ReturnValue7; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItem*                              CallFunc_CreateTemporaryItemInstanceBP_ReturnValue8; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HalloweenQuestsTile_C_SetupSideQuestRewards) == 0x000008, "Wrong alignment on HalloweenQuestsTile_C_SetupSideQuestRewards");
static_assert(sizeof(HalloweenQuestsTile_C_SetupSideQuestRewards) == 0x000040, "Wrong size on HalloweenQuestsTile_C_SetupSideQuestRewards");
static_assert(offsetof(HalloweenQuestsTile_C_SetupSideQuestRewards, CallFunc_CreateTemporaryItemInstanceBP_ReturnValue) == 0x000000, "Member 'HalloweenQuestsTile_C_SetupSideQuestRewards::CallFunc_CreateTemporaryItemInstanceBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(HalloweenQuestsTile_C_SetupSideQuestRewards, CallFunc_CreateTemporaryItemInstanceBP_ReturnValue2) == 0x000008, "Member 'HalloweenQuestsTile_C_SetupSideQuestRewards::CallFunc_CreateTemporaryItemInstanceBP_ReturnValue2' has a wrong offset!");
