#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HalloweenMapPage_05

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass HalloweenMapPage_05.HalloweenMapPage_05_C
// 0x0078 (0x02B0 - 0x0238)
class UHalloweenMapPage_05_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       RewardOut;                                         // 0x0240(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       RewardIn;                                          // 0x0248(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasArt;                                         // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasQuests;                                      // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ChoiceQuestion;                                    // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_PlusSymbol;                                  // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Reward_2;                                    // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_DownArrow;                                     // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_REWARD_1;                                      // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNode_Arrows_C*                         Node_Arrows;                                       // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNode_Arrows_C*                         Node_Arrows_C_0;                                   // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNode_Arrows_C*                         NodeArrows_Left;                                   // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UQuestMiniTile_C*                       Q1;                                                // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UQuestMiniTile_C*                       Q2;                                                // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_HalloweenMapPage_05(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HalloweenMapPage_05_C">();
	}
	static class UHalloweenMapPage_05_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHalloweenMapPage_05_C>();
	}
};
static_assert(alignof(UHalloweenMapPage_05_C) == 0x000008, "Wrong alignment on UHalloweenMapPage_05_C");
static_assert(sizeof(UHalloweenMapPage_05_C) == 0x0002B0, "Wrong size on UHalloweenMapPage_05_C");
static_assert(offsetof(UHalloweenMapPage_05_C, UberGraphFrame) == 0x000238, "Member 'UHalloweenMapPage_05_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHalloweenMapPage_05_C, RewardOut) == 0x000240, "Member 'UHalloweenMapPage_05_C::RewardOut' has a wrong offset!");
static_assert(offsetof(UHalloweenMapPage_05_C, RewardIn) == 0x000248, "Member 'UHalloweenMapPage_05_C::RewardIn' has a wrong offset!");
static_assert(offsetof(UHalloweenMapPage_05_C, CanvasArt) == 0x000250, "Member 'UHalloweenMapPage_05_C::CanvasArt' has a wrong offset!");
static_assert(offsetof(UHalloweenMapPage_05_C, CanvasQuests) == 0x000258, "Member 'UHalloweenMapPage_05_C::CanvasQuests' has a wrong offset!");
static_assert(offsetof(UHalloweenMapPage_05_C, ChoiceQuestion) == 0x000260, "Member 'UHalloweenMapPage_05_C::ChoiceQuestion' has a wrong offset!");
static_assert(offsetof(UHalloweenMapPage_05_C, Image_PlusSymbol) == 0x000268, "Member 'UHalloweenMapPage_05_C::Image_PlusSymbol' has a wrong offset!");
static_assert(offsetof(UHalloweenMapPage_05_C, Image_Reward_2) == 0x000270, "Member 'UHalloweenMapPage_05_C::Image_Reward_2' has a wrong offset!");
static_assert(offsetof(UHalloweenMapPage_05_C, Img_DownArrow) == 0x000278, "Member 'UHalloweenMapPage_05_C::Img_DownArrow' has a wrong offset!");
static_assert(offsetof(UHalloweenMapPage_05_C, Img_REWARD_1) == 0x000280, "Member 'UHalloweenMapPage_05_C::Img_REWARD_1' has a wrong offset!");
static_assert(offsetof(UHalloweenMapPage_05_C, Node_Arrows) == 0x000288, "Member 'UHalloweenMapPage_05_C::Node_Arrows' has a wrong offset!");
static_assert(offsetof(UHalloweenMapPage_05_C, Node_Arrows_C_0) == 0x000290, "Member 'UHalloweenMapPage_05_C::Node_Arrows_C_0' has a wrong offset!");
static_assert(offsetof(UHalloweenMapPage_05_C, NodeArrows_Left) == 0x000298, "Member 'UHalloweenMapPage_05_C::NodeArrows_Left' has a wrong offset!");
static_assert(offsetof(UHalloweenMapPage_05_C, Q1) == 0x0002A0, "Member 'UHalloweenMapPage_05_C::Q1' has a wrong offset!");
static_assert(offsetof(UHalloweenMapPage_05_C, Q2) == 0x0002A8, "Member 'UHalloweenMapPage_05_C::Q2' has a wrong offset!");

}

