#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HalloweenQuestsTile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass HalloweenQuestsTile.HalloweenQuestsTile_C
// 0x01C8 (0x0400 - 0x0238)
class UHalloweenQuestsTile_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 Arrow2;                                            // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow3;                                            // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ArrowImage1;                                       // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonBorder*                          BorderBonusesBottomEdge;                           // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_13;                                          // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageQuest1Complete;                               // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageQuest2Complete;                               // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageQuest3Complete;                               // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UQuestMiniTile_C*                       QuestMiniTile;                                     // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SB_Reward1;                                        // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SB_Reward2;                                        // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMultiSizeItemCard*                 SideQuest1_Card1;                                  // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMultiSizeItemCard*                 SideQuest1_Card2;                                  // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMultiSizeItemCard*                 SideQuest1_Card3;                                  // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMultiSizeItemCard*                 SideQuest1_Card4;                                  // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SideQuest1Title;                                   // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMultiSizeItemCard*                 SideQuest2_Card1;                                  // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMultiSizeItemCard*                 SideQuest2_Card2;                                  // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMultiSizeItemCard*                 SideQuest2_Card3;                                  // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SideQuest2Title;                                   // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortMultiSizeItemCard*                 SideQuest3;                                        // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       SideQuest3Title;                                   // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBoxReward3;                                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  SwitcherQuests;                                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  SwitcherRewards1;                                  // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonWidgetSwitcher*                  SwitcherRewards2;                                  // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortListView*                          TaskListSideQuest1;                                // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortListView*                          TaskListSideQuest2;                                // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortListView*                          TaskListSideQuest3;                                // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortQuestItemDefinition*               Quest_Item_Def_SideQuest1;                         // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItemDefinition*               Quest_Item_Def_SideQuest2;                         // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItemDefinition*               Quest_Item_Def_SideQuest3;                         // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFortQuestObjectiveInfo*>        SideQuest1Objectives;                              // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UFortQuestObjectiveInfo*>        SideQuest2Objectives;                              // 0x0360(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UFortQuestObjectiveInfo*>        SideQuest3Objectives;                              // 0x0370(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UFortQuestItem*                         Quest_Item_SideQuest1;                             // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItem*                         Quest_Item_SideQuest2;                             // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItem*                         Quest_Item_SideQuest3;                             // 0x0390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           Reward1AnimationTimer;                             // 0x0398(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FTimerHandle                           Reward2AnimationTimer;                             // 0x03A0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	TArray<class UFortQuestItem*>                 Quest_Item_SideQuest3_Array;                       // 0x03A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UFortItemDefinition*                    SideQuest1_Item_Def_1;                             // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    SideQuest1_Item_Def_2;                             // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    SideQuest1_Item_Def_3;                             // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    SideQuest1_Item_Def_4;                             // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    SideQuest2_Item_Def_1;                             // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    SideQuest2_Item_Def_2;                             // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    SideQuest2_Item_Def_3;                             // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMultiSizeItemCard*                 SideQuest3_Card;                                   // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortItemDefinition*                    SideQuest3_Item_Def;                               // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_HalloweenQuestsTile(int32 EntryPoint);
	void Destruct();
	void Handle_OnQuestsUpdated();
	void Construct();
	void UpdateSideQuestInfo();
	void AdvanceRewardsDisplay();
	void IsEventUnlocked(bool* IsUnlocked);
	void PopulateVladQuestArray();
	void Configure_Rewards_and_Timers();
	void SetupSideQuestRewards();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HalloweenQuestsTile_C">();
	}
	static class UHalloweenQuestsTile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHalloweenQuestsTile_C>();
	}
};
static_assert(alignof(UHalloweenQuestsTile_C) == 0x000008, "Wrong alignment on UHalloweenQuestsTile_C");
static_assert(sizeof(UHalloweenQuestsTile_C) == 0x000400, "Wrong size on UHalloweenQuestsTile_C");
static_assert(offsetof(UHalloweenQuestsTile_C, UberGraphFrame) == 0x000238, "Member 'UHalloweenQuestsTile_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHalloweenQuestsTile_C, Arrow2) == 0x000240, "Member 'UHalloweenQuestsTile_C::Arrow2' has a wrong offset!");
static_assert(offsetof(UHalloweenQuestsTile_C, Arrow3) == 0x000248, "Member 'UHalloweenQuestsTile_C::Arrow3' has a wrong offset!");
static_assert(offsetof(UHalloweenQuestsTile_C, ArrowImage1) == 0x000250, "Member 'UHalloweenQuestsTile_C::ArrowImage1' has a wrong offset!");
static_assert(offsetof(UHalloweenQuestsTile_C, BorderBonusesBottomEdge) == 0x000258, "Member 'UHalloweenQuestsTile_C::BorderBonusesBottomEdge' has a wrong offset!");
static_assert(offsetof(UHalloweenQuestsTile_C, Image_0) == 0x000260, "Member 'UHalloweenQuestsTile_C::Image_0' has a wrong offset!");
static_assert(offsetof(UHalloweenQuestsTile_C, Image_1) == 0x000268, "Member 'UHalloweenQuestsTile_C::Image_1' has a wrong offset!");
static_assert(offsetof(UHalloweenQuestsTile_C, Image_13) == 0x000270, "Member 'UHalloweenQuestsTile_C::Image_13' has a wrong offset!");
static_assert(offsetof(UHalloweenQuestsTile_C, ImageQuest1Complete) == 0x000278, "Member 'UHalloweenQuestsTile_C::ImageQuest1Complete' has a wrong offset!");
static_assert(offsetof(UHalloweenQuestsTile_C, ImageQuest2Complete) == 0x000280, "Member 'UHalloweenQuestsTile_C::ImageQuest2Complete' has a wrong offset!");
static_assert(offsetof(UHalloweenQuestsTile_C, ImageQuest3Complete) == 0x000288, "Member 'UHalloweenQuestsTile_C::ImageQuest3Complete' has a wrong offset!");
static_assert(offsetof(UHalloweenQuestsTile_C, QuestMiniTile) == 0x000290, "Member 'UHalloweenQuestsTile_C::QuestMiniTile' has a wrong offset!");
static_assert(offsetof(UHalloweenQuestsTile_C, SB_Reward1) == 0x000298, "Member 'UHalloweenQuestsTile_C::SB_Reward1' has a wrong offset!");
static_assert(offsetof(UHalloweenQuestsTile_C, SB_Reward2) == 0x0002A0, "Member 'UHalloweenQuestsTile_C::SB_Reward2' has a wrong offset!");
static_assert(offsetof(UHalloweenQuestsTile_C, SideQuest1_Card1) == 0x0002A8, "Member 'UHalloweenQuestsTile_C::SideQuest1_Card1' has a wrong offset!");
static_assert(offsetof(UHalloweenQuestsTile_C, SideQuest1_Card2) == 0x0002B0, "Member 'UHalloweenQuestsTile_C::SideQuest1_Card2' has a wrong offset!");
static_assert(offsetof(UHalloweenQuestsTile_C, SideQuest1_Card3) == 0x0002B8, "Member 'UHalloweenQuestsTile_C::SideQuest1_Card3' has a wrong offset!");
static_assert(offsetof(UHalloweenQuestsTile_C, SideQuest1_Card4) == 0x0002C0, "Member 'UHalloweenQuestsTile_C::SideQuest1_Card4' has a wrong offset!");
static_assert(offsetof(UHalloweenQuestsTile_C, SideQuest1Title) == 0x0002C8, "Member 'UHalloweenQuestsTile_C::SideQuest1Title' has a wrong offset!");
static_assert(offsetof(UHalloweenQuestsTile_C, SideQuest2_Card1) == 0x0002D0, "Member 'UHalloweenQuestsTile_C::SideQuest2_Card1' has a wrong offset!");
static_assert(offsetof(UHalloweenQuestsTile_C, SideQuest2_Card2) == 0x0002D8, "Member 'UHalloweenQuestsTile_C::SideQuest2_Card2' has a wrong offset!");
static_assert(offsetof(UHalloweenQuestsTile_C, SideQuest2_Card3) == 0x0002E0, "Member 'UHalloweenQuestsTile_C::SideQuest2_Card3' has a wrong offset!");
static_assert(offsetof(UHalloweenQuestsTile_C, SideQuest2Title) == 0x0002E8, "Member 'UHalloweenQuestsTile_C::SideQuest2Title' has a wrong offset!");
static_assert(offsetof(UHalloweenQuestsTile_C, SideQuest3) == 0x0002F0, "Member 'UHalloweenQuestsTile_C::SideQuest3' has a wrong offset!");
static_assert(offsetof(UHalloweenQuestsTile_C, SideQuest3Title) == 0x0002F8, "Member 'UHalloweenQuestsTile_C::SideQuest3Title' has a wrong offset!");
static_assert(offsetof(UHalloweenQuestsTile_C, SizeBoxReward3) == 0x000300, "Member 'UHalloweenQuestsTile_C::SizeBoxReward3' has a wrong offset!");
static_assert(offsetof(UHalloweenQuestsTile_C, SwitcherQuests) == 0x000308, "Member 'UHalloweenQuestsTile_C::SwitcherQuests' has a wrong offset!");
static_assert(offsetof(UHalloweenQuestsTile_C, SwitcherRewards1) == 0x000310, "Member 'UHalloweenQuestsTile_C::SwitcherRewards1' has a wrong offset!");
static_assert(offsetof(UHalloweenQuestsTile_C, SwitcherRewards2) == 0x000318, "Member 'UHalloweenQuestsTile_C::SwitcherRewards2' has a wrong offset!");
static_assert(offsetof(UHalloweenQuestsTile_C, TaskListSideQuest1) == 0x000320, "Member 'UHalloweenQuestsTile_C::TaskListSideQuest1' has a wrong offset!");
static_assert(offsetof(UHalloweenQuestsTile_C, TaskListSideQuest2) == 0x000328, "Member 'UHalloweenQuestsTile_C::TaskListSideQuest2' has a wrong offset!");
static_assert(offsetof(UHalloweenQuestsTile_C, TaskListSideQuest3) == 0x000330, "Member 'UHalloweenQuestsTile_C::TaskListSideQuest3' has a wrong offset!");
static_assert(offsetof(UHalloweenQuestsTile_C, Quest_Item_Def_SideQuest1) == 0x000338, "Member 'UHalloweenQuestsTile_C::Quest_Item_Def_SideQuest1' has a wrong offset!");
static_assert(offsetof(UHalloweenQuestsTile_C, Quest_Item_Def_SideQuest2) == 0x000340, "Member 'UHalloweenQuestsTile_C::Quest_Item_Def_SideQuest2' has a wrong offset!");
static_assert(offsetof(UHalloweenQuestsTile_C, Quest_Item_Def_SideQuest3) == 0x000348, "Member 'UHalloweenQuestsTile_C::Quest_Item_Def_SideQuest3' has a wrong offset!");
static_assert(offsetof(UHalloweenQuestsTile_C, SideQuest1Objectives) == 0x000350, "Member 'UHalloweenQuestsTile_C::SideQuest1Objectives' has a wrong offset!");
static_assert(offsetof(UHalloweenQuestsTile_C, SideQuest2Objectives) == 0x000360, "Member 'UHalloweenQuestsTile_C::SideQuest2Objectives' has a wrong offset!");
static_assert(offsetof(UHalloweenQuestsTile_C, SideQuest3Objectives) == 0x000370, "Member 'UHalloweenQuestsTile_C::SideQuest3Objectives' has a wrong offset!");
static_assert(offsetof(UHalloweenQuestsTile_C, Quest_Item_SideQuest1) == 0x000380, "Member 'UHalloweenQuestsTile_C::Quest_Item_SideQuest1' has a wrong offset!");
static_assert(offsetof(UHalloweenQuestsTile_C, Quest_Item_SideQuest2) == 0x000388, "Member 'UHalloweenQuestsTile_C::Quest_Item_SideQuest2' has a wrong offset!");
static_assert(offsetof(UHalloweenQuestsTile_C, Quest_Item_SideQuest3) == 0x000390, "Member 'UHalloweenQuestsTile_C::Quest_Item_SideQuest3' has a wrong offset!");
static_assert(offsetof(UHalloweenQuestsTile_C, Reward1AnimationTimer) == 0x000398, "Member 'UHalloweenQuestsTile_C::Reward1AnimationTimer' has a wrong offset!");
static_assert(offsetof(UHalloweenQuestsTile_C, Reward2AnimationTimer) == 0x0003A0, "Member 'UHalloweenQuestsTile_C::Reward2AnimationTimer' has a wrong offset!");
static_assert(offsetof(UHalloweenQuestsTile_C, Quest_Item_SideQuest3_Array) == 0x0003A8, "Member 'UHalloweenQuestsTile_C::Quest_Item_SideQuest3_Array' has a wrong offset!");
static_assert(offsetof(UHalloweenQuestsTile_C, SideQuest1_Item_Def_1) == 0x0003B8, "Member 'UHalloweenQuestsTile_C::SideQuest1_Item_Def_1' has a wrong offset!");
static_assert(offsetof(UHalloweenQuestsTile_C, SideQuest1_Item_Def_2) == 0x0003C0, "Member 'UHalloweenQuestsTile_C::SideQuest1_Item_Def_2' has a wrong offset!");
static_assert(offsetof(UHalloweenQuestsTile_C, SideQuest1_Item_Def_3) == 0x0003C8, "Member 'UHalloweenQuestsTile_C::SideQuest1_Item_Def_3' has a wrong offset!");
static_assert(offsetof(UHalloweenQuestsTile_C, SideQuest1_Item_Def_4) == 0x0003D0, "Member 'UHalloweenQuestsTile_C::SideQuest1_Item_Def_4' has a wrong offset!");
static_assert(offsetof(UHalloweenQuestsTile_C, SideQuest2_Item_Def_1) == 0x0003D8, "Member 'UHalloweenQuestsTile_C::SideQuest2_Item_Def_1' has a wrong offset!");
static_assert(offsetof(UHalloweenQuestsTile_C, SideQuest2_Item_Def_2) == 0x0003E0, "Member 'UHalloweenQuestsTile_C::SideQuest2_Item_Def_2' has a wrong offset!");
static_assert(offsetof(UHalloweenQuestsTile_C, SideQuest2_Item_Def_3) == 0x0003E8, "Member 'UHalloweenQuestsTile_C::SideQuest2_Item_Def_3' has a wrong offset!");
static_assert(offsetof(UHalloweenQuestsTile_C, SideQuest3_Card) == 0x0003F0, "Member 'UHalloweenQuestsTile_C::SideQuest3_Card' has a wrong offset!");
static_assert(offsetof(UHalloweenQuestsTile_C, SideQuest3_Item_Def) == 0x0003F8, "Member 'UHalloweenQuestsTile_C::SideQuest3_Item_Def' has a wrong offset!");

}

