#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HomeScreenNextQuest

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function HomeScreenNextQuest.HomeScreenNextQuest_C.ExecuteUbergraph_HomeScreenNextQuest
// 0x0070 (0x0070 - 0x0000)
struct HomeScreenNextQuest_C_ExecuteUbergraph_HomeScreenNextQuest final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         K2Node_CustomEvent_ActiveEventFlags;               // 0x0020(0x0010)(ConstParm, ZeroConstructor, ReferenceParm)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue2;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UpdateButtonBasedOnEventStatus_EventIsActive; // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UpdateButtonBasedOnEventStatus_EventIsActive2; // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue3;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue4;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(TArray<class FString>& ActiveEventFlags)> K2Node_CreateDelegate_OutputDelegate;              // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HomeScreenNextQuest_C_ExecuteUbergraph_HomeScreenNextQuest) == 0x000008, "Wrong alignment on HomeScreenNextQuest_C_ExecuteUbergraph_HomeScreenNextQuest");
static_assert(sizeof(HomeScreenNextQuest_C_ExecuteUbergraph_HomeScreenNextQuest) == 0x000070, "Wrong size on HomeScreenNextQuest_C_ExecuteUbergraph_HomeScreenNextQuest");
static_assert(offsetof(HomeScreenNextQuest_C_ExecuteUbergraph_HomeScreenNextQuest, EntryPoint) == 0x000000, "Member 'HomeScreenNextQuest_C_ExecuteUbergraph_HomeScreenNextQuest::EntryPoint' has a wrong offset!");
static_assert(offsetof(HomeScreenNextQuest_C_ExecuteUbergraph_HomeScreenNextQuest, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'HomeScreenNextQuest_C_ExecuteUbergraph_HomeScreenNextQuest::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeScreenNextQuest_C_ExecuteUbergraph_HomeScreenNextQuest, K2Node_ComponentBoundEvent_Button) == 0x000010, "Member 'HomeScreenNextQuest_C_ExecuteUbergraph_HomeScreenNextQuest::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(HomeScreenNextQuest_C_ExecuteUbergraph_HomeScreenNextQuest, CallFunc_GetQuestManager_ReturnValue) == 0x000018, "Member 'HomeScreenNextQuest_C_ExecuteUbergraph_HomeScreenNextQuest::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeScreenNextQuest_C_ExecuteUbergraph_HomeScreenNextQuest, K2Node_CustomEvent_ActiveEventFlags) == 0x000020, "Member 'HomeScreenNextQuest_C_ExecuteUbergraph_HomeScreenNextQuest::K2Node_CustomEvent_ActiveEventFlags' has a wrong offset!");
static_assert(offsetof(HomeScreenNextQuest_C_ExecuteUbergraph_HomeScreenNextQuest, CallFunc_GetContext_ReturnValue2) == 0x000030, "Member 'HomeScreenNextQuest_C_ExecuteUbergraph_HomeScreenNextQuest::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HomeScreenNextQuest_C_ExecuteUbergraph_HomeScreenNextQuest, CallFunc_UpdateButtonBasedOnEventStatus_EventIsActive) == 0x000038, "Member 'HomeScreenNextQuest_C_ExecuteUbergraph_HomeScreenNextQuest::CallFunc_UpdateButtonBasedOnEventStatus_EventIsActive' has a wrong offset!");
static_assert(offsetof(HomeScreenNextQuest_C_ExecuteUbergraph_HomeScreenNextQuest, CallFunc_UpdateButtonBasedOnEventStatus_EventIsActive2) == 0x000039, "Member 'HomeScreenNextQuest_C_ExecuteUbergraph_HomeScreenNextQuest::CallFunc_UpdateButtonBasedOnEventStatus_EventIsActive2' has a wrong offset!");
static_assert(offsetof(HomeScreenNextQuest_C_ExecuteUbergraph_HomeScreenNextQuest, CallFunc_GetContext_ReturnValue3) == 0x000040, "Member 'HomeScreenNextQuest_C_ExecuteUbergraph_HomeScreenNextQuest::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(HomeScreenNextQuest_C_ExecuteUbergraph_HomeScreenNextQuest, CallFunc_GetContext_ReturnValue4) == 0x000048, "Member 'HomeScreenNextQuest_C_ExecuteUbergraph_HomeScreenNextQuest::CallFunc_GetContext_ReturnValue4' has a wrong offset!");
static_assert(offsetof(HomeScreenNextQuest_C_ExecuteUbergraph_HomeScreenNextQuest, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x000050, "Member 'HomeScreenNextQuest_C_ExecuteUbergraph_HomeScreenNextQuest::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeScreenNextQuest_C_ExecuteUbergraph_HomeScreenNextQuest, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000054, "Member 'HomeScreenNextQuest_C_ExecuteUbergraph_HomeScreenNextQuest::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeScreenNextQuest_C_ExecuteUbergraph_HomeScreenNextQuest, K2Node_CreateDelegate_OutputDelegate) == 0x000058, "Member 'HomeScreenNextQuest_C_ExecuteUbergraph_HomeScreenNextQuest::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(HomeScreenNextQuest_C_ExecuteUbergraph_HomeScreenNextQuest, CallFunc_GetUINavigationManager_ReturnValue) == 0x000068, "Member 'HomeScreenNextQuest_C_ExecuteUbergraph_HomeScreenNextQuest::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");

// Function HomeScreenNextQuest.HomeScreenNextQuest_C.Handle Event Flags Changed
// 0x0010 (0x0010 - 0x0000)
struct HomeScreenNextQuest_C_Handle_Event_Flags_Changed final
{
public:
	TArray<class FString>                         ActiveEventFlags;                                  // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm)
};
static_assert(alignof(HomeScreenNextQuest_C_Handle_Event_Flags_Changed) == 0x000008, "Wrong alignment on HomeScreenNextQuest_C_Handle_Event_Flags_Changed");
static_assert(sizeof(HomeScreenNextQuest_C_Handle_Event_Flags_Changed) == 0x000010, "Wrong size on HomeScreenNextQuest_C_Handle_Event_Flags_Changed");
static_assert(offsetof(HomeScreenNextQuest_C_Handle_Event_Flags_Changed, ActiveEventFlags) == 0x000000, "Member 'HomeScreenNextQuest_C_Handle_Event_Flags_Changed::ActiveEventFlags' has a wrong offset!");

// Function HomeScreenNextQuest.HomeScreenNextQuest_C.BndEvt__SwitchQuestMap_K2Node_ComponentBoundEvent_74_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct HomeScreenNextQuest_C_BndEvt__SwitchQuestMap_K2Node_ComponentBoundEvent_74_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HomeScreenNextQuest_C_BndEvt__SwitchQuestMap_K2Node_ComponentBoundEvent_74_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on HomeScreenNextQuest_C_BndEvt__SwitchQuestMap_K2Node_ComponentBoundEvent_74_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(HomeScreenNextQuest_C_BndEvt__SwitchQuestMap_K2Node_ComponentBoundEvent_74_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on HomeScreenNextQuest_C_BndEvt__SwitchQuestMap_K2Node_ComponentBoundEvent_74_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(HomeScreenNextQuest_C_BndEvt__SwitchQuestMap_K2Node_ComponentBoundEvent_74_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'HomeScreenNextQuest_C_BndEvt__SwitchQuestMap_K2Node_ComponentBoundEvent_74_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function HomeScreenNextQuest.HomeScreenNextQuest_C.UpdateButtonBasedOnEventStatus
// 0x0040 (0x0040 - 0x0000)
struct HomeScreenNextQuest_C_UpdateButtonBasedOnEventStatus final
{
public:
	bool                                          EventIsActive;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue2;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue2;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEventFlagActive_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestItem*                         CallFunc_GetQuestWithDefinition_ReturnValue;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HomeScreenNextQuest_C_UpdateButtonBasedOnEventStatus) == 0x000008, "Wrong alignment on HomeScreenNextQuest_C_UpdateButtonBasedOnEventStatus");
static_assert(sizeof(HomeScreenNextQuest_C_UpdateButtonBasedOnEventStatus) == 0x000040, "Wrong size on HomeScreenNextQuest_C_UpdateButtonBasedOnEventStatus");
static_assert(offsetof(HomeScreenNextQuest_C_UpdateButtonBasedOnEventStatus, EventIsActive) == 0x000000, "Member 'HomeScreenNextQuest_C_UpdateButtonBasedOnEventStatus::EventIsActive' has a wrong offset!");
static_assert(offsetof(HomeScreenNextQuest_C_UpdateButtonBasedOnEventStatus, Temp_bool_Variable) == 0x000001, "Member 'HomeScreenNextQuest_C_UpdateButtonBasedOnEventStatus::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HomeScreenNextQuest_C_UpdateButtonBasedOnEventStatus, Temp_byte_Variable) == 0x000002, "Member 'HomeScreenNextQuest_C_UpdateButtonBasedOnEventStatus::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(HomeScreenNextQuest_C_UpdateButtonBasedOnEventStatus, Temp_byte_Variable2) == 0x000003, "Member 'HomeScreenNextQuest_C_UpdateButtonBasedOnEventStatus::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(HomeScreenNextQuest_C_UpdateButtonBasedOnEventStatus, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'HomeScreenNextQuest_C_UpdateButtonBasedOnEventStatus::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeScreenNextQuest_C_UpdateButtonBasedOnEventStatus, CallFunc_GetContext_ReturnValue2) == 0x000010, "Member 'HomeScreenNextQuest_C_UpdateButtonBasedOnEventStatus::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HomeScreenNextQuest_C_UpdateButtonBasedOnEventStatus, CallFunc_GetQuestManager_ReturnValue) == 0x000018, "Member 'HomeScreenNextQuest_C_UpdateButtonBasedOnEventStatus::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeScreenNextQuest_C_UpdateButtonBasedOnEventStatus, CallFunc_GetQuestManager_ReturnValue2) == 0x000020, "Member 'HomeScreenNextQuest_C_UpdateButtonBasedOnEventStatus::CallFunc_GetQuestManager_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HomeScreenNextQuest_C_UpdateButtonBasedOnEventStatus, CallFunc_IsEventFlagActive_ReturnValue) == 0x000028, "Member 'HomeScreenNextQuest_C_UpdateButtonBasedOnEventStatus::CallFunc_IsEventFlagActive_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeScreenNextQuest_C_UpdateButtonBasedOnEventStatus, CallFunc_GetQuestWithDefinition_ReturnValue) == 0x000030, "Member 'HomeScreenNextQuest_C_UpdateButtonBasedOnEventStatus::CallFunc_GetQuestWithDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeScreenNextQuest_C_UpdateButtonBasedOnEventStatus, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'HomeScreenNextQuest_C_UpdateButtonBasedOnEventStatus::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeScreenNextQuest_C_UpdateButtonBasedOnEventStatus, CallFunc_BooleanOR_ReturnValue) == 0x000039, "Member 'HomeScreenNextQuest_C_UpdateButtonBasedOnEventStatus::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeScreenNextQuest_C_UpdateButtonBasedOnEventStatus, K2Node_Select_Default) == 0x00003A, "Member 'HomeScreenNextQuest_C_UpdateButtonBasedOnEventStatus::K2Node_Select_Default' has a wrong offset!");

// Function HomeScreenNextQuest.HomeScreenNextQuest_C.UpdateSceenBasedOnQuestMapShown
// 0x0008 (0x0008 - 0x0000)
struct HomeScreenNextQuest_C_UpdateSceenBasedOnQuestMapShown final
{
public:
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HomeScreenNextQuest_C_UpdateSceenBasedOnQuestMapShown) == 0x000008, "Wrong alignment on HomeScreenNextQuest_C_UpdateSceenBasedOnQuestMapShown");
static_assert(sizeof(HomeScreenNextQuest_C_UpdateSceenBasedOnQuestMapShown) == 0x000008, "Wrong size on HomeScreenNextQuest_C_UpdateSceenBasedOnQuestMapShown");
static_assert(offsetof(HomeScreenNextQuest_C_UpdateSceenBasedOnQuestMapShown, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'HomeScreenNextQuest_C_UpdateSceenBasedOnQuestMapShown::CallFunc_GetContext_ReturnValue' has a wrong offset!");

// Function HomeScreenNextQuest.HomeScreenNextQuest_C.ConfigureScreenForEvent
// 0x0018 (0x0018 - 0x0000)
struct HomeScreenNextQuest_C_ConfigureScreenForEvent final
{
public:
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue2;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFrontEndCamera                               CallFunc_GetFrontEndCamera_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HomeScreenNextQuest_C_ConfigureScreenForEvent) == 0x000008, "Wrong alignment on HomeScreenNextQuest_C_ConfigureScreenForEvent");
static_assert(sizeof(HomeScreenNextQuest_C_ConfigureScreenForEvent) == 0x000018, "Wrong size on HomeScreenNextQuest_C_ConfigureScreenForEvent");
static_assert(offsetof(HomeScreenNextQuest_C_ConfigureScreenForEvent, CallFunc_GetContext_ReturnValue) == 0x000000, "Member 'HomeScreenNextQuest_C_ConfigureScreenForEvent::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeScreenNextQuest_C_ConfigureScreenForEvent, CallFunc_GetContext_ReturnValue2) == 0x000008, "Member 'HomeScreenNextQuest_C_ConfigureScreenForEvent::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(HomeScreenNextQuest_C_ConfigureScreenForEvent, CallFunc_GetFrontEndCamera_ReturnValue) == 0x000010, "Member 'HomeScreenNextQuest_C_ConfigureScreenForEvent::CallFunc_GetFrontEndCamera_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeScreenNextQuest_C_ConfigureScreenForEvent, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000011, "Member 'HomeScreenNextQuest_C_ConfigureScreenForEvent::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function HomeScreenNextQuest.HomeScreenNextQuest_C.HandleBeyondCutOffQuest
// 0x0028 (0x0028 - 0x0000)
struct HomeScreenNextQuest_C_HandleBeyondCutOffQuest final
{
public:
	bool                                          Temp_bool_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestItem*                         CallFunc_GetQuestWithDefinition_ReturnValue;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasCompletedQuest_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(HomeScreenNextQuest_C_HandleBeyondCutOffQuest) == 0x000008, "Wrong alignment on HomeScreenNextQuest_C_HandleBeyondCutOffQuest");
static_assert(sizeof(HomeScreenNextQuest_C_HandleBeyondCutOffQuest) == 0x000028, "Wrong size on HomeScreenNextQuest_C_HandleBeyondCutOffQuest");
static_assert(offsetof(HomeScreenNextQuest_C_HandleBeyondCutOffQuest, Temp_bool_Variable) == 0x000000, "Member 'HomeScreenNextQuest_C_HandleBeyondCutOffQuest::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(HomeScreenNextQuest_C_HandleBeyondCutOffQuest, Temp_byte_Variable) == 0x000001, "Member 'HomeScreenNextQuest_C_HandleBeyondCutOffQuest::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(HomeScreenNextQuest_C_HandleBeyondCutOffQuest, Temp_byte_Variable2) == 0x000002, "Member 'HomeScreenNextQuest_C_HandleBeyondCutOffQuest::Temp_byte_Variable2' has a wrong offset!");
static_assert(offsetof(HomeScreenNextQuest_C_HandleBeyondCutOffQuest, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'HomeScreenNextQuest_C_HandleBeyondCutOffQuest::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeScreenNextQuest_C_HandleBeyondCutOffQuest, CallFunc_GetQuestManager_ReturnValue) == 0x000010, "Member 'HomeScreenNextQuest_C_HandleBeyondCutOffQuest::CallFunc_GetQuestManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeScreenNextQuest_C_HandleBeyondCutOffQuest, CallFunc_GetQuestWithDefinition_ReturnValue) == 0x000018, "Member 'HomeScreenNextQuest_C_HandleBeyondCutOffQuest::CallFunc_GetQuestWithDefinition_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeScreenNextQuest_C_HandleBeyondCutOffQuest, CallFunc_HasCompletedQuest_ReturnValue) == 0x000020, "Member 'HomeScreenNextQuest_C_HandleBeyondCutOffQuest::CallFunc_HasCompletedQuest_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeScreenNextQuest_C_HandleBeyondCutOffQuest, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'HomeScreenNextQuest_C_HandleBeyondCutOffQuest::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeScreenNextQuest_C_HandleBeyondCutOffQuest, CallFunc_BooleanAND_ReturnValue) == 0x000022, "Member 'HomeScreenNextQuest_C_HandleBeyondCutOffQuest::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(HomeScreenNextQuest_C_HandleBeyondCutOffQuest, K2Node_Select_Default) == 0x000023, "Member 'HomeScreenNextQuest_C_HandleBeyondCutOffQuest::K2Node_Select_Default' has a wrong offset!");

}

