#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JournalObjectiveProgressWidget

#include "Basic.hpp"

#include "FortniteUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass JournalObjectiveProgressWidget.JournalObjectiveProgressWidget_C
// 0x0018 (0x0258 - 0x0240)
class UJournalObjectiveProgressWidget_C final : public UFortUserWidget
{
public:
	class UImage*                                 _Image__Checkbox;                                  // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        _Switcher__Display_Mode;                           // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       CommonText_ProgressValue;                          // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Update(int32 Required, int32 Achieved);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"JournalObjectiveProgressWidget_C">();
	}
	static class UJournalObjectiveProgressWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UJournalObjectiveProgressWidget_C>();
	}
};
static_assert(alignof(UJournalObjectiveProgressWidget_C) == 0x000008, "Wrong alignment on UJournalObjectiveProgressWidget_C");
static_assert(sizeof(UJournalObjectiveProgressWidget_C) == 0x000258, "Wrong size on UJournalObjectiveProgressWidget_C");
static_assert(offsetof(UJournalObjectiveProgressWidget_C, _Image__Checkbox) == 0x000240, "Member 'UJournalObjectiveProgressWidget_C::_Image__Checkbox' has a wrong offset!");
static_assert(offsetof(UJournalObjectiveProgressWidget_C, _Switcher__Display_Mode) == 0x000248, "Member 'UJournalObjectiveProgressWidget_C::_Switcher__Display_Mode' has a wrong offset!");
static_assert(offsetof(UJournalObjectiveProgressWidget_C, CommonText_ProgressValue) == 0x000250, "Member 'UJournalObjectiveProgressWidget_C::CommonText_ProgressValue' has a wrong offset!");

}

