#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainQuestsTile

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass MainQuestsTile.MainQuestsTile_C
// 0x00B0 (0x02E8 - 0x0238)
class UMainQuestsTile_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(Transient, DuplicateTransient)
	class UWidgetSwitcher*                        BodyWidgetSwitcher;                                // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UConversationUtil_C*                    ConversationUtil;                                  // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           FutureObjectiveProgressBarGroup;                   // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonListView*                        FutureTaskList;                                    // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UJournalQuestRewardDetails_C*           JournalQuestRewardDetails;                         // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           MainQuestBodyBox;                                  // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               NoQuestBodyBox;                                    // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           ObjectiveProgressBarGroup;                         // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       QuestDescription;                                  // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 QuestIconMinusFill;                                // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 QuestJournalIconImage;                             // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       QuestLocation;                                     // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UQuestPlayButton_C*                     QuestPlayButton;                                   // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       QuestTitle;                                        // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox;                                         // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortListView*                          TaskList;                                          // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       UpcomingText;                                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortQuestItem*                         CurrentQuestItem;                                  // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UFortQuestObjectiveInfo*>        VisibleObjectives;                                 // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_MainQuestsTile(int32 EntryPoint);
	void PlayDialogIfRequired();
	void HandleQuestsUpdated();
	void HandleButtonClick(class UCommonButton* Button);
	void Construct();
	void HandleQuestChanged();
	void PopulateFilteredObjectives(class UFortQuestItem* Quest);
	void SetScrollWidget();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MainQuestsTile_C">();
	}
	static class UMainQuestsTile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMainQuestsTile_C>();
	}
};
static_assert(alignof(UMainQuestsTile_C) == 0x000008, "Wrong alignment on UMainQuestsTile_C");
static_assert(sizeof(UMainQuestsTile_C) == 0x0002E8, "Wrong size on UMainQuestsTile_C");
static_assert(offsetof(UMainQuestsTile_C, UberGraphFrame) == 0x000238, "Member 'UMainQuestsTile_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMainQuestsTile_C, BodyWidgetSwitcher) == 0x000240, "Member 'UMainQuestsTile_C::BodyWidgetSwitcher' has a wrong offset!");
static_assert(offsetof(UMainQuestsTile_C, ConversationUtil) == 0x000248, "Member 'UMainQuestsTile_C::ConversationUtil' has a wrong offset!");
static_assert(offsetof(UMainQuestsTile_C, FutureObjectiveProgressBarGroup) == 0x000250, "Member 'UMainQuestsTile_C::FutureObjectiveProgressBarGroup' has a wrong offset!");
static_assert(offsetof(UMainQuestsTile_C, FutureTaskList) == 0x000258, "Member 'UMainQuestsTile_C::FutureTaskList' has a wrong offset!");
static_assert(offsetof(UMainQuestsTile_C, Image_3) == 0x000260, "Member 'UMainQuestsTile_C::Image_3' has a wrong offset!");
static_assert(offsetof(UMainQuestsTile_C, JournalQuestRewardDetails) == 0x000268, "Member 'UMainQuestsTile_C::JournalQuestRewardDetails' has a wrong offset!");
static_assert(offsetof(UMainQuestsTile_C, MainQuestBodyBox) == 0x000270, "Member 'UMainQuestsTile_C::MainQuestBodyBox' has a wrong offset!");
static_assert(offsetof(UMainQuestsTile_C, NoQuestBodyBox) == 0x000278, "Member 'UMainQuestsTile_C::NoQuestBodyBox' has a wrong offset!");
static_assert(offsetof(UMainQuestsTile_C, ObjectiveProgressBarGroup) == 0x000280, "Member 'UMainQuestsTile_C::ObjectiveProgressBarGroup' has a wrong offset!");
static_assert(offsetof(UMainQuestsTile_C, QuestDescription) == 0x000288, "Member 'UMainQuestsTile_C::QuestDescription' has a wrong offset!");
static_assert(offsetof(UMainQuestsTile_C, QuestIconMinusFill) == 0x000290, "Member 'UMainQuestsTile_C::QuestIconMinusFill' has a wrong offset!");
static_assert(offsetof(UMainQuestsTile_C, QuestJournalIconImage) == 0x000298, "Member 'UMainQuestsTile_C::QuestJournalIconImage' has a wrong offset!");
static_assert(offsetof(UMainQuestsTile_C, QuestLocation) == 0x0002A0, "Member 'UMainQuestsTile_C::QuestLocation' has a wrong offset!");
static_assert(offsetof(UMainQuestsTile_C, QuestPlayButton) == 0x0002A8, "Member 'UMainQuestsTile_C::QuestPlayButton' has a wrong offset!");
static_assert(offsetof(UMainQuestsTile_C, QuestTitle) == 0x0002B0, "Member 'UMainQuestsTile_C::QuestTitle' has a wrong offset!");
static_assert(offsetof(UMainQuestsTile_C, ScrollBox) == 0x0002B8, "Member 'UMainQuestsTile_C::ScrollBox' has a wrong offset!");
static_assert(offsetof(UMainQuestsTile_C, TaskList) == 0x0002C0, "Member 'UMainQuestsTile_C::TaskList' has a wrong offset!");
static_assert(offsetof(UMainQuestsTile_C, UpcomingText) == 0x0002C8, "Member 'UMainQuestsTile_C::UpcomingText' has a wrong offset!");
static_assert(offsetof(UMainQuestsTile_C, CurrentQuestItem) == 0x0002D0, "Member 'UMainQuestsTile_C::CurrentQuestItem' has a wrong offset!");
static_assert(offsetof(UMainQuestsTile_C, VisibleObjectives) == 0x0002D8, "Member 'UMainQuestsTile_C::VisibleObjectives' has a wrong offset!");

}

