#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Node_Arrows

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Node_Arrows.Node_Arrows_C
// 0x0138 (0x0368 - 0x0230)
class UNode_Arrows_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 Act_Arrow_End;                                     // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Act_Arrow_Line_Left;                               // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Act_Arrow_Line_Right;                              // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Act_Arrow_Mid;                                     // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Act_Arrow_Start;                                   // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Cmp_Arrow_End;                                     // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Cmp_Arrow_Start;                                   // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Cmp_Cmp_Arrow_Line;                                // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icmp_Arrow_End;                                    // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icmp_Arrow_Line;                                   // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icmp_Arrow_Start;                                  // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Left_Act_Arrow_End;                                // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Left_Act_Arrow_Line;                               // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Left_Act_Arrow_Start;                              // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Left_Arrow_End;                                    // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Left_Arrow_Start;                                  // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Left_Cmp_Arrow_Line;                               // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Left_Icmp_Arrow_End;                               // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Left_Icmp_Arrow_Line;                              // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Left_Icmp_Arrow_Start;                             // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Right_Act_Arrow_End;                               // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Right_Act_Arrow_Line;                              // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Right_Act_Arrow_Start;                             // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Right_Cmp_Arrow_End;                               // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Right_Cmp_Arrow_Line;                              // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Right_Cmp_Arrow_Start;                             // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Right_Icmp_Arrow_End;                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Right_Icmp_Arrow_Line;                             // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Right_Icmp_Arrow_Start;                            // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBoxSizeController;                             // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcherMinusArrowType;                      // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         ArrowIndex;                                        // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            OverrideColor;                                     // 0x0338(0x0028)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          UseOverrideColor;                                  // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_Node_Arrows(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void ApplyOverideColor();
	void OverideColorOnBrush(class UImage* InBrush);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Node_Arrows_C">();
	}
	static class UNode_Arrows_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNode_Arrows_C>();
	}
};
static_assert(alignof(UNode_Arrows_C) == 0x000008, "Wrong alignment on UNode_Arrows_C");
static_assert(sizeof(UNode_Arrows_C) == 0x000368, "Wrong size on UNode_Arrows_C");
static_assert(offsetof(UNode_Arrows_C, UberGraphFrame) == 0x000230, "Member 'UNode_Arrows_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UNode_Arrows_C, Act_Arrow_End) == 0x000238, "Member 'UNode_Arrows_C::Act_Arrow_End' has a wrong offset!");
static_assert(offsetof(UNode_Arrows_C, Act_Arrow_Line_Left) == 0x000240, "Member 'UNode_Arrows_C::Act_Arrow_Line_Left' has a wrong offset!");
static_assert(offsetof(UNode_Arrows_C, Act_Arrow_Line_Right) == 0x000248, "Member 'UNode_Arrows_C::Act_Arrow_Line_Right' has a wrong offset!");
static_assert(offsetof(UNode_Arrows_C, Act_Arrow_Mid) == 0x000250, "Member 'UNode_Arrows_C::Act_Arrow_Mid' has a wrong offset!");
static_assert(offsetof(UNode_Arrows_C, Act_Arrow_Start) == 0x000258, "Member 'UNode_Arrows_C::Act_Arrow_Start' has a wrong offset!");
static_assert(offsetof(UNode_Arrows_C, Cmp_Arrow_End) == 0x000260, "Member 'UNode_Arrows_C::Cmp_Arrow_End' has a wrong offset!");
static_assert(offsetof(UNode_Arrows_C, Cmp_Arrow_Start) == 0x000268, "Member 'UNode_Arrows_C::Cmp_Arrow_Start' has a wrong offset!");
static_assert(offsetof(UNode_Arrows_C, Cmp_Cmp_Arrow_Line) == 0x000270, "Member 'UNode_Arrows_C::Cmp_Cmp_Arrow_Line' has a wrong offset!");
static_assert(offsetof(UNode_Arrows_C, Icmp_Arrow_End) == 0x000278, "Member 'UNode_Arrows_C::Icmp_Arrow_End' has a wrong offset!");
static_assert(offsetof(UNode_Arrows_C, Icmp_Arrow_Line) == 0x000280, "Member 'UNode_Arrows_C::Icmp_Arrow_Line' has a wrong offset!");
static_assert(offsetof(UNode_Arrows_C, Icmp_Arrow_Start) == 0x000288, "Member 'UNode_Arrows_C::Icmp_Arrow_Start' has a wrong offset!");
static_assert(offsetof(UNode_Arrows_C, Left_Act_Arrow_End) == 0x000290, "Member 'UNode_Arrows_C::Left_Act_Arrow_End' has a wrong offset!");
static_assert(offsetof(UNode_Arrows_C, Left_Act_Arrow_Line) == 0x000298, "Member 'UNode_Arrows_C::Left_Act_Arrow_Line' has a wrong offset!");
static_assert(offsetof(UNode_Arrows_C, Left_Act_Arrow_Start) == 0x0002A0, "Member 'UNode_Arrows_C::Left_Act_Arrow_Start' has a wrong offset!");
static_assert(offsetof(UNode_Arrows_C, Left_Arrow_End) == 0x0002A8, "Member 'UNode_Arrows_C::Left_Arrow_End' has a wrong offset!");
static_assert(offsetof(UNode_Arrows_C, Left_Arrow_Start) == 0x0002B0, "Member 'UNode_Arrows_C::Left_Arrow_Start' has a wrong offset!");
static_assert(offsetof(UNode_Arrows_C, Left_Cmp_Arrow_Line) == 0x0002B8, "Member 'UNode_Arrows_C::Left_Cmp_Arrow_Line' has a wrong offset!");
static_assert(offsetof(UNode_Arrows_C, Left_Icmp_Arrow_End) == 0x0002C0, "Member 'UNode_Arrows_C::Left_Icmp_Arrow_End' has a wrong offset!");
static_assert(offsetof(UNode_Arrows_C, Left_Icmp_Arrow_Line) == 0x0002C8, "Member 'UNode_Arrows_C::Left_Icmp_Arrow_Line' has a wrong offset!");
static_assert(offsetof(UNode_Arrows_C, Left_Icmp_Arrow_Start) == 0x0002D0, "Member 'UNode_Arrows_C::Left_Icmp_Arrow_Start' has a wrong offset!");
static_assert(offsetof(UNode_Arrows_C, Right_Act_Arrow_End) == 0x0002D8, "Member 'UNode_Arrows_C::Right_Act_Arrow_End' has a wrong offset!");
static_assert(offsetof(UNode_Arrows_C, Right_Act_Arrow_Line) == 0x0002E0, "Member 'UNode_Arrows_C::Right_Act_Arrow_Line' has a wrong offset!");
static_assert(offsetof(UNode_Arrows_C, Right_Act_Arrow_Start) == 0x0002E8, "Member 'UNode_Arrows_C::Right_Act_Arrow_Start' has a wrong offset!");
static_assert(offsetof(UNode_Arrows_C, Right_Cmp_Arrow_End) == 0x0002F0, "Member 'UNode_Arrows_C::Right_Cmp_Arrow_End' has a wrong offset!");
static_assert(offsetof(UNode_Arrows_C, Right_Cmp_Arrow_Line) == 0x0002F8, "Member 'UNode_Arrows_C::Right_Cmp_Arrow_Line' has a wrong offset!");
static_assert(offsetof(UNode_Arrows_C, Right_Cmp_Arrow_Start) == 0x000300, "Member 'UNode_Arrows_C::Right_Cmp_Arrow_Start' has a wrong offset!");
static_assert(offsetof(UNode_Arrows_C, Right_Icmp_Arrow_End) == 0x000308, "Member 'UNode_Arrows_C::Right_Icmp_Arrow_End' has a wrong offset!");
static_assert(offsetof(UNode_Arrows_C, Right_Icmp_Arrow_Line) == 0x000310, "Member 'UNode_Arrows_C::Right_Icmp_Arrow_Line' has a wrong offset!");
static_assert(offsetof(UNode_Arrows_C, Right_Icmp_Arrow_Start) == 0x000318, "Member 'UNode_Arrows_C::Right_Icmp_Arrow_Start' has a wrong offset!");
static_assert(offsetof(UNode_Arrows_C, SizeBoxSizeController) == 0x000320, "Member 'UNode_Arrows_C::SizeBoxSizeController' has a wrong offset!");
static_assert(offsetof(UNode_Arrows_C, WidgetSwitcherMinusArrowType) == 0x000328, "Member 'UNode_Arrows_C::WidgetSwitcherMinusArrowType' has a wrong offset!");
static_assert(offsetof(UNode_Arrows_C, ArrowIndex) == 0x000330, "Member 'UNode_Arrows_C::ArrowIndex' has a wrong offset!");
static_assert(offsetof(UNode_Arrows_C, OverrideColor) == 0x000338, "Member 'UNode_Arrows_C::OverrideColor' has a wrong offset!");
static_assert(offsetof(UNode_Arrows_C, UseOverrideColor) == 0x000360, "Member 'UNode_Arrows_C::UseOverrideColor' has a wrong offset!");

}

