#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Node

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass Node.Node_C
// 0x0040 (0x0270 - 0x0230)
class UNode_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0230(0x0008)(Transient, DuplicateTransient)
	class UImage*                                 Image_Item_Flare;                                  // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageHighContrast;                                 // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Active;                                        // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Complete;                                      // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_IncompleteQuest;                               // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        WidgetSwitcherMinusNodeSwitcher;                   // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         NodeIndex;                                         // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseHighContrastOnNode;                             // 0x026C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)

public:
	void ExecuteUbergraph_Node(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void SetHighContrastMode(bool ActivateHighContrast);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Node_C">();
	}
	static class UNode_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNode_C>();
	}
};
static_assert(alignof(UNode_C) == 0x000008, "Wrong alignment on UNode_C");
static_assert(sizeof(UNode_C) == 0x000270, "Wrong size on UNode_C");
static_assert(offsetof(UNode_C, UberGraphFrame) == 0x000230, "Member 'UNode_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UNode_C, Image_Item_Flare) == 0x000238, "Member 'UNode_C::Image_Item_Flare' has a wrong offset!");
static_assert(offsetof(UNode_C, ImageHighContrast) == 0x000240, "Member 'UNode_C::ImageHighContrast' has a wrong offset!");
static_assert(offsetof(UNode_C, Img_Active) == 0x000248, "Member 'UNode_C::Img_Active' has a wrong offset!");
static_assert(offsetof(UNode_C, Img_Complete) == 0x000250, "Member 'UNode_C::Img_Complete' has a wrong offset!");
static_assert(offsetof(UNode_C, Img_IncompleteQuest) == 0x000258, "Member 'UNode_C::Img_IncompleteQuest' has a wrong offset!");
static_assert(offsetof(UNode_C, WidgetSwitcherMinusNodeSwitcher) == 0x000260, "Member 'UNode_C::WidgetSwitcherMinusNodeSwitcher' has a wrong offset!");
static_assert(offsetof(UNode_C, NodeIndex) == 0x000268, "Member 'UNode_C::NodeIndex' has a wrong offset!");
static_assert(offsetof(UNode_C, UseHighContrastOnNode) == 0x00026C, "Member 'UNode_C::UseHighContrastOnNode' has a wrong offset!");

}

