#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuestPlayButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "FortniteGame_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass QuestPlayButton.QuestPlayButton_C
// 0x0020 (0x0258 - 0x0238)
class UQuestPlayButton_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(Transient, DuplicateTransient)
	class UIconTextButton_C*                      PlayButton;                                        // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFortQuestItem*                         QuestItem;                                         // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HACK_PlayerStateDirtyCounter;                      // 0x0250(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_QuestPlayButton(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Destruct();
	void OnPlayerStateChanged(const struct FFortTeamMemberInfo& PlayerInfo);
	void OnMatchmakingCompleted(EMatchmakingCompleteResult Result);
	void OnMatchmakingStarted();
	void ForceClick();
	void BndEvt__IconTextButton_K2Node_ComponentBoundEvent_21_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void Construct();
	void SetQuest(class UFortQuestItem* Quest);
	void AttemptNavigationToQuestObjective();
	void AttemptPlayQuest();
	bool CanNavigateToQuestObjective();
	void CanPlayQuest(bool* CanPlay);
	void SetPlayButtonEnable(bool Enable);
	void CalculateCritMissionDifficulty(float OverrideMin, float OverrideMax, float* OutDifficultyMin, float* OutDifficultyMax);
	void GetActiveTileType(EFortTheaterMapTileType* TileType);
	void UpdateQuestStatus(bool bInCanPlayQuest);
	void OnLobbyDisconnected();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"QuestPlayButton_C">();
	}
	static class UQuestPlayButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQuestPlayButton_C>();
	}
};
static_assert(alignof(UQuestPlayButton_C) == 0x000008, "Wrong alignment on UQuestPlayButton_C");
static_assert(sizeof(UQuestPlayButton_C) == 0x000258, "Wrong size on UQuestPlayButton_C");
static_assert(offsetof(UQuestPlayButton_C, UberGraphFrame) == 0x000238, "Member 'UQuestPlayButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UQuestPlayButton_C, PlayButton) == 0x000240, "Member 'UQuestPlayButton_C::PlayButton' has a wrong offset!");
static_assert(offsetof(UQuestPlayButton_C, QuestItem) == 0x000248, "Member 'UQuestPlayButton_C::QuestItem' has a wrong offset!");
static_assert(offsetof(UQuestPlayButton_C, HACK_PlayerStateDirtyCounter) == 0x000250, "Member 'UQuestPlayButton_C::HACK_PlayerStateDirtyCounter' has a wrong offset!");

}

