#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QuestPlayButton

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteUI_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function QuestPlayButton.QuestPlayButton_C.ExecuteUbergraph_QuestPlayButton
// 0x0280 (0x0280 - 0x0000)
struct QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable4;                               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable5;                               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable6;                               // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable7;                               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable8;                               // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable9;                               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable10;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortPartyState                               CallFunc_GetLocalPartyProgression_ReturnValue;     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButton*                          K2Node_ComponentBoundEvent_Button;                 // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortPartyState                               Temp_byte_Variable;                                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortMatchmakingContext*                CallFunc_GetContext_ReturnValue2;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Select_Default;                             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMatchmakingCompleteResult                    K2Node_CustomEvent_Result;                         // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(struct FFortTeamMemberInfo& PlayerInfo)> K2Node_CreateDelegate_OutputDelegate;              // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue3;                  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMatchmakingContext*                CallFunc_GetContext_ReturnValue4;                  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFortTeamMemberInfo                    K2Node_CustomEvent_PlayerInfo;                     // 0x0068(0x0190)(ConstParm)
	TDelegate<void(EMatchmakingCompleteResult Result)> K2Node_CreateDelegate_OutputDelegate2;             // 0x01F8(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate3;             // 0x0208(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate4;             // 0x0218(0x0010)(ZeroConstructor, NoDestructor)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0228(0x0034)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x025C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_264[0x4];                                      // 0x0264(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate5;             // 0x0268(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton) == 0x000008, "Wrong alignment on QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton");
static_assert(sizeof(QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton) == 0x000280, "Wrong size on QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton");
static_assert(offsetof(QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton, EntryPoint) == 0x000000, "Member 'QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton, Temp_bool_Variable) == 0x000004, "Member 'QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton, Temp_bool_Variable2) == 0x000005, "Member 'QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton, Temp_bool_Variable3) == 0x000006, "Member 'QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton, Temp_bool_Variable4) == 0x000007, "Member 'QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton, Temp_bool_Variable5) == 0x000008, "Member 'QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton::Temp_bool_Variable5' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton, Temp_bool_Variable6) == 0x000009, "Member 'QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton::Temp_bool_Variable6' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton, Temp_bool_Variable7) == 0x00000A, "Member 'QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton::Temp_bool_Variable7' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton, Temp_bool_Variable8) == 0x00000B, "Member 'QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton::Temp_bool_Variable8' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton, Temp_bool_Variable9) == 0x00000C, "Member 'QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton::Temp_bool_Variable9' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton, Temp_bool_Variable10) == 0x00000D, "Member 'QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton::Temp_bool_Variable10' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton, CallFunc_GetContext_ReturnValue) == 0x000010, "Member 'QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton, CallFunc_GetLocalPartyProgression_ReturnValue) == 0x000018, "Member 'QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton::CallFunc_GetLocalPartyProgression_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton, K2Node_ComponentBoundEvent_Button) == 0x000020, "Member 'QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton, Temp_byte_Variable) == 0x000028, "Member 'QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton, CallFunc_GetContext_ReturnValue2) == 0x000030, "Member 'QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton, K2Node_Select_Default) == 0x000038, "Member 'QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton, K2Node_CustomEvent_Result) == 0x000039, "Member 'QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton::K2Node_CustomEvent_Result' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton, K2Node_SwitchEnum_CmpSuccess) == 0x00003A, "Member 'QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton, K2Node_CreateDelegate_OutputDelegate) == 0x000040, "Member 'QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton, CallFunc_GetContext_ReturnValue3) == 0x000050, "Member 'QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton, CallFunc_GetUINavigationManager_ReturnValue) == 0x000058, "Member 'QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton, CallFunc_GetContext_ReturnValue4) == 0x000060, "Member 'QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton::CallFunc_GetContext_ReturnValue4' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton, K2Node_CustomEvent_PlayerInfo) == 0x000068, "Member 'QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton::K2Node_CustomEvent_PlayerInfo' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton, K2Node_CreateDelegate_OutputDelegate2) == 0x0001F8, "Member 'QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton::K2Node_CreateDelegate_OutputDelegate2' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton, K2Node_CreateDelegate_OutputDelegate3) == 0x000208, "Member 'QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton::K2Node_CreateDelegate_OutputDelegate3' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton, K2Node_CreateDelegate_OutputDelegate4) == 0x000218, "Member 'QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton::K2Node_CreateDelegate_OutputDelegate4' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton, K2Node_Event_MyGeometry) == 0x000228, "Member 'QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton, K2Node_Event_InDeltaTime) == 0x00025C, "Member 'QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton, CallFunc_Add_IntInt_ReturnValue) == 0x000260, "Member 'QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton, K2Node_CreateDelegate_OutputDelegate5) == 0x000268, "Member 'QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton::K2Node_CreateDelegate_OutputDelegate5' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton, CallFunc_Greater_IntInt_ReturnValue) == 0x000278, "Member 'QuestPlayButton_C_ExecuteUbergraph_QuestPlayButton::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

// Function QuestPlayButton.QuestPlayButton_C.Tick
// 0x0038 (0x0038 - 0x0000)
struct QuestPlayButton_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0034)(Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0034(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestPlayButton_C_Tick) == 0x000004, "Wrong alignment on QuestPlayButton_C_Tick");
static_assert(sizeof(QuestPlayButton_C_Tick) == 0x000038, "Wrong size on QuestPlayButton_C_Tick");
static_assert(offsetof(QuestPlayButton_C_Tick, MyGeometry) == 0x000000, "Member 'QuestPlayButton_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_Tick, InDeltaTime) == 0x000034, "Member 'QuestPlayButton_C_Tick::InDeltaTime' has a wrong offset!");

// Function QuestPlayButton.QuestPlayButton_C.OnPlayerStateChanged
// 0x0190 (0x0190 - 0x0000)
struct QuestPlayButton_C_OnPlayerStateChanged final
{
public:
	struct FFortTeamMemberInfo                    PlayerInfo;                                        // 0x0000(0x0190)(ConstParm, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(QuestPlayButton_C_OnPlayerStateChanged) == 0x000008, "Wrong alignment on QuestPlayButton_C_OnPlayerStateChanged");
static_assert(sizeof(QuestPlayButton_C_OnPlayerStateChanged) == 0x000190, "Wrong size on QuestPlayButton_C_OnPlayerStateChanged");
static_assert(offsetof(QuestPlayButton_C_OnPlayerStateChanged, PlayerInfo) == 0x000000, "Member 'QuestPlayButton_C_OnPlayerStateChanged::PlayerInfo' has a wrong offset!");

// Function QuestPlayButton.QuestPlayButton_C.OnMatchmakingCompleted
// 0x0001 (0x0001 - 0x0000)
struct QuestPlayButton_C_OnMatchmakingCompleted final
{
public:
	EMatchmakingCompleteResult                    Result;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(QuestPlayButton_C_OnMatchmakingCompleted) == 0x000001, "Wrong alignment on QuestPlayButton_C_OnMatchmakingCompleted");
static_assert(sizeof(QuestPlayButton_C_OnMatchmakingCompleted) == 0x000001, "Wrong size on QuestPlayButton_C_OnMatchmakingCompleted");
static_assert(offsetof(QuestPlayButton_C_OnMatchmakingCompleted, Result) == 0x000000, "Member 'QuestPlayButton_C_OnMatchmakingCompleted::Result' has a wrong offset!");

// Function QuestPlayButton.QuestPlayButton_C.BndEvt__IconTextButton_K2Node_ComponentBoundEvent_21_CommonButtonClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct QuestPlayButton_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_21_CommonButtonClicked__DelegateSignature final
{
public:
	class UCommonButton*                          Button;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestPlayButton_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_21_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong alignment on QuestPlayButton_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_21_CommonButtonClicked__DelegateSignature");
static_assert(sizeof(QuestPlayButton_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_21_CommonButtonClicked__DelegateSignature) == 0x000008, "Wrong size on QuestPlayButton_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_21_CommonButtonClicked__DelegateSignature");
static_assert(offsetof(QuestPlayButton_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_21_CommonButtonClicked__DelegateSignature, Button) == 0x000000, "Member 'QuestPlayButton_C_BndEvt__IconTextButton_K2Node_ComponentBoundEvent_21_CommonButtonClicked__DelegateSignature::Button' has a wrong offset!");

// Function QuestPlayButton.QuestPlayButton_C.SetQuest
// 0x0028 (0x0028 - 0x0000)
struct QuestPlayButton_C_SetQuest final
{
public:
	class UFortQuestItem*                         Quest;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortPartyState                               Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable4;                               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable5;                               // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable6;                               // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable7;                               // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable8;                               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable9;                               // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable10;                              // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortPartyState                               CallFunc_GetLocalPartyProgression_ReturnValue;     // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default;                             // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(QuestPlayButton_C_SetQuest) == 0x000008, "Wrong alignment on QuestPlayButton_C_SetQuest");
static_assert(sizeof(QuestPlayButton_C_SetQuest) == 0x000028, "Wrong size on QuestPlayButton_C_SetQuest");
static_assert(offsetof(QuestPlayButton_C_SetQuest, Quest) == 0x000000, "Member 'QuestPlayButton_C_SetQuest::Quest' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_SetQuest, Temp_byte_Variable) == 0x000008, "Member 'QuestPlayButton_C_SetQuest::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_SetQuest, Temp_bool_Variable) == 0x000009, "Member 'QuestPlayButton_C_SetQuest::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_SetQuest, Temp_bool_Variable2) == 0x00000A, "Member 'QuestPlayButton_C_SetQuest::Temp_bool_Variable2' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_SetQuest, Temp_bool_Variable3) == 0x00000B, "Member 'QuestPlayButton_C_SetQuest::Temp_bool_Variable3' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_SetQuest, Temp_bool_Variable4) == 0x00000C, "Member 'QuestPlayButton_C_SetQuest::Temp_bool_Variable4' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_SetQuest, Temp_bool_Variable5) == 0x00000D, "Member 'QuestPlayButton_C_SetQuest::Temp_bool_Variable5' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_SetQuest, Temp_bool_Variable6) == 0x00000E, "Member 'QuestPlayButton_C_SetQuest::Temp_bool_Variable6' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_SetQuest, Temp_bool_Variable7) == 0x00000F, "Member 'QuestPlayButton_C_SetQuest::Temp_bool_Variable7' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_SetQuest, Temp_bool_Variable8) == 0x000010, "Member 'QuestPlayButton_C_SetQuest::Temp_bool_Variable8' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_SetQuest, Temp_bool_Variable9) == 0x000011, "Member 'QuestPlayButton_C_SetQuest::Temp_bool_Variable9' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_SetQuest, Temp_bool_Variable10) == 0x000012, "Member 'QuestPlayButton_C_SetQuest::Temp_bool_Variable10' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_SetQuest, CallFunc_GetContext_ReturnValue) == 0x000018, "Member 'QuestPlayButton_C_SetQuest::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_SetQuest, CallFunc_GetLocalPartyProgression_ReturnValue) == 0x000020, "Member 'QuestPlayButton_C_SetQuest::CallFunc_GetLocalPartyProgression_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_SetQuest, K2Node_Select_Default) == 0x000021, "Member 'QuestPlayButton_C_SetQuest::K2Node_Select_Default' has a wrong offset!");

// Function QuestPlayButton.QuestPlayButton_C.AttemptNavigationToQuestObjective
// 0x0008 (0x0008 - 0x0000)
struct QuestPlayButton_C_AttemptNavigationToQuestObjective final
{
public:
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestPlayButton_C_AttemptNavigationToQuestObjective) == 0x000008, "Wrong alignment on QuestPlayButton_C_AttemptNavigationToQuestObjective");
static_assert(sizeof(QuestPlayButton_C_AttemptNavigationToQuestObjective) == 0x000008, "Wrong size on QuestPlayButton_C_AttemptNavigationToQuestObjective");
static_assert(offsetof(QuestPlayButton_C_AttemptNavigationToQuestObjective, CallFunc_GetUINavigationManager_ReturnValue) == 0x000000, "Member 'QuestPlayButton_C_AttemptNavigationToQuestObjective::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");

// Function QuestPlayButton.QuestPlayButton_C.AttemptPlayQuest
// 0x0070 (0x0070 - 0x0000)
struct QuestPlayButton_C_AttemptPlayQuest final
{
public:
	float                                         CritMissionDifficultyOverrideMax;                  // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CritMissionDifficultyOverrideMin;                  // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortTheaterMapTileType                       CallFunc_GetActiveTileType_TileType;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalculateCritMissionDifficulty_OutDifficultyMin; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_CalculateCritMissionDifficulty_OutDifficultyMax; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue2;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalPlayerPartyLeader_ReturnValue;     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue3;                  // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMatchmakingContext*                CallFunc_GetContext_ReturnValue4;                  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMatchmakingContext*                CallFunc_GetContext_ReturnValue5;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMatchmakingContext*                CallFunc_GetContext_ReturnValue6;                  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortMatchmakingContext*                CallFunc_GetContext_ReturnValue7;                  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectTileForQuest_OutCriticalMissionDifficultyOverrideMin; // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SelectTileForQuest_OutCriticalMissionDifficultyOverrideMax; // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SelectTileForQuest_ReturnValue;           // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(QuestPlayButton_C_AttemptPlayQuest) == 0x000008, "Wrong alignment on QuestPlayButton_C_AttemptPlayQuest");
static_assert(sizeof(QuestPlayButton_C_AttemptPlayQuest) == 0x000070, "Wrong size on QuestPlayButton_C_AttemptPlayQuest");
static_assert(offsetof(QuestPlayButton_C_AttemptPlayQuest, CritMissionDifficultyOverrideMax) == 0x000000, "Member 'QuestPlayButton_C_AttemptPlayQuest::CritMissionDifficultyOverrideMax' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_AttemptPlayQuest, CritMissionDifficultyOverrideMin) == 0x000004, "Member 'QuestPlayButton_C_AttemptPlayQuest::CritMissionDifficultyOverrideMin' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_AttemptPlayQuest, CallFunc_GetActiveTileType_TileType) == 0x000008, "Member 'QuestPlayButton_C_AttemptPlayQuest::CallFunc_GetActiveTileType_TileType' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_AttemptPlayQuest, K2Node_SwitchEnum_CmpSuccess) == 0x000009, "Member 'QuestPlayButton_C_AttemptPlayQuest::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_AttemptPlayQuest, CallFunc_GetUINavigationManager_ReturnValue) == 0x000010, "Member 'QuestPlayButton_C_AttemptPlayQuest::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_AttemptPlayQuest, CallFunc_CalculateCritMissionDifficulty_OutDifficultyMin) == 0x000018, "Member 'QuestPlayButton_C_AttemptPlayQuest::CallFunc_CalculateCritMissionDifficulty_OutDifficultyMin' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_AttemptPlayQuest, CallFunc_CalculateCritMissionDifficulty_OutDifficultyMax) == 0x00001C, "Member 'QuestPlayButton_C_AttemptPlayQuest::CallFunc_CalculateCritMissionDifficulty_OutDifficultyMax' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_AttemptPlayQuest, CallFunc_GetContext_ReturnValue) == 0x000020, "Member 'QuestPlayButton_C_AttemptPlayQuest::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_AttemptPlayQuest, CallFunc_GetContext_ReturnValue2) == 0x000028, "Member 'QuestPlayButton_C_AttemptPlayQuest::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_AttemptPlayQuest, CallFunc_IsLocalPlayerPartyLeader_ReturnValue) == 0x000030, "Member 'QuestPlayButton_C_AttemptPlayQuest::CallFunc_IsLocalPlayerPartyLeader_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_AttemptPlayQuest, CallFunc_GetContext_ReturnValue3) == 0x000038, "Member 'QuestPlayButton_C_AttemptPlayQuest::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_AttemptPlayQuest, CallFunc_GetContext_ReturnValue4) == 0x000040, "Member 'QuestPlayButton_C_AttemptPlayQuest::CallFunc_GetContext_ReturnValue4' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_AttemptPlayQuest, CallFunc_GetContext_ReturnValue5) == 0x000048, "Member 'QuestPlayButton_C_AttemptPlayQuest::CallFunc_GetContext_ReturnValue5' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_AttemptPlayQuest, CallFunc_GetContext_ReturnValue6) == 0x000050, "Member 'QuestPlayButton_C_AttemptPlayQuest::CallFunc_GetContext_ReturnValue6' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_AttemptPlayQuest, CallFunc_GetContext_ReturnValue7) == 0x000058, "Member 'QuestPlayButton_C_AttemptPlayQuest::CallFunc_GetContext_ReturnValue7' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_AttemptPlayQuest, CallFunc_SelectTileForQuest_OutCriticalMissionDifficultyOverrideMin) == 0x000060, "Member 'QuestPlayButton_C_AttemptPlayQuest::CallFunc_SelectTileForQuest_OutCriticalMissionDifficultyOverrideMin' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_AttemptPlayQuest, CallFunc_SelectTileForQuest_OutCriticalMissionDifficultyOverrideMax) == 0x000064, "Member 'QuestPlayButton_C_AttemptPlayQuest::CallFunc_SelectTileForQuest_OutCriticalMissionDifficultyOverrideMax' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_AttemptPlayQuest, CallFunc_SelectTileForQuest_ReturnValue) == 0x000068, "Member 'QuestPlayButton_C_AttemptPlayQuest::CallFunc_SelectTileForQuest_ReturnValue' has a wrong offset!");

// Function QuestPlayButton.QuestPlayButton_C.CanNavigateToQuestObjective
// 0x0018 (0x0018 - 0x0000)
struct QuestPlayButton_C_CanNavigateToQuestObjective final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortUINavigationManager*               CallFunc_GetUINavigationManager_ReturnValue;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanNavigateToQuestObjective_ReturnValue;  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(QuestPlayButton_C_CanNavigateToQuestObjective) == 0x000008, "Wrong alignment on QuestPlayButton_C_CanNavigateToQuestObjective");
static_assert(sizeof(QuestPlayButton_C_CanNavigateToQuestObjective) == 0x000018, "Wrong size on QuestPlayButton_C_CanNavigateToQuestObjective");
static_assert(offsetof(QuestPlayButton_C_CanNavigateToQuestObjective, ReturnValue) == 0x000000, "Member 'QuestPlayButton_C_CanNavigateToQuestObjective::ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_CanNavigateToQuestObjective, CallFunc_GetUINavigationManager_ReturnValue) == 0x000008, "Member 'QuestPlayButton_C_CanNavigateToQuestObjective::CallFunc_GetUINavigationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_CanNavigateToQuestObjective, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'QuestPlayButton_C_CanNavigateToQuestObjective::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_CanNavigateToQuestObjective, CallFunc_CanNavigateToQuestObjective_ReturnValue) == 0x000011, "Member 'QuestPlayButton_C_CanNavigateToQuestObjective::CallFunc_CanNavigateToQuestObjective_ReturnValue' has a wrong offset!");

// Function QuestPlayButton.QuestPlayButton_C.CanPlayQuest
// 0x0140 (0x0140 - 0x0000)
struct QuestPlayButton_C_CanPlayQuest final
{
public:
	bool                                          CanPlay;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bQuestAllowsTileMatching;                          // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsEntirePartyInFrontend;                          // 0x0002(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsPartyLeader;                                    // 0x0003(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsInFrontEnd;                                     // 0x0004(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsQuestActive;                                    // 0x0005(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bCanFindTileForQuest;                              // 0x0006(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue2;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInZone_ReturnValue;                     // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue;            // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortQuestItemDefinition*               CallFunc_GetQuestDefinitionBP_ReturnValue;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue4;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AllowsTileMatching_ReturnValue;           // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue3;                  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEntirePartyInFrontEnd_ReturnValue;      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue2;           // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue2;               // 0x0078(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue3;           // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue3;               // 0x0098(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue4;           // 0x00B0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue4;               // 0x00C0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue5;           // 0x00D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue5;               // 0x00E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue5;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsQuestInProgress_ReturnValue;            // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue3;                  // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanFindTileForQuest_ReturnValue;          // 0x00FB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue4;                  // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue5;                  // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FE[0x2];                                       // 0x00FE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_BoolToString_ReturnValue6;           // 0x0100(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue6;               // 0x0110(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UFortPartyContext*                      CallFunc_GetContext_ReturnValue4;                  // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue6;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocalPlayerPartyLeader_ReturnValue;     // 0x0129(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12A[0x6];                                      // 0x012A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue5;                  // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMobileApp_ReturnValue;                  // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(QuestPlayButton_C_CanPlayQuest) == 0x000008, "Wrong alignment on QuestPlayButton_C_CanPlayQuest");
static_assert(sizeof(QuestPlayButton_C_CanPlayQuest) == 0x000140, "Wrong size on QuestPlayButton_C_CanPlayQuest");
static_assert(offsetof(QuestPlayButton_C_CanPlayQuest, CanPlay) == 0x000000, "Member 'QuestPlayButton_C_CanPlayQuest::CanPlay' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_CanPlayQuest, bQuestAllowsTileMatching) == 0x000001, "Member 'QuestPlayButton_C_CanPlayQuest::bQuestAllowsTileMatching' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_CanPlayQuest, bIsEntirePartyInFrontend) == 0x000002, "Member 'QuestPlayButton_C_CanPlayQuest::bIsEntirePartyInFrontend' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_CanPlayQuest, bIsPartyLeader) == 0x000003, "Member 'QuestPlayButton_C_CanPlayQuest::bIsPartyLeader' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_CanPlayQuest, bIsInFrontEnd) == 0x000004, "Member 'QuestPlayButton_C_CanPlayQuest::bIsInFrontEnd' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_CanPlayQuest, bIsQuestActive) == 0x000005, "Member 'QuestPlayButton_C_CanPlayQuest::bIsQuestActive' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_CanPlayQuest, bCanFindTileForQuest) == 0x000006, "Member 'QuestPlayButton_C_CanPlayQuest::bCanFindTileForQuest' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_CanPlayQuest, CallFunc_GetContext_ReturnValue) == 0x000008, "Member 'QuestPlayButton_C_CanPlayQuest::CallFunc_GetContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_CanPlayQuest, CallFunc_GetContext_ReturnValue2) == 0x000010, "Member 'QuestPlayButton_C_CanPlayQuest::CallFunc_GetContext_ReturnValue2' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_CanPlayQuest, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'QuestPlayButton_C_CanPlayQuest::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_CanPlayQuest, CallFunc_IsValid_ReturnValue2) == 0x000019, "Member 'QuestPlayButton_C_CanPlayQuest::CallFunc_IsValid_ReturnValue2' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_CanPlayQuest, CallFunc_IsInZone_ReturnValue) == 0x00001A, "Member 'QuestPlayButton_C_CanPlayQuest::CallFunc_IsInZone_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_CanPlayQuest, CallFunc_Not_PreBool_ReturnValue) == 0x00001B, "Member 'QuestPlayButton_C_CanPlayQuest::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_CanPlayQuest, CallFunc_Conv_BoolToString_ReturnValue) == 0x000020, "Member 'QuestPlayButton_C_CanPlayQuest::CallFunc_Conv_BoolToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_CanPlayQuest, CallFunc_Concat_StrStr_ReturnValue) == 0x000030, "Member 'QuestPlayButton_C_CanPlayQuest::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_CanPlayQuest, CallFunc_IsValid_ReturnValue3) == 0x000040, "Member 'QuestPlayButton_C_CanPlayQuest::CallFunc_IsValid_ReturnValue3' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_CanPlayQuest, CallFunc_GetQuestDefinitionBP_ReturnValue) == 0x000048, "Member 'QuestPlayButton_C_CanPlayQuest::CallFunc_GetQuestDefinitionBP_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_CanPlayQuest, CallFunc_IsValid_ReturnValue4) == 0x000050, "Member 'QuestPlayButton_C_CanPlayQuest::CallFunc_IsValid_ReturnValue4' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_CanPlayQuest, CallFunc_AllowsTileMatching_ReturnValue) == 0x000051, "Member 'QuestPlayButton_C_CanPlayQuest::CallFunc_AllowsTileMatching_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_CanPlayQuest, CallFunc_GetContext_ReturnValue3) == 0x000058, "Member 'QuestPlayButton_C_CanPlayQuest::CallFunc_GetContext_ReturnValue3' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_CanPlayQuest, CallFunc_IsEntirePartyInFrontEnd_ReturnValue) == 0x000060, "Member 'QuestPlayButton_C_CanPlayQuest::CallFunc_IsEntirePartyInFrontEnd_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_CanPlayQuest, CallFunc_Conv_BoolToString_ReturnValue2) == 0x000068, "Member 'QuestPlayButton_C_CanPlayQuest::CallFunc_Conv_BoolToString_ReturnValue2' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_CanPlayQuest, CallFunc_Concat_StrStr_ReturnValue2) == 0x000078, "Member 'QuestPlayButton_C_CanPlayQuest::CallFunc_Concat_StrStr_ReturnValue2' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_CanPlayQuest, CallFunc_Conv_BoolToString_ReturnValue3) == 0x000088, "Member 'QuestPlayButton_C_CanPlayQuest::CallFunc_Conv_BoolToString_ReturnValue3' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_CanPlayQuest, CallFunc_Concat_StrStr_ReturnValue3) == 0x000098, "Member 'QuestPlayButton_C_CanPlayQuest::CallFunc_Concat_StrStr_ReturnValue3' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_CanPlayQuest, CallFunc_BooleanAND_ReturnValue) == 0x0000A8, "Member 'QuestPlayButton_C_CanPlayQuest::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_CanPlayQuest, CallFunc_Conv_BoolToString_ReturnValue4) == 0x0000B0, "Member 'QuestPlayButton_C_CanPlayQuest::CallFunc_Conv_BoolToString_ReturnValue4' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_CanPlayQuest, CallFunc_Concat_StrStr_ReturnValue4) == 0x0000C0, "Member 'QuestPlayButton_C_CanPlayQuest::CallFunc_Concat_StrStr_ReturnValue4' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_CanPlayQuest, CallFunc_BooleanAND_ReturnValue2) == 0x0000D0, "Member 'QuestPlayButton_C_CanPlayQuest::CallFunc_BooleanAND_ReturnValue2' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_CanPlayQuest, CallFunc_Conv_BoolToString_ReturnValue5) == 0x0000D8, "Member 'QuestPlayButton_C_CanPlayQuest::CallFunc_Conv_BoolToString_ReturnValue5' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_CanPlayQuest, CallFunc_Concat_StrStr_ReturnValue5) == 0x0000E8, "Member 'QuestPlayButton_C_CanPlayQuest::CallFunc_Concat_StrStr_ReturnValue5' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_CanPlayQuest, CallFunc_IsValid_ReturnValue5) == 0x0000F8, "Member 'QuestPlayButton_C_CanPlayQuest::CallFunc_IsValid_ReturnValue5' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_CanPlayQuest, CallFunc_IsQuestInProgress_ReturnValue) == 0x0000F9, "Member 'QuestPlayButton_C_CanPlayQuest::CallFunc_IsQuestInProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_CanPlayQuest, CallFunc_BooleanAND_ReturnValue3) == 0x0000FA, "Member 'QuestPlayButton_C_CanPlayQuest::CallFunc_BooleanAND_ReturnValue3' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_CanPlayQuest, CallFunc_CanFindTileForQuest_ReturnValue) == 0x0000FB, "Member 'QuestPlayButton_C_CanPlayQuest::CallFunc_CanFindTileForQuest_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_CanPlayQuest, CallFunc_BooleanAND_ReturnValue4) == 0x0000FC, "Member 'QuestPlayButton_C_CanPlayQuest::CallFunc_BooleanAND_ReturnValue4' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_CanPlayQuest, CallFunc_BooleanAND_ReturnValue5) == 0x0000FD, "Member 'QuestPlayButton_C_CanPlayQuest::CallFunc_BooleanAND_ReturnValue5' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_CanPlayQuest, CallFunc_Conv_BoolToString_ReturnValue6) == 0x000100, "Member 'QuestPlayButton_C_CanPlayQuest::CallFunc_Conv_BoolToString_ReturnValue6' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_CanPlayQuest, CallFunc_Concat_StrStr_ReturnValue6) == 0x000110, "Member 'QuestPlayButton_C_CanPlayQuest::CallFunc_Concat_StrStr_ReturnValue6' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_CanPlayQuest, CallFunc_GetContext_ReturnValue4) == 0x000120, "Member 'QuestPlayButton_C_CanPlayQuest::CallFunc_GetContext_ReturnValue4' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_CanPlayQuest, CallFunc_IsValid_ReturnValue6) == 0x000128, "Member 'QuestPlayButton_C_CanPlayQuest::CallFunc_IsValid_ReturnValue6' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_CanPlayQuest, CallFunc_IsLocalPlayerPartyLeader_ReturnValue) == 0x000129, "Member 'QuestPlayButton_C_CanPlayQuest::CallFunc_IsLocalPlayerPartyLeader_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_CanPlayQuest, CallFunc_GetContext_ReturnValue5) == 0x000130, "Member 'QuestPlayButton_C_CanPlayQuest::CallFunc_GetContext_ReturnValue5' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_CanPlayQuest, CallFunc_IsMobileApp_ReturnValue) == 0x000138, "Member 'QuestPlayButton_C_CanPlayQuest::CallFunc_IsMobileApp_ReturnValue' has a wrong offset!");

// Function QuestPlayButton.QuestPlayButton_C.SetPlayButtonEnable
// 0x0005 (0x0005 - 0x0000)
struct QuestPlayButton_C_SetPlayButtonEnable final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bCanPlayQuest;                                     // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanNavigateToQuestObjective_ReturnValue;  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CanPlayQuest_CanPlay;                     // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(QuestPlayButton_C_SetPlayButtonEnable) == 0x000001, "Wrong alignment on QuestPlayButton_C_SetPlayButtonEnable");
static_assert(sizeof(QuestPlayButton_C_SetPlayButtonEnable) == 0x000005, "Wrong size on QuestPlayButton_C_SetPlayButtonEnable");
static_assert(offsetof(QuestPlayButton_C_SetPlayButtonEnable, Enable) == 0x000000, "Member 'QuestPlayButton_C_SetPlayButtonEnable::Enable' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_SetPlayButtonEnable, bCanPlayQuest) == 0x000001, "Member 'QuestPlayButton_C_SetPlayButtonEnable::bCanPlayQuest' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_SetPlayButtonEnable, CallFunc_CanNavigateToQuestObjective_ReturnValue) == 0x000002, "Member 'QuestPlayButton_C_SetPlayButtonEnable::CallFunc_CanNavigateToQuestObjective_ReturnValue' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_SetPlayButtonEnable, CallFunc_CanPlayQuest_CanPlay) == 0x000003, "Member 'QuestPlayButton_C_SetPlayButtonEnable::CallFunc_CanPlayQuest_CanPlay' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_SetPlayButtonEnable, CallFunc_BooleanOR_ReturnValue) == 0x000004, "Member 'QuestPlayButton_C_SetPlayButtonEnable::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function QuestPlayButton.QuestPlayButton_C.CalculateCritMissionDifficulty
// 0x00C8 (0x00C8 - 0x0000)
struct QuestPlayButton_C_CalculateCritMissionDifficulty final
{
public:
	float                                         OverrideMin;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OverrideMax;                                       // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OutDifficultyMin;                                  // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OutDifficultyMax;                                  // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable;                               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue2;          // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortFrontEndContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGameDifficultyInfo>            CallFunc_GetAvailableDifficulties_ReturnValue;     // 0x0020(0x0010)(ZeroConstructor, ReferenceParm)
	float                                         K2Node_Select_Default;                             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameDifficultyInfo                    CallFunc_Array_Get_Item;                           // 0x0038(0x0080)()
	float                                         CallFunc_GetMatchmakingDifficultyRangeFromDifficultyInfo_OutMinDifficulty; // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMatchmakingDifficultyRangeFromDifficultyInfo_OutMaxDifficulty; // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Select2_Default;                            // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(QuestPlayButton_C_CalculateCritMissionDifficulty) == 0x000008, "Wrong alignment on QuestPlayButton_C_CalculateCritMissionDifficulty");
static_assert(sizeof(QuestPlayButton_C_CalculateCritMissionDifficulty) == 0x0000C8, "Wrong size on QuestPlayButton_C_CalculateCritMissionDifficulty");
static_assert(offsetof(QuestPlayButton_C_CalculateCritMissionDifficulty, OverrideMin) == 0x000000, "Member 'QuestPlayButton_C_CalculateCritMissionDifficulty::OverrideMin' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_CalculateCritMissionDifficulty, OverrideMax) == 0x000004, "Member 'QuestPlayButton_C_CalculateCritMissionDifficulty::OverrideMax' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_CalculateCritMissionDifficulty, OutDifficultyMin) == 0x000008, "Member 'QuestPlayButton_C_CalculateCritMissionDifficulty::OutDifficultyMin' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_CalculateCritMissionDifficulty, OutDifficultyMax) == 0x00000C, "Member 'QuestPlayButton_C_CalculateCritMissionDifficulty::OutDifficultyMax' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_CalculateCritMissionDifficulty, Temp_float_Variable) == 0x000010, "Member 'QuestPlayButton_C_CalculateCritMissionDifficulty::Temp_float_Variable' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_CalculateCritMissionDifficulty, Temp_bool_Variable) == 0x000014, "Member 'QuestPlayButton_C_CalculateCritMissionDifficulty::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(QuestPlayButton_C_CalculateCritMissionDifficulty, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000015, "Member 'QuestPlayButton_C_CalculateCritMissionDifficulty::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
