#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SK_M_Med_Soldier_04_Skeleton_AnimBP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteGame_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass SK_M_Med_Soldier_04_Skeleton_AnimBP.SK_M_Med_Soldier_04_Skeleton_AnimBP_C
// 0x1728 (0x1B38 - 0x0410)
class USK_M_Med_Soldier_04_Skeleton_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0410(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_78EB935A430054ADF5E2E89005D9D000; // 0x0418(0x0048)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_5B5C2BC342A9E2373684A581DE190146; // 0x0460(0x0268)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_58B7F723420BD05107F77090484DA4F7; // 0x06C8(0x0268)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_B614050A427F32E2A71520A396D4981D; // 0x0930(0x0268)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_D4E756144665125C57D74F847DF5CAE2; // 0x0B98(0x0268)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_D3F10A774DCEBBC7CF6FACA843FAA56D; // 0x0E00(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_F50D097B4AF8FD409EBDB7A56995EB71; // 0x0E48(0x0048)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_5984D2B3487D5E3495C1419E61FA91AE; // 0x0E90(0x0098)(ContainsInstancedReference)
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_AF49CEBA41A86A5239B445ACCA2A35D2; // 0x0F28(0x0268)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_E019B8DC42D4A76813488292D50D4442; // 0x1190(0x0268)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_53B6F76442E1E5367E83198574A7E337; // 0x13F8(0x0268)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_3B49A128489AAE9305B9BEACDF5446C4; // 0x1660(0x0268)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_01F0D350476ED069A3D9B380171159E1; // 0x18C8(0x0268)()
	class USkeletalMeshComponent*                 MeshToCopy;                                        // 0x1B30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SK_M_Med_Soldier_04_Skeleton_AnimBP(int32 EntryPoint);
	void BlueprintInitializeAnimation();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_M_Med_Soldier_04_Skeleton_AnimBP_AnimGraphNode_AnimDynamics_3B49A128489AAE9305B9BEACDF5446C4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_M_Med_Soldier_04_Skeleton_AnimBP_AnimGraphNode_CopyPoseFromMesh_5984D2B3487D5E3495C1419E61FA91AE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_M_Med_Soldier_04_Skeleton_AnimBP_AnimGraphNode_AnimDynamics_AF49CEBA41A86A5239B445ACCA2A35D2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_M_Med_Soldier_04_Skeleton_AnimBP_AnimGraphNode_AnimDynamics_E019B8DC42D4A76813488292D50D4442();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_M_Med_Soldier_04_Skeleton_AnimBP_AnimGraphNode_AnimDynamics_53B6F76442E1E5367E83198574A7E337();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SK_M_Med_Soldier_04_Skeleton_AnimBP_C">();
	}
	static class USK_M_Med_Soldier_04_Skeleton_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USK_M_Med_Soldier_04_Skeleton_AnimBP_C>();
	}
};
static_assert(alignof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C) == 0x000008, "Wrong alignment on USK_M_Med_Soldier_04_Skeleton_AnimBP_C");
static_assert(sizeof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C) == 0x001B38, "Wrong size on USK_M_Med_Soldier_04_Skeleton_AnimBP_C");
static_assert(offsetof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C, UberGraphFrame) == 0x000410, "Member 'USK_M_Med_Soldier_04_Skeleton_AnimBP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C, AnimGraphNode_Root_78EB935A430054ADF5E2E89005D9D000) == 0x000418, "Member 'USK_M_Med_Soldier_04_Skeleton_AnimBP_C::AnimGraphNode_Root_78EB935A430054ADF5E2E89005D9D000' has a wrong offset!");
static_assert(offsetof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C, AnimGraphNode_AnimDynamics_5B5C2BC342A9E2373684A581DE190146) == 0x000460, "Member 'USK_M_Med_Soldier_04_Skeleton_AnimBP_C::AnimGraphNode_AnimDynamics_5B5C2BC342A9E2373684A581DE190146' has a wrong offset!");
static_assert(offsetof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C, AnimGraphNode_AnimDynamics_58B7F723420BD05107F77090484DA4F7) == 0x0006C8, "Member 'USK_M_Med_Soldier_04_Skeleton_AnimBP_C::AnimGraphNode_AnimDynamics_58B7F723420BD05107F77090484DA4F7' has a wrong offset!");
static_assert(offsetof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C, AnimGraphNode_AnimDynamics_B614050A427F32E2A71520A396D4981D) == 0x000930, "Member 'USK_M_Med_Soldier_04_Skeleton_AnimBP_C::AnimGraphNode_AnimDynamics_B614050A427F32E2A71520A396D4981D' has a wrong offset!");
static_assert(offsetof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C, AnimGraphNode_AnimDynamics_D4E756144665125C57D74F847DF5CAE2) == 0x000B98, "Member 'USK_M_Med_Soldier_04_Skeleton_AnimBP_C::AnimGraphNode_AnimDynamics_D4E756144665125C57D74F847DF5CAE2' has a wrong offset!");
static_assert(offsetof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C, AnimGraphNode_LocalToComponentSpace_D3F10A774DCEBBC7CF6FACA843FAA56D) == 0x000E00, "Member 'USK_M_Med_Soldier_04_Skeleton_AnimBP_C::AnimGraphNode_LocalToComponentSpace_D3F10A774DCEBBC7CF6FACA843FAA56D' has a wrong offset!");
static_assert(offsetof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C, AnimGraphNode_ComponentToLocalSpace_F50D097B4AF8FD409EBDB7A56995EB71) == 0x000E48, "Member 'USK_M_Med_Soldier_04_Skeleton_AnimBP_C::AnimGraphNode_ComponentToLocalSpace_F50D097B4AF8FD409EBDB7A56995EB71' has a wrong offset!");
static_assert(offsetof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C, AnimGraphNode_CopyPoseFromMesh_5984D2B3487D5E3495C1419E61FA91AE) == 0x000E90, "Member 'USK_M_Med_Soldier_04_Skeleton_AnimBP_C::AnimGraphNode_CopyPoseFromMesh_5984D2B3487D5E3495C1419E61FA91AE' has a wrong offset!");
static_assert(offsetof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C, AnimGraphNode_AnimDynamics_AF49CEBA41A86A5239B445ACCA2A35D2) == 0x000F28, "Member 'USK_M_Med_Soldier_04_Skeleton_AnimBP_C::AnimGraphNode_AnimDynamics_AF49CEBA41A86A5239B445ACCA2A35D2' has a wrong offset!");
static_assert(offsetof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C, AnimGraphNode_AnimDynamics_E019B8DC42D4A76813488292D50D4442) == 0x001190, "Member 'USK_M_Med_Soldier_04_Skeleton_AnimBP_C::AnimGraphNode_AnimDynamics_E019B8DC42D4A76813488292D50D4442' has a wrong offset!");
static_assert(offsetof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C, AnimGraphNode_AnimDynamics_53B6F76442E1E5367E83198574A7E337) == 0x0013F8, "Member 'USK_M_Med_Soldier_04_Skeleton_AnimBP_C::AnimGraphNode_AnimDynamics_53B6F76442E1E5367E83198574A7E337' has a wrong offset!");
static_assert(offsetof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C, AnimGraphNode_AnimDynamics_3B49A128489AAE9305B9BEACDF5446C4) == 0x001660, "Member 'USK_M_Med_Soldier_04_Skeleton_AnimBP_C::AnimGraphNode_AnimDynamics_3B49A128489AAE9305B9BEACDF5446C4' has a wrong offset!");
static_assert(offsetof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C, AnimGraphNode_AnimDynamics_01F0D350476ED069A3D9B380171159E1) == 0x0018C8, "Member 'USK_M_Med_Soldier_04_Skeleton_AnimBP_C::AnimGraphNode_AnimDynamics_01F0D350476ED069A3D9B380171159E1' has a wrong offset!");
static_assert(offsetof(USK_M_Med_Soldier_04_Skeleton_AnimBP_C, MeshToCopy) == 0x001B30, "Member 'USK_M_Med_Soldier_04_Skeleton_AnimBP_C::MeshToCopy' has a wrong offset!");

}

