#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Transylvania_LightMaster

#include "Basic.hpp"


namespace SDK::Params
{

// Function Transylvania_LightMaster.Transylvania_LightMaster_C.UserConstructionScript
// 0x0068 (0x0068 - 0x0000)
struct Transylvania_LightMaster_C_UserConstructionScript final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USpotLightComponent*>            CallFunc_GetComponentsByClass_ReturnValue;         // 0x0018(0x0010)(ZeroConstructor, ReferenceParm)
	class UPointLightComponent*                   CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPointLightComponent*>           CallFunc_GetComponentsByClass_ReturnValue2;        // 0x0040(0x0010)(ZeroConstructor, ReferenceParm)
	class UPointLightComponent*                   CallFunc_Array_Get_Item2;                          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue2;             // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Transylvania_LightMaster_C_UserConstructionScript) == 0x000008, "Wrong alignment on Transylvania_LightMaster_C_UserConstructionScript");
static_assert(sizeof(Transylvania_LightMaster_C_UserConstructionScript) == 0x000068, "Wrong size on Transylvania_LightMaster_C_UserConstructionScript");
static_assert(offsetof(Transylvania_LightMaster_C_UserConstructionScript, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'Transylvania_LightMaster_C_UserConstructionScript::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(Transylvania_LightMaster_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'Transylvania_LightMaster_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Transylvania_LightMaster_C_UserConstructionScript, Temp_int_Array_Index_Variable) == 0x000008, "Member 'Transylvania_LightMaster_C_UserConstructionScript::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(Transylvania_LightMaster_C_UserConstructionScript, Temp_int_Loop_Counter_Variable2) == 0x00000C, "Member 'Transylvania_LightMaster_C_UserConstructionScript::Temp_int_Loop_Counter_Variable2' has a wrong offset!");
static_assert(offsetof(Transylvania_LightMaster_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue2) == 0x000010, "Member 'Transylvania_LightMaster_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Transylvania_LightMaster_C_UserConstructionScript, Temp_int_Array_Index_Variable2) == 0x000014, "Member 'Transylvania_LightMaster_C_UserConstructionScript::Temp_int_Array_Index_Variable2' has a wrong offset!");
static_assert(offsetof(Transylvania_LightMaster_C_UserConstructionScript, CallFunc_GetComponentsByClass_ReturnValue) == 0x000018, "Member 'Transylvania_LightMaster_C_UserConstructionScript::CallFunc_GetComponentsByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Transylvania_LightMaster_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000028, "Member 'Transylvania_LightMaster_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(Transylvania_LightMaster_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'Transylvania_LightMaster_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Transylvania_LightMaster_C_UserConstructionScript, CallFunc_Array_AddUnique_ReturnValue) == 0x000034, "Member 'Transylvania_LightMaster_C_UserConstructionScript::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(Transylvania_LightMaster_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'Transylvania_LightMaster_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Transylvania_LightMaster_C_UserConstructionScript, CallFunc_GetComponentsByClass_ReturnValue2) == 0x000040, "Member 'Transylvania_LightMaster_C_UserConstructionScript::CallFunc_GetComponentsByClass_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Transylvania_LightMaster_C_UserConstructionScript, CallFunc_Array_Get_Item2) == 0x000050, "Member 'Transylvania_LightMaster_C_UserConstructionScript::CallFunc_Array_Get_Item2' has a wrong offset!");
static_assert(offsetof(Transylvania_LightMaster_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue2) == 0x000058, "Member 'Transylvania_LightMaster_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Transylvania_LightMaster_C_UserConstructionScript, CallFunc_Array_AddUnique_ReturnValue2) == 0x00005C, "Member 'Transylvania_LightMaster_C_UserConstructionScript::CallFunc_Array_AddUnique_ReturnValue2' has a wrong offset!");
static_assert(offsetof(Transylvania_LightMaster_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue2) == 0x000060, "Member 'Transylvania_LightMaster_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue2' has a wrong offset!");

}

